[
  {
    "skills": "convert-between-standard-and-expanded-form",
    "question_text": "What is 5000 + 400 + 20 + 9 in standard form?",
    "question_type": "Fill in the blank",
    "tag": "Gr4_1_E1",
    "correct_answers": [
      "5429"
    ],
    "solution": [
      [
        "1/6",
        "Standard form means writing a number using only digits in their place value positions. First, let's identify what each part represents using place value."
      ],
      [
        "2/6",
        "5000 = 5 thousands (the 5 goes in the thousands place)."
      ],
      [
        "3/6",
        "400 = 4 hundreds (the 4 goes in the hundreds place)."
      ],
      [
        "4/6",
        "20 = 2 tens (the 2 goes in the tens place)."
      ],
      [
        "5/6",
        "9 = 9 ones (the 9 goes in the ones place)."
      ],
      [
        "6/6",
        "Now arrange these digits by place value from left to right: thousands, hundreds, tens, ones. This gives us 5,429 in standard form."
      ]
    ],
    "solution_image_tag": [
      [
        "6/6",
        "Gr4_1_1_1_step_6",
        "A place value chart with four columns labeled from left to right: 'thousands,' 'hundreds,' 'tens,' and 'ones.' The chart has a light yellow/cream background for the headers and white cells below containing the digits. The number 5,429 is broken down with 5 in thousands, 4 in hundreds, 2 in tens, and 9 in ones."
      ]
    ],
    "question_number": "1_1"
  },
  {
    "skills": "word-names-for-numbers",
    "question_text": "How do you write this number using digits?\n\neight hundred forty-two",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_1_E2",
    "choices": [
      "892",
      "841",
      "891",
      "842"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/5",
        "Converting word names to digits requires an understanding of place value. Break down the number by place value: hundreds, tens, and ones."
      ],
      [
        "2/5",
        "'Eight hundred' means the digit 8 goes in the hundreds place, which represents 800."
      ],
      [
        "3/5",
        "'Forty' means the digit 4 goes in the tens place, which represents 40."
      ],
      [
        "4/5",
        "'Two' means the digit 2 goes in the ones place, which represents 2."
      ],
      [
        "5/5",
        "Now add the values: 800 + 40 + 2 = 842. So 'eight hundred forty-two' is written as 842."
      ]
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr4_1_2_1_step_1",
        "A three-column place value chart with headers 'hundreds,' 'tens,' and 'ones' on a light yellow/cream background. Below in white cells, the number 842 is shown with 8 in the hundreds place, 4 in the tens place, and 2 in the ones place."
      ]
    ],
    "question_number": "2_1"
  },
  {
    "skills": "compare-numbers",
    "question_text": "Which number is smallest?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_1_E3",
    "choices": [
      "1955",
      "1957",
      "5951"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "To find the smallest number, compare the numbers starting from the left digit (the biggest place value)."
      ],
      [
        "2/3",
        "All numbers have 4 digits. Look at the thousands place: 1955 and 1957 both start with 1, but 5951 starts with 5. Since 1 is smaller than 5, both 1955 and 1957 are smaller than 5951."
      ],
      [
        "3/3",
        "Now compare 1955 and 1957. The first three digits are the same (195), so look at the ones place: 5 vs 7. Since 5 is smaller than 7, the smallest number is 1955."
      ]
    ],
    "question_number": "3_1",
    "solution_image_tag": []
  },
  {
    "question_text": "Which number is largest?",
    "skills": "compare-numbers",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "3_2",
    "tag": "Gr4_1_E3",
    "choices": [
      "7945",
      "7943",
      "7549"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "To find the largest number, compare the numbers starting from the left digit (the biggest place value)."
      ],
      [
        "2/4",
        "All numbers have 4 digits. Look at the thousands place: all three numbers start with 7, so they're the same. Move to the hundreds place."
      ],
      [
        "3/4",
        "Compare hundreds place: 7945 has 9, 7943 has 9, and 7549 has 5. Since 9 is bigger than 5, both 7945 and 7943 are larger than 7549."
      ],
      [
        "4/4",
        "Now compare 7945 and 7943. The first three digits are the same (794), so look at the ones place: 5 vs 3. Since 5 is bigger than 3, 7945 is the largest number."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "question_text": "Some dealerships compared their vehicle sales. Which dealership sold the most vehicles?",
    "skills": "compare-numbers",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "3_3",
    "tag": "Gr4_1_E3",
    "image_tag": "Gr4_1_3_3",
    "choices": [
      "Affordable Cars",
      "RV City",
      "Cars of Pryor Falls",
      "Ledbetter Auto Mall"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/5",
        "This is a word problem asking us to find which dealership sold the most vehicles. Look at the table to find the numbers for each dealership."
      ],
      [
        "2/5",
        "From the table: Affordable Cars sold 141, RV City sold 114, Cars of Pryor Falls sold 171, and Ledbetter Auto Mall sold 174. To find the most vehicles sold, compare these numbers to find the largest."
      ],
      [
        "3/5",
        "All numbers have 3 digits. Start comparing from the hundreds place: all have 1 in the hundreds place, so they are the same."
      ],
      [
        "4/5",
        "Compare the tens place: 141 has 4, 114 has 1, 171 has 7, and 174 has 7. Since 7 is bigger than 4 and 1, both 171 and 174 are larger than the others."
      ],
      [
        "5/5",
        "Now compare 171 and 174. They both have 17 in the tens and hundreds places, so look at the ones place: 1 vs 4. Since 4 is bigger than 1, 174 is the largest number. Therefore, Ledbetter Auto Mall sold the most vehicles."
      ]
    ],
    "solution_image_tag": [],
    "backend_description": "A data table with a light purple header titled 'Vehicle sales'. The table has two columns: 'Dealership' and 'Number of vehicles'. It contains four rows of data: Affordable Cars: 141 vehicles, RV City: 114 vehicles, Cars of Pryor Falls: 171 vehicles, Ledbetter Auto Mall: 174 vehicles. The table has a clean layout with black text on white cells, bordered by thin black lines. The header row has a lavender/light purple background."
  },
  {
    "question_text": "Roxanne kept a log of how many pages she read each month. In which month did Roxanne read the fewest pages?",
    "skills": "compare-numbers",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "3_4",
    "tag": "Gr4_1_E3",
    "image_tag": "Gr4_1_3_4",
    "choices": [
      "July",
      "August",
      "September",
      "October"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/5",
        "This word problem asks us to find which month Roxanne read the fewest pages. Look at the table to find the numbers for each month."
      ],
      [
        "2/5",
        "From the table: July had 629 pages, August had 662 pages, September had 699 pages, and October had 692 pages. To find the fewest pages, compare these numbers to find the smallest."
      ],
      [
        "3/5",
        "All numbers have 3 digits. Start comparing from the hundreds place: all numbers have 6 in the hundreds place, so they are the same. Move to the tens place."
      ],
      [
        "4/5",
        "Compare the tens place: 629 has 2, 662 has 6, 699 has 9, and 692 has 9. Since 2 is smaller than 6 and 9, the number 629 is the smallest."
      ],
      [
        "5/5",
        "629 is the smallest number, which corresponds to July. Therefore, Roxanne read the fewest pages in July."
      ]
    ],
    "solution_image_tag": [],
    "backend_description": "A pink-themed data table titled 'Pages read'. The table has two columns: 'Month' and 'Number of pages', showing reading progress over four months: July: 629 pages, August: 662 pages, September: 699 pages, October: 692 pages. The table features a pink header row and black text on white cells with black borders throughout."
  },
  {
    "skills": "put-numbers-in-order",
    "question_text": "Put these numbers in order from greatest to least.",
    "tag": "Gr4_1_E4",
    "question_type": "Ordering Items",
    "choices": [
      "82",
      "11",
      "38",
      "87",
      "13"
    ],
    "correct_answers": [
      "87",
      "82",
      "38",
      "13",
      "11"
    ],
    "solution": [
      [
        "1/6",
        "To put numbers in order from greatest to least, we need to find the largest number first, then the second largest, and keep going until we find the smallest."
      ],
      [
        "2/6",
        "Look at all the numbers: 82, 11, 38, 87, 13. To compare them, start by looking at the tens place. 87 and 82 both have 8 in the tens place, which is bigger than the others."
      ],
      [
        "3/6",
        "Between 87 and 82, look at the ones place: 7 is bigger than 2, so 87 is the largest and 82 is the second largest."
      ],
      [
        "4/6",
        "For the remaining numbers, 38 has 3 in the tens place, while 13 and 11 have 1, so 38 comes next in the order after 82."
      ],
      [
        "5/6",
        "Finally, between 13 and 11, both have 1 in the tens place, so look at the ones place: 3 is bigger than 1. Thus 13 is larger than 11 and 11 is the smallest."
      ],
      [
        "6/6",
        "The order from greatest to least is: 87, 82, 38, 13, 11."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "4_1"
  },
  {
    "skills": "rounding",
    "question_text": "What is 727 rounded to the nearest hundred?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_2_E1",
    "choices": [
      "720",
      "730",
      "700",
      "800"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/5",
        "To round 727 to the nearest hundred, first find the digit in the hundreds place. In 727, the hundreds digit is 7."
      ],
      [
        "2/5",
        "Next, look at the digit in the tens place (one place to the right of hundreds). In 727, the tens digit is 2."
      ],
      [
        "3/5",
        "Use the rounding rule: if the tens digit is 5 or greater, round up. If it is less than 5, round down. Since 2 is less than 5, we round down."
      ],
      [
        "4/5",
        "To round down, keep the hundreds digit the same (7) and change all digits to the right to zeros. This gives us 700."
      ],
      [
        "5/5",
        "Therefore, 727 rounded to the nearest hundred is 700."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_1"
  },
  {
    "question_text": "What is 6705 rounded to the nearest thousand?",
    "skills": "rounding",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_2",
    "tag": "Gr4_2_E1",
    "choices": [
      "7000",
      "6700",
      "6000",
      "6800"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/5",
        "To round 6705 to the nearest thousand, first find the digit in the thousands place. In 6705, the thousands digit is 6."
      ],
      [
        "2/5",
        "Next, look at the digit in the hundreds place (one place to the right of thousands). In 6705, the hundreds digit is 7."
      ],
      [
        "3/5",
        "Use the rounding rule: if the hundreds digit is 5 or greater, round up. If it is less than 5, round down. Since 7 is greater than 5, we round up."
      ],
      [
        "4/5",
        "To round up, add 1 to the thousands digit (6 becomes 7) and change all digits to the right to zeros. This gives us 7000."
      ],
      [
        "5/5",
        "Therefore, 6705 rounded to the nearest thousand is 7000."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "question_text": "What is 13 rounded to the nearest ten?",
    "skills": "rounding",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_3",
    "tag": "Gr4_2_E1",
    "choices": [
      "40",
      "10",
      "20",
      "30"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/5",
        "To round 13 to the nearest ten, first find the digit in the tens place. In 13, the tens digit is 1."
      ],
      [
        "2/5",
        "Next, look at the digit in the ones place (one place to the right of tens). In 13, the ones digit is 3."
      ],
      [
        "3/5",
        "Use the rounding rule: if the ones digit is 5 or greater, round up. If it is less than 5, round down. Since 3 is less than 5, we round down."
      ],
      [
        "4/5",
        "To round down, keep the tens digit the same (1) and change all digits to the right to zeros. This gives us 10."
      ],
      [
        "5/5",
        "Therefore, 13 rounded to the nearest ten is 10."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "skills": "rounding-input-output-tables",
    "question_text": "Complete the table.\n\nRule: Round to the nearest hundred",
    "image_tag": "Gr4_2_2_1",
    "question_type": "Fill in the blank",
    "tag": "Gr4_2_E2",
    "correct_answers": [
      "500",
      "7200",
      "9800"
    ],
    "solution": [
      [
        "1/5",
        "To complete this table, round each number in the 'In' column to the nearest hundred like 458 to 500 in the first row as an example. Look at the tens digit to decide whether to round up or down."
      ],
      [
        "2/5",
        "For 524: The hundreds digit is 5, and the tens digit is 2. Since 2 is less than 5, round down. Keep the hundreds digit (5) and change tens and ones to zeros: 524 rounds to 500."
      ],
      [
        "3/5",
        "For 7205: The hundreds digit is 2, and the tens digit is 0. Since 0 is less than 5, round down. Keep the hundreds digit (2) and change tens and ones to zeros: 7205 rounds to 7200."
      ],
      [
        "4/5",
        "For 9755: The hundreds digit is 7, and the tens digit is 5. Since 5 is equal to 5, round up. Add 1 to the hundreds digit (7 becomes 8) and change tens and ones to zeros: 9755 rounds to 9800."
      ],
      [
        "5/5",
        "Complete the table: 524 rounds to 500, 7205 rounds to 7200, 9755 rounds to 9800."
      ]
    ],
    "solution_image_tag": [
      [
        "5/5",
        "Gr4_2_2_1_step_5",
        "A two-column table with headers 'In' and 'Out' on a blue background. The table demonstrates a rounding pattern where numbers in the 'In' column are rounded to the nearest hundred in the 'Out' column: 458→500, 524→500 (purple), 7205→7200 (purple), 9755→9800 (purple)."
      ]
    ],
    "question_number": "2_1",
    "backend_description": "A simple two-column table with 'In' and 'Out' headers on a blue background. The 'In' column contains the values 458, 524, 7205, and 9755. The 'Out' column shows 500 in the first row, with the remaining three cells empty (blank white boxes), suggesting this is an exercise where students need to fill in the missing output values."
  },
  {
    "skills": "rounding-puzzles",
    "question_text": "What number is halfway between 1800 and 1900?",
    "question_type": "Fill in the blank",
    "tag": "Gr4_2_E3",
    "correct_answers": [
      "1850"
    ],
    "solution": [
      [
        "1/4",
        "To find the number halfway between 1800 and 1900, think about rounding. The halfway number is the one that is the same distance from both 1800 and 1900; it is the middle of the two numbers. This is where numbers change from rounding down to 1800 to rounding up to 1900."
      ],
      [
        "2/4",
        "To find this halfway point, first find the difference between the two numbers: 1900 - 1800 = 100."
      ],
      [
        "3/4",
        "Half of 100 is 50, so adding this 50 to the smaller number, 1800 + 50 = 1850, gives us the halfway point."
      ],
      [
        "4/4",
        "Check with rounding: numbers less than 1850 (like 1849) round down to 1800, while numbers greater than 1850 (like 1851) round up to 1900. Therefore, 1850 is halfway between 1800 and 1900."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_1"
  },
  {
    "question_text": "A number has the digits 3 and 9. To the nearest ten, the number rounds to 90. What is the number?",
    "skills": "rounding-puzzles",
    "question_type": "Fill in the blank",
    "question_number": "3_2",
    "tag": "Gr4_2_E3",
    "correct_answers": [
      "93"
    ],
    "solution": [
      [
        "1/5",
        "We need a number with digits 3 and 9 that rounds to 90 when rounded to the nearest ten."
      ],
      [
        "2/5",
        "Since the number rounds to 90, it must be between 85 and 94. Numbers from 85 to 94 all round to 90."
      ],
      [
        "3/5",
        "The number uses only digits 3 and 9, so our choices are: 39 or 93."
      ],
      [
        "4/5",
        "Check each option: 39 rounds to 40 (not 90), but 93 rounds to 90 because the ones digit 3 is less than 5, so we round down."
      ],
      [
        "5/5",
        "Therefore, the number is 93."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "skills": "identify-halves-thirds-and-fourths",
    "question_text": "Which figure shows halves?\n",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_2_E4",
    "image_choice_tags": [
      "Gr4_2_4_1_A",
      "Gr4_2_4_1_B"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/4",
        "To show halves, a figure must be divided into 2 equal parts. Each part must be exactly the same size."
      ],
      [
        "2/4",
        "Look at Figure A: The rectangle is divided into 2 parts, but they are not the same size. One part is bigger than the other, so this does not show halves."
      ],
      [
        "3/4",
        "Look at Figure B: The rectangle is divided into 2 parts that are exactly the same size. Each part is equal, so this shows halves."
      ],
      [
        "4/4",
        "Therefore, Figure B shows halves because it has 2 equal parts."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "4_1",
    "image_choice_tags_backend_description": [
      "A domino tile showing 8 dots arranged in two columns. Each column has 4 dots arranged vertically. The tile is orange/brown colored with white dots, and sits above a blue horizontal line.",
      "A domino tile showing 12 dots arranged in two sections. The left section has 2 columns of 3 dots each (6 dots total), and the right section also has 2 columns of 3 dots each (6 dots total), making 12 dots in total. The tile is orange/brown colored with white dots, and sits above a blue horizontal line."
    ]
  },
  {
    "skills": "understand-fractions-fraction-bars",
    "question_text": "Use the fraction bar to complete the sentences below.\n\nThe fraction bar has _ equal parts.\nEach part is _ of the whole.",
    "image_tag": "Gr4_3_1_1",
    "question_type": "Multiple fill in the blank",
    "tag": "Gr4_3_E1",
    "orderMatter": true,
    "correct_answers": [
      "3",
      "1/3"
    ],
    "solution": [
      [
        "1/4",
        "Look at the fraction bar and count how many equal parts it has."
      ],
      [
        "2/4",
        "The fraction bar is divided into 3 equal parts."
      ],
      [
        "3/4",
        "When something is divided into 3 equal parts, each part is 1 of the 3. We call this one-third and write it as $\\frac{1}{3}$."
      ],
      [
        "4/4",
        "Therefore, the fraction bar has 3 equal parts and each part is $\\frac{1}{3}$ of the whole."
      ]
    ],
    "solution_image_tag": [
      [
        "1/4",
        "Gr4_3_1_1_step_1",
        "Three empty rectangular boxes arranged horizontally, outlined in blue. The boxes appear to be placeholders for answers or values to be filled in."
      ]
    ],
    "question_number": "1_1",
    "backend_description": "Three equal-sized empty rectangles arranged horizontally in a row. Each rectangle has a blue border and white interior, likely intended for students to draw or write in as part of a mathematical exercise."
  },
  {
    "skills": "understand-fractions-area-models",
    "question_text": "Use the rectangle to complete the sentences below.\n\nThe rectangle has _ equal parts.\nEach part is _ of the whole.",
    "image_tag": "Gr4_3_2_1",
    "question_type": "Multiple fill in the blank",
    "tag": "Gr4_3_E2",
    "orderMatter": true,
    "correct_answers": [
      "2",
      "1/2"
    ],
    "solution": [
      [
        "1/4",
        "Look at the rectangle and count how many equal parts it has."
      ],
      [
        "2/4",
        "The rectangle has 2 equal parts."
      ],
      [
        "3/4",
        "When something is divided into 2 equal parts, each part is 1 of the 2. We call this one-half and write it as $\\frac{1}{2}$."
      ],
      [
        "4/4",
        "Therefore, the rectangle has 2 equal parts and each part is $\\frac{1}{2}$ of the whole."
      ]
    ],
    "solution_image_tag": [
      [
        "1/4",
        "Gr4_3_2_1_step_1",
        "Two empty rectangular boxes arranged horizontally, outlined in blue. Similar to the previous image, these appear to be answer boxes waiting to be filled."
      ]
    ],
    "question_number": "2_1",
    "backend_description": "Two empty rectangles side by side, each with a blue border and white interior. The rectangles appear to be equal in size and are positioned horizontally next to each other."
  },
  {
    "skills": "show-fractions-fraction-bars",
    "question_text": "Shade 1 part of the fraction bar.\n\nWhen 1 part of the fraction bar is shaded, what fraction is shaded?",
    "image_tag": "Gr4_3_3_1",
    "question_type": "Fill in the blank",
    "tag": "Gr4_3_E3",
    "correct_answers": [
      "1/2"
    ],
    "solution": [
      [
        "1/4",
        "First, look at the fraction bar and count how many equal parts it has."
      ],
      [
        "2/4",
        "The fraction bar has 2 equal parts. When something is divided into 2 equal parts, each part is 1 of the 2, which we write as $\\frac{1}{2}$."
      ],
      [
        "3/4",
        "Shade 1 part of the fraction bar. Now 1 out of 2 parts is shaded."
      ],
      [
        "4/4",
        "Therefore, when 1 part is shaded, the fraction $\\frac{1}{2}$ is shaded."
      ]
    ],
    "solution_image_tag": [
      [
        "3/4",
        "Gr4_3_3_1_step_3",
        "A rectangular bar divided into two sections. The left section is shaded pink/magenta and contains the fraction '1/2' written inside it. The right section is white/unshaded. This represents a visual fraction model showing one-half."
      ]
    ],
    "question_number": "3_1",
    "backend_description": "Two rectangular boxes arranged horizontally, each with a green border and white interior. The rectangles are of equal size and separated by a small gap."
  },
  {
    "skills": "show-fractions-area-models",
    "question_text": "Shade 1 part of the rectangle.\n\nWhen 1 part of the rectangle is shaded, what fraction is shaded?",
    "image_tag": "Gr4_3_4_1",
    "question_type": "Fill in the blank",
    "tag": "Gr4_3_E4",
    "correct_answers": [
      "1/3"
    ],
    "solution": [
      [
        "1/4",
        "First, look at the rectangle and count how many equal parts it has."
      ],
      [
        "2/4",
        "The rectangle has 3 equal parts. When something is divided into 3 equal parts, each part is 1 of the 3, which we write as $\\frac{1}{3}$."
      ],
      [
        "3/4",
        "Shade 1 part of the rectangle. Now 1 out of 3 parts is shaded."
      ],
      [
        "4/4",
        "Therefore, when 1 part is shaded, the fraction $\\frac{1}{3}$ is shaded."
      ]
    ],
    "solution_image_tag": [
      [
        "3/4",
        "Gr4_3_4_1_step_3",
        "A vertical rectangular bar divided into three equal sections. Only the top section is shaded in green, while the bottom two sections remain white/unshaded. This appears to represent the fraction 1/3 visually."
      ]
    ],
    "question_number": "4_1",
    "backend_description": "Three empty rectangles stacked vertically on top of each other. Each rectangle has a green border with a white interior, and they appear to be of equal size."
  },
  {
    "skills": "match-fractions-to-models-halves-thirds-and-fourths",
    "question_text": "Which figure shows fourths?\n",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_4_E1",
    "image_choice_tags": [
      "Gr4_4_1_1_A",
      "Gr4_4_1_1_B"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/4",
        "To show fourths, a figure must be divided into 4 equal parts. When something is divided into 4 equal parts, each part is called a fourth."
      ],
      [
        "2/4",
        "Look at Figure A: The circle is divided into 2 equal parts. Since there are only 2 parts, this does not show fourths."
      ],
      [
        "3/4",
        "Look at Figure B: The circle is divided into 4 equal parts. Each part is the same size, so this shows fourths."
      ],
      [
        "4/4",
        "Therefore, Figure B shows fourths because it has 4 equal parts."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_1",
    "image_choice_tags_backend_description": [
      "A circular pie chart divided into two halves by a vertical white line down the center. The circle has a peach/orange colored outer border. Both halves are filled with a pink color and contain a pattern of small white dots scattered throughout each section.",
      "A circular pie chart divided into four equal quarters by two perpendicular lines creating a cross pattern through the center. The circle has a peach/orange colored outer border. All four quarters are filled with a pink color and contain small white dots scattered throughout each section."
    ]
  },
  {
    "skills": "match-unit-fractions-to-models",
    "question_text": "Look at the coloured part of each shape. Which shape shows the fraction $\\frac{1}{6}$?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_4_E2",
    "image_choice_tags": [
      "Gr4_4_2_1_A",
      "Gr4_4_2_1_B",
      "Gr4_4_2_1_C",
      "Gr4_4_2_1_D"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/5",
        "To find which shape shows $\\frac{1}{6}$, we need to find a shape that has 6 equal parts with 1 part colored."
      ],
      [
        "2/5",
        "Look at each shape and count the total parts: Shape A has 8 parts, Shape B has 2 parts, Shape C has 3 parts, and Shape D has 6 parts."
      ],
      [
        "3/5",
        "Since $\\frac{1}{6}$ means 1 out of 6 equal parts, we need the shape with 6 equal parts. Only Shape D has 6 equal parts."
      ],
      [
        "4/5",
        "Look at Shape D: It has 6 equal parts and 1 part is colored. This shows 1 out of 6 parts colored."
      ],
      [
        "5/5",
        "Therefore, Shape D shows the fraction $\\frac{1}{6}$."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "2_1",
    "image_choice_tags_backend_description": [
      "An octagon (8-sided polygon) with purple/magenta outline. The octagon is divided into 8 triangular sections by lines radiating from the center point to each vertex. One of the triangular sections is filled with a light purple/pink color while the other 7 sections remain white/unfilled.",
      "A rectangle oriented horizontally with a green outline. The rectangle is divided into two equal halves by a horizontal line through the middle. The bottom half is filled with a light green color while the top half remains white/unfilled.",
      "A triangular shape with blue outline, appearing to be an irregular triangle. The triangle has internal lines creating smaller triangular sections within it, resembling a three-dimensional representation or a triangular pyramid viewed from above.",
      "A rectangle oriented vertically with an orange outline. The rectangle is divided into 6 equal sections by lines creating a 2×3 grid (2 columns, 3 rows). The bottom-left section is filled with a light orange/peach color while the other 5 sections remain white/unfilled."
    ]
  },
  {
    "question_text": "What fraction of the shape is pink?",
    "skills": "match-unit-fractions-to-models",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_2",
    "tag": "Gr4_4_E2",
    "image_tag": "Gr4_4_2_2",
    "choices": [
      "$\\frac{1}{2}$",
      "$\\frac{1}{4}$",
      "$\\frac{1}{3}$",
      "$\\frac{1}{6}$"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/4",
        "To find what fraction of the shape is pink, first count the total number of equal parts in the circle."
      ],
      [
        "2/4",
        "The circle has 6 equal parts."
      ],
      [
        "3/4",
        "Next, count how many parts are pink. There is 1 pink part."
      ],
      [
        "4/4",
        "Since 1 out of 6 equal parts is pink, the fraction is $\\frac{1}{6}$."
      ]
    ],
    "solution_image_tag": [],
    "backend_description": "A circle divided into 6 equal triangular sections by lines radiating from the center. One section (in the bottom-left area) is shaded with a light purple/pink color, while the other five sections remain white. The entire circle has a purple outline."
  },
  {
    "skills": "match-fractions-to-models",
    "question_text": "Look at the coloured part of each shape. Which shape shows the fraction $\\frac{2}{3}$?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_4_E3",
    "image_choice_tags": [
      "Gr4_4_3_1_A",
      "Gr4_4_3_1_B",
      "Gr4_4_3_1_C",
      "Gr4_4_3_1_D"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/5",
        "To find which shape shows $\\frac{2}{3}$, we need to find a shape that has 3 equal parts with 2 parts colored."
      ],
      [
        "2/5",
        "Look at each shape and count the total parts: Shape A has 4 parts, Shape B has 8 parts, Shape C has 6 parts, and Shape D has 3 parts."
      ],
      [
        "3/5",
        "Since $\\frac{2}{3}$ means 2 out of 3 equal parts, we need the shape with 3 equal parts. Only Shape D has 3 equal parts."
      ],
      [
        "4/5",
        "Look at Shape D: It has 3 equal parts and 2 parts are colored. This shows 2 out of 3 parts colored."
      ],
      [
        "5/5",
        "Therefore, Shape D shows the fraction $\\frac{2}{3}$."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_1",
    "image_choice_tags_backend_description": [
      "A diamond/rhombus shape with purple outline, oriented so one vertex points upward. The diamond is divided into 4 triangular sections by two diagonal lines connecting opposite vertices. The entire interior is filled with a light purple/pink color.",
      "A circle with green outline divided into 8 equal triangular sections by lines radiating from the center point. All 8 sections are filled with a light green color, creating a pie chart appearance with 8 equal wedges.",
      "A circle with purple outline divided into 6 equal triangular sections by lines radiating from the center point. Two adjacent sections are filled with a light purple color while the other 4 sections remain white/unfilled.",
      "A triangular shape with cyan/turquoise outline. The triangle has one internal line creating two sections within it. The shape appears to be pointing to the right, with the internal division creating two triangular sections of different sizes."
    ]
  },
  {
    "skills": "fractions-of-number-lines-unit-fractions",
    "question_text": "Which number line shows a coloured segment with a length of $\\frac{1}{4}$?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_4_E4",
    "image_choice_tags": [
      "Gr4_4_4_1_A",
      "Gr4_4_4_1_B",
      "Gr4_4_4_1_C"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/5",
        "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
      ],
      [
        "2/5",
        "First number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
      ],
      [
        "3/5",
        "Second number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
      ],
      [
        "4/5",
        "Third number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
      ],
      [
        "5/5",
        "Therefore, the second number line is the one which shows a coloured segment with a length of $\\frac{1}{4}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_4_4_1_step_2",
        "A horizontal number line with arrows on both ends. The line has tick marks at 0 and 1, with a blue segment highlighted between 0 and approximately 1/3 of the way to 1."
      ],
      [
        "3/5",
        "Gr4_4_4_1_step_3",
        "A horizontal number line with arrows on both ends and tick marks at 0 and 1. The blue highlighted segment appears to extend from 0 to approximately 1/4 of the way to 1."
      ],
      [
        "4/5",
        "Gr4_4_4_1_step_4",
        "A horizontal number line with arrows on both ends and tick marks at 0 and 1. The blue highlighted segment extends from 0 to approximately 1/5 of the way to 1."
      ]
    ],
    "question_number": "4_1",
    "image_choice_tags_backend_description": [
      "A horizontal number line from 0 to 1 with arrow endpoints. A blue line segment is highlighted starting from 0 and extending to approximately the 0.33 mark. The number line has tick marks at 0, approximately 0.33, 0.67, and 1.",
      "A horizontal number line from 0 to 1 with arrow endpoints. A blue line segment is highlighted starting from 0 and extending to approximately the 0.25 mark. The number line has tick marks at 0, 0.25, 0.5, 0.75, and 1.",
      "A horizontal number line from 0 to 1 with arrow endpoints. A blue line segment is highlighted starting from 0 and extending to approximately the 0.2 mark. The number line has tick marks at 0, 0.2, 0.4, 0.6, 0.8, and 1, creating five equal intervals."
    ]
  },
  {
    "skills": "fractions-of-number-lines-halves-fourths-and-eighths",
    "question_text": "Which number line shows a coloured segment with a length of $\\frac{1}{8}$?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_5_E1",
    "image_choice_tags": [
      "Gr4_5_1_1_A",
      "Gr4_5_1_1_B",
      "Gr4_5_1_1_C"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/5",
        "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
      ],
      [
        "2/5",
        "First number line: There are 7 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{7}$."
      ],
      [
        "3/5",
        "Second number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
      ],
      [
        "4/5",
        "Third number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
      ],
      [
        "5/5",
        "Therefore, the third number line is the one which shows a coloured segment with a length of $\\frac{1}{8}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_5_1_1_step_2",
        "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from 0 to approximately 0.14, showing one-seventh of the unit interval."
      ],
      [
        "3/5",
        "Gr4_5_1_1_step_3",
        "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from 0 to approximately 0.11, showing one-ninth of the unit interval."
      ],
      [
        "4/5",
        "Gr4_5_1_1_step_4",
        "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from 0 to 0.125, showing one-eighth of the unit interval."
      ]
    ],
    "question_number": "1_1",
    "image_choice_tags_backend_description": [
      "A horizontal number line from 0 to 1 with tick marks dividing it into 7 equal segments. A blue highlighted segment spans from 0 to approximately 0.14 (the first seventh of the number line).",
      "A horizontal number line from 0 to 1 with tick marks dividing it into 9 equal segments. A blue highlighted segment spans from 0 to approximately 0.11 (the first ninth of the number line).",
      "A horizontal number line from 0 to 1 with tick marks dividing it into 8 equal segments. A blue highlighted segment spans from 0 to approximately 0.125 (the first eighth of the number line)."
    ]
  },
  {
    "skills": "fractions-of-number-lines",
    "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr4_5_E2",
    "image_choice_tags": [
      "Gr4_5_2_1_A",
      "Gr4_5_2_1_B",
      "Gr4_5_2_1_C"
    ],
    "correct_answers": [
      "A",
      "B",
      "C"
    ],
    "solution": [
      [
        "1/5",
        "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
      ],
      [
        "2/5",
        "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
      ],
      [
        "3/5",
        "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
      ],
      [
        "4/5",
        "Third number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
      ],
      [
        "5/5",
        "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{6}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_5_2_1_step_2",
        "A horizontal number line from 0 to 1 with regular interval markings. A blue line segment is highlighted from approximately 0.167 to 0.333, representing one-sixth of the unit interval at that position."
      ],
      [
        "3/5",
        "Gr4_5_2_1_step_3",
        "A number line from 0 to 1 with a blue segment highlighted from approximately 0.667 to 0.833, showing another one-sixth interval further along the line."
      ],
      [
        "4/5",
        "Gr4_5_2_1_step_4",
        "A number line from 0 to 1 with a blue segment highlighted from approximately 0.5 to 0.667, demonstrating yet another one-sixth interval at the middle portion of the line."
      ]
    ],
    "question_number": "2_1",
    "image_choice_tags_backend_description": [
      "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.167 to 0.333 (covering one-sixth of the number line, between the 1st and 2nd tick marks).",
      "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.667 to 0.833 (covering one-sixth of the number line, between the 4th and 5th tick marks).",
      "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.5 to 0.667 (covering one-sixth of the number line, between the 3rd and 4th tick marks)."
    ]
  },
  {
    "skills": "identify-unit-fractions-on-number-lines",
    "question_text": "What fraction does the number line show?",
    "image_tag": "Gr4_5_3_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_5_E3",
    "choices": [
      "$\\frac{1}{2}$",
      "$\\frac{1}{4}$",
      "$\\frac{1}{5}$",
      "$\\frac{1}{3}$"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "Look at the number line. The dot shows the location of a fraction between 0 and 1."
      ],
      [
        "2/4",
        "Count the number of equal segments between 0 and 1. There are 2 equal segments."
      ],
      [
        "3/4",
        "Count how many segments the dot is from 0. The dot is 1 segment away from 0."
      ],
      [
        "4/4",
        "Since the dot is 1 segment away from 0 and there are 2 equal segments total, the number line shows $\\frac{1}{2}$."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_1",
    "backend_description": "A horizontal number line from 0 to 1. A green diamond-shaped marker is positioned on the line, appearing to be at approximately the 0.5 position. The line has clear endpoints labeled 0 and 1."
  },
  {
    "skills": "identify-fractions-on-number-lines",
    "question_text": "What fraction does the number line show?\nUse a slash ( / ) to separate the numerator and denominator.",
    "image_tag": "Gr4_5_4_1",
    "question_type": "Fill in the blank",
    "tag": "Gr4_5_E4",
    "correct_answers": [
      "1/4"
    ],
    "solution": [
      [
        "1/4",
        "Look at the number line. The dot shows the location of a fraction between 0 and 1."
      ],
      [
        "2/4",
        "Count the number of equal segments between 0 and 1. There are 4 equal segments."
      ],
      [
        "3/4",
        "Count how many segments the dot is from 0. The dot is 1 segment away from 0."
      ],
      [
        "4/4",
        "Since the dot is 1 segment away from 0 and there are 4 equal segments total, the number line shows $\\frac{1}{4}$."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "4_1",
    "backend_description": "A horizontal number line from 0 to 1 with three equally-spaced tick marks dividing it into quarters. A blue diamond-shaped marker is positioned at the first tick mark, representing 1/4 or 0.25 position on the line. The number line has labeled endpoints at 0 and 1."
  },
  {
    "skills": "unit-fractions-modelling-word-problems",
    "question_text": "Adam's class wants to give some money to the children's hospital in town. The class is planning to earn the money with a bake sale. So, Adam has baked banana bread to sell. Adam cuts the banana bread into 2 equal pieces.\n\nWhich fraction model represents one piece of the banana bread?\n",
    "image_tag": "Gr4_6_1_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_6_E1",
    "image_choice_tags": [
      "Gr4_6_1_1_A",
      "Gr4_6_1_1_B"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "The banana bread is the whole. Adam cuts it into 2 equal pieces."
      ],
      [
        "2/4",
        "The fraction model should have 2 equal parts to match how Adam cut the banana bread."
      ],
      [
        "3/4",
        "Color 1 part to show one piece of the banana bread."
      ],
      [
        "4/4",
        "This fraction model shows $\\frac{1}{2}$ and represents one piece of the banana bread."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_6_1_1_step_2",
        "A rectangle divided into two equal vertical sections. Both sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
      ],
      [
        "3/4",
        "Gr4_6_1_1_step_3",
        "The same rectangle divided into two equal vertical sections. The left half is now filled with blue color while the right half remains white, clearly showing one-half shaded."
      ]
    ],
    "question_number": "1_1",
    "backend_description": "A simple rectangle divided into two equal parts. The left half is colored blue, and the right half is white/empty. This represents the fraction 1/2 visually.",
    "image_choice_tags_backend_description": [
      "A rectangular bar divided into two sections. The left section is filled with a medium blue color and takes up exactly half of the rectangle. The right section is white/unfilled and also takes up half of the rectangle. The rectangle has a black border outline.",
      "A rectangular bar divided into three equal sections by vertical lines. The leftmost section is filled with a light green color and takes up one-third of the rectangle. The middle and right sections are white/unfilled, each taking up one-third of the rectangle. The rectangle has a black border outline."
    ]
  },
  {
    "skills": "unit-fractions-word-problems",
    "question_text": "Cameron is making rice pudding for his family. He divides the rice pudding into 2 equal-sized servings.\n\nWhat fraction represents each serving of the rice pudding?",
    "question_type": "Fill in the blank",
    "tag": "Gr4_6_E2",
    "correct_answers": [
      "1/2"
    ],
    "solution": [
      [
        "1/4",
        "The rice pudding is the whole. Cameron divides it into 2 equal-sized servings."
      ],
      [
        "2/4",
        "When something is divided into 2 equal parts, the denominator of the fraction is 2."
      ],
      [
        "3/4",
        "Each serving is 1 out of the 2 equal parts, so the numerator of the fraction is 1."
      ],
      [
        "4/4",
        "Therefore, the fraction $\\frac{1}{2}$ represents each serving of the rice pudding."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "2_1"
  },
  {
    "skills": "fractions-of-a-whole-modelling-word-problems",
    "question_text": "In a far off land, a magical gem keeps the fairy palace safe. A mean witch breaks the gem into 3 equal pieces and scatters them into the wind. Sir Goodheart is a brave knight who promises to help the fairies by finding all the pieces. So far, Sir Goodheart has found 1 piece of the gem.\n\nWhich model represents the fraction of the gem that Sir Goodheart has found?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_6_E3",
    "image_choice_tags": [
      "Gr4_6_3_1_A",
      "Gr4_6_3_1_B"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/5",
        "The gem is the whole. The witch breaks it into 3 equal pieces, so we need a model with 3 equal parts."
      ],
      [
        "2/5",
        "Look at Model A: This circle is divided into 3 equal parts with 1 part colored. This shows $\\frac{1}{3}$."
      ],
      [
        "3/5",
        "Look at Model B: This circle is divided into 4 equal parts with 1 part colored. This shows $\\frac{1}{4}$."
      ],
      [
        "4/5",
        "Since the gem was broken into 3 equal pieces and Sir Goodheart found 1 piece, we need the model that shows $\\frac{1}{3}$."
      ],
      [
        "5/5",
        "Therefore, Model A represents the fraction of the gem that Sir Goodheart has found."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_1",
    "image_choice_tags_backend_description": [
      "A circle (pie chart) divided into three sections. One section, colored in orange/peach, takes up approximately one-third of the circle (about 120 degrees). The remaining two-thirds of the circle is white/unfilled. The dividing lines extend from the center to the edge of the circle.",
      "A circle divided into four equal quadrants by two perpendicular lines that intersect at the center. One quadrant (the top-right section) is filled with a light purple/lavender color, representing one-fourth or 25% of the circle. The other three quadrants are white/unfilled."
    ]
  },
  {
    "skills": "fractions-of-a-whole-word-problems",
    "question_text": "Logan and Hannah are wrapping gifts to give to their cousins at the family reunion. To avoid making anyone feel left out, Logan and Hannah got each of the 2 cousins the same gift. Logan cuts a sheet of wrapping paper into 2 equal pieces. Logan starts wrapping gifts first. He uses 1 piece to wrap a gift.\n\nWhat fraction of the sheet of wrapping paper does Logan use?",
    "question_type": "Fill in the blank",
    "tag": "Gr4_6_E4",
    "correct_answers": [
      "1/2"
    ],
    "solution": [
      [
        "1/4",
        "The sheet of wrapping paper is the whole. Logan cuts it into 2 equal pieces."
      ],
      [
        "2/4",
        "When something is divided into 2 equal pieces, the denominator of the fraction is 2."
      ],
      [
        "3/4",
        "Logan uses 1 piece to wrap a gift. Since he uses 1 out of the 2 equal pieces, the numerator of the fraction is 1."
      ],
      [
        "4/4",
        "Therefore, Logan uses $\\frac{1}{2}$ of the sheet of wrapping paper."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "4_1"
  },
  {
    "skills": "fractions-of-a-group-word-problems",
    "question_text": "Mackenzie and her father made 3 pancakes. They put blueberries in 2 of the pancakes.\n\nWhat fraction of the pancakes have blueberries now?\n",
    "question_type": "Fill in the blank",
    "tag": "Gr4_7_E1",
    "correct_answers": [
      "2/3"
    ],
    "solution": [
      [
        "1/4",
        "To find the fraction of pancakes with blueberries, we need to count the total number of pancakes and how many have blueberries."
      ],
      [
        "2/4",
        "Mackenzie and her father made 3 pancakes in total. This will be the denominator of our fraction."
      ],
      [
        "3/4",
        "They put blueberries in 2 of the pancakes. This will be the numerator of our fraction."
      ],
      [
        "4/4",
        "Therefore, $\\frac{2}{3}$ of the pancakes have blueberries now."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_1"
  },
  {
    "skills": "decompose-fractions-into-unit-fractions-using-models",
    "question_text": "How do you write $\\frac{10}{12}$ as a sum of unit fractions? Use the fraction strips to help.",
    "image_tag": "Gr4_7_2_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_7_E2",
    "choices": [
      "$\\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12}$",
      "$\\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10}$",
      "$\\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10} + \\frac{1}{10}$",
      "$\\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12}$"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/4",
        "Look at the fraction strips. The model shows 1 whole divided into 12 equal parts. Each equal part shows the unit fraction $\\frac{1}{12}$."
      ],
      [
        "2/4",
        "Count the colored purple parts. There are 10 purple parts, each representing $\\frac{1}{12}$."
      ],
      [
        "3/4",
        "To write $\\frac{10}{12}$ as a sum of unit fractions, we add the 10 colored parts: $\\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12}$."
      ],
      [
        "4/4",
        "Therefore, $\\frac{10}{12} = \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12} + \\frac{1}{12}$."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "2_1",
    "backend_description": "A visual representation of the number 1 as twelve parts of 1/12. Shows a yellow box containing '1' at the top, and below it a purple strip divided into 12 equal sections, each labeled '1/12'. This demonstrates that 1 whole equals 12/12."
  },
  {
    "skills": "compare-fractions-with-like-denominators-using-models",
    "question_text": "Which fraction is less?",
    "image_tag": "Gr4_7_3_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_7_E3",
    "choices": [
      "1/3",
      "2/3"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "Look at the first model. It shows 1 out of 3 equal parts colored, which represents $\\frac{1}{3}$."
      ],
      [
        "2/4",
        "Look at the second model. It shows 2 out of 3 equal parts colored, which represents $\\frac{2}{3}$."
      ],
      [
        "3/4",
        "Both models have the same size and are divided into 3 equal parts. This means each part in both models is the same size."
      ],
      [
        "4/4",
        "Since the parts are the same size, 1 part is less than 2 parts. Therefore, $\\frac{1}{3}$ is less than $\\frac{2}{3}$."
      ]
    ],
    "solution_image_tag": [
      [
        "1/4",
        "Gr4_7_3_1_step_1",
        "A vertical rectangle divided into three equal horizontal sections. The fraction 1/3 is displayed above. The bottom third is shaded in peach/orange color while the top two sections remain white."
      ],
      [
        "2/4",
        "Gr4_7_3_1_step_2",
        "A vertical rectangle divided into three equal horizontal sections with the fraction 2/3 above. The bottom two-thirds are shaded in light blue while the top third remains white."
      ]
    ],
    "question_number": "3_1",
    "backend_description": "Two rectangles side by side showing fraction comparisons. The left rectangle is labeled '1/3' and is divided into three equal horizontal sections, with the bottom section colored orange. The right rectangle is labeled '2/3' and is also divided into three sections, with the bottom two sections colored light blue."
  },
  {
    "skills": "compare-fractions-with-like-numerators-or-denominators-using-models",
    "question_text": "Which fraction is greater?",
    "image_tag": "Gr4_7_4_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_7_E4",
    "choices": [
      "3/4",
      "1/4"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "Look at the first model. It shows 3 out of 4 equal parts colored, which represents $\\frac{3}{4}$."
      ],
      [
        "2/4",
        "Look at the second model. It shows 1 out of 4 equal parts colored, which represents $\\frac{1}{4}$."
      ],
      [
        "3/4",
        "Both models have the same size and are divided into 4 equal parts. This means each part in both models is the same size."
      ],
      [
        "4/4",
        "Since the parts are the same size, 3 parts are greater than 1 part. Therefore, $\\frac{3}{4}$ is greater than $\\frac{1}{4}$."
      ]
    ],
    "solution_image_tag": [
      [
        "1/4",
        "Gr4_7_4_1_step_1",
        "A circle divided into four equal quarters by two perpendicular lines. The fraction 3/4 appears above. Three quarters (all except the top-right quarter) are shaded in light green."
      ],
      [
        "2/4",
        "Gr4_7_4_1_step_2",
        "A circle divided into four equal quarters with the fraction 1/4 displayed above. Only the top-left quarter is shaded in light purple while the other three quarters remain white."
      ]
    ],
    "question_number": "4_1",
    "backend_description": "Two circles demonstrating fraction comparisons. The left circle is labeled '3/4' and is divided into four equal quarters with three quarters shaded in light green. The right circle is labeled '1/4' and is divided into four quarters with only one quarter (upper left) shaded in light purple."
  },
  {
    "skills": "compare-fractions-using-models",
    "question_text": "Which fraction is greater?",
    "image_tag": "Gr4_8_1_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_8_E1",
    "choices": [
      "3/8",
      "4/8"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/4",
        "Look at the first model. It shows 3 out of 8 equal parts colored, which represents $\\frac{3}{8}$."
      ],
      [
        "2/4",
        "Look at the second model. It shows 4 out of 8 equal parts colored, which represents $\\frac{4}{8}$."
      ],
      [
        "3/4",
        "Both models have the same size and are divided into 8 equal parts. This means each part in both models is the same size."
      ],
      [
        "4/4",
        "Since the parts are the same size, 4 parts are greater than 3 parts. Therefore, $\\frac{4}{8}$ is greater than $\\frac{3}{8}$."
      ]
    ],
    "solution_image_tag": [
      [
        "1/4",
        "Gr4_8_1_1_step_1",
        "A square rotated 45 degrees (diamond orientation) divided into 8 equal triangular sections by lines from the center to each vertex and midpoint. The fraction 3/8 is shown above. Three triangular sections on the left side are shaded in light blue."
      ],
      [
        "2/4",
        "Gr4_8_1_1_step_2",
        "The same diamond-shaped figure divided into 8 triangular sections with the fraction 4/8 above. Four sections (the entire left half) are shaded in light yellow, representing one-half of the whole figure."
      ]
    ],
    "question_number": "1_1",
    "backend_description": "Two diamond shapes rotated 45 degrees showing fraction comparisons. The left diamond is labeled '3/8' and is divided into 8 triangular sections with 3 sections (bottom left area) shaded in light blue. The right diamond is labeled '4/8' and has 4 sections (left half) shaded in yellow."
  },
  {
    "question_text": "Which fraction is less?",
    "skills": "compare-fractions-using-models",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_2",
    "image_tag": "Gr4_8_1_2",
    "tag": "Gr4_8_E1",
    "choices": [
      "6/10",
      "6/8"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "Look at the first model. It shows 6 out of 10 equal parts colored, which represents $\\frac{6}{10}$."
      ],
      [
        "2/4",
        "Look at the second model. It shows 6 out of 8 equal parts colored, which represents $\\frac{6}{8}$."
      ],
      [
        "3/4",
        "Both circles are the same size, but they are cut into different numbers of pieces. The first circle is cut into 10 pieces, so each piece is small. The second circle is cut into 8 pieces, so each piece is bigger."
      ],
      [
        "4/4",
        "Both fractions have 6 colored pieces, but the pieces in the second circle are bigger. So 6 big pieces cover more of the circle than 6 small pieces. Therefore, $\\frac{6}{10}$ is less than $\\frac{6}{8}$."
      ]
    ],
    "solution_image_tag": [],
    "backend_description": "Two circles comparing fractions. The left circle is labeled '6/10' and is divided into 10 equal wedges with 6 wedges shaded in green. The right circle is labeled '6/8' and is divided into 8 equal wedges with 6 wedges shaded in light purple."
  },
  {
    "skills": "compare-fractions-using-as-a-benchmark",
    "question_text": "Compare each fraction to the benchmark.\n\n$\\frac{4}{6}$ _ $\\frac{1}{2}$ and $\\frac{2}{8}$ _ $\\frac{1}{2}$\n\nNow, use this information to compare the two fractions.\n\n$\\frac{4}{6}$ _ $\\frac{2}{8}$\n",
    "question_type": "Multiple fill in the blank",
    "tag": "Gr4_8_E2",
    "orderMatter": true,
    "correct_answers": [
      ">",
      "<",
      ">"
    ],
    "solution": [
      [
        "1/5",
        "First, compare $\\frac{4}{6}$ to the benchmark $\\frac{1}{2}$. Look at the fraction bars to compare the shaded areas."
      ],
      [
        "2/5",
        "The shaded area for $\\frac{4}{6}$ is greater than the shaded area for $\\frac{1}{2}$. So $\\frac{4}{6}$ > $\\frac{1}{2}$."
      ],
      [
        "3/5",
        "Next, compare $\\frac{2}{8}$ to the benchmark $\\frac{1}{2}$. Look at the fraction bars to compare the shaded areas."
      ],
      [
        "4/5",
        "The shaded area for $\\frac{2}{8}$ is less than the shaded area for $\\frac{1}{2}$. So $\\frac{2}{8}$ < $\\frac{1}{2}$."
      ],
      [
        "5/5",
        "Now compare $\\frac{4}{6}$ and $\\frac{2}{8}$. Since $\\frac{4}{6}$ > $\\frac{1}{2}$ and $\\frac{2}{8}$ < $\\frac{1}{2}$, we know that $\\frac{4}{6}$ > $\\frac{2}{8}$."
      ]
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr4_8_2_1_step_1",
        "Two fraction bar models comparing 4/6 and 1/2. The top bar represents 4/6 with 4 green sections shaded out of 6 total sections. The bottom bar represents 1/2 with the left half shaded in blue."
      ],
      [
        "3/5",
        "Gr4_8_2_1_step_3",
        "The simplified equivalent fractions. The top bar shows 2/8 with 2 green sections shaded out of 8 total sections. The bottom bar maintains 1/2 with half shaded in blue, demonstrating the comparison between these fractions."
      ]
    ],
    "question_number": "2_1"
  },
  {
    "skills": "compare-fractions-using-as-a-benchmark-find-the-missing-numerator",
    "question_text": "Find a numerator that makes the statement true.\n\nThere may be more than one correct answer. The fraction you make must be greater than 0 and less than 1. The numerator must be a whole number.\n\n$\\frac{?}{3}$ < $\\frac{5}{10}$\n",
    "question_type": "Fill in the blank",
    "tag": "Gr4_8_E3",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/5",
        "You need to find a numerator that makes $\\frac{?}{3}$ less than $\\frac{5}{10}$. Look at the number line to see what $\\frac{5}{10}$ equals."
      ],
      [
        "2/5",
        "In the number line you can see that $\\frac{5}{10}$ is at the same position as $\\frac{1}{2}$, so $\\frac{5}{10} = \\frac{1}{2}$."
      ],
      [
        "3/5",
        "Now we need to find a fraction with denominator 3 that is less than $\\frac{1}{2}$. Look at the number line with thirds."
      ],
      [
        "4/5",
        "Looking at the number line, $\\frac{1}{3}$ is to the left of $\\frac{1}{2}$, which means $\\frac{1}{3} < \\frac{5}{10}$."
      ],
      [
        "5/5",
        "Therefore, 1 in the numerator makes the statement true: $\\frac{1}{3} < \\frac{5}{10}$."
      ]
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr4_8_3_1_step_1",
        "Two number lines from 0 to 1. The top line shows the basic interval with 1/2 marked. The bottom line is divided into tenths (0/10 through 10/10) with 5/10 marked with a green dot, showing that 5/10 equals 1/2."
      ],
      [
        "3/5",
        "Gr4_8_3_1_step_3",
        "Two number lines from 0 to 1. The top line has 1/2 marked. The bottom line is divided into thirds, with 1/3 marked with a green dot at the first third position."
      ]
    ],
    "question_number": "3_1"
  },
  {
    "skills": "compare-fractions-with-like-denominators",
    "question_text": "Which fraction is greater?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_8_E4",
    "choices": [
      "6/7",
      "5/7"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/5",
        "To compare these fractions, we can use models. Since both fractions have the same denominator (7), we can compare the numerators."
      ],
      [
        "2/5",
        "Look at the first model. It shows 6 out of 7 equal parts colored, which represents $\\frac{6}{7}$."
      ],
      [
        "3/5",
        "Look at the second model. It shows 5 out of 7 equal parts colored, which represents $\\frac{5}{7}$."
      ],
      [
        "4/5",
        "Both models are the same size and divided into 7 equal parts. This means each part in both models is the same size."
      ],
      [
        "5/5",
        "Since the parts are the same size, 6 parts are greater than 5 parts. Therefore, $\\frac{6}{7}$ is greater than $\\frac{5}{7}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_8_4_1_step_2",
        "A hexagon divided into 7 triangular sections radiating from the center. 6 sections are shaded in light green while 1 section remains white, representing the fraction 6/7."
      ],
      [
        "3/5",
        "Gr4_8_4_1_step_3",
        "A hexagon divided into 7 triangular sections. 5 sections are shaded in light purple while 2 sections remain white, representing the fraction 5/7."
      ]
    ],
    "question_number": "4_1"
  },
  {
    "skills": "compare-fractions-with-like-numerators-or-denominators",
    "question_text": "Which fraction is greater?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_9_E1",
    "choices": [
      "2/8",
      "5/8"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/5",
        "To compare these fractions, we can use models. Since both fractions have the same denominator (8), we can compare the numerators."
      ],
      [
        "2/5",
        "Look at the first model. It shows 2 out of 8 equal parts colored, which represents $\\frac{2}{8}$."
      ],
      [
        "3/5",
        "Look at the second model. It shows 5 out of 8 equal parts colored, which represents $\\frac{5}{8}$."
      ],
      [
        "4/5",
        "Both models are the same size and divided into 8 equal parts. This means each part in both models is the same size."
      ],
      [
        "5/5",
        "Since the parts are the same size, 5 parts are greater than 2 parts. Therefore, $\\frac{5}{8}$ is greater than $\\frac{2}{8}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_9_1_1_step_2",
        "A circle divided into 8 equal wedges. 2 wedges are shaded in purple (adjacent to each other in the upper right), representing the fraction 2/8."
      ],
      [
        "3/5",
        "Gr4_9_1_1_step_3",
        "A circle divided into 8 equal wedges. 5 wedges are shaded in light purple (forming a continuous section), representing the fraction 5/8."
      ]
    ],
    "question_number": "1_1"
  },
  {
    "skills": "compare-fractions",
    "question_text": "Which sign makes the statement true?\n\n$\\frac{1}{12}$ _ $\\frac{1}{2}$\n",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_9_E2",
    "choices": [
      ">",
      "<",
      "="
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/4",
        "To compare these fractions, we can use models. Both fractions have the same numerator (1), so we need to compare the denominators."
      ],
      [
        "2/4",
        "Look at the models. The first circle shows $\\frac{1}{12}$, it has 12 equal parts with 1 part colored. The second circle shows $\\frac{1}{2}$, it has 2 equal parts with 1 part colored."
      ],
      [
        "3/4",
        "When fractions have the same numerator, the fraction with the larger denominator is smaller because each part is smaller."
      ],
      [
        "4/4",
        "Since 12 is larger than 2, each part in $\\frac{1}{12}$ is smaller than each part in $\\frac{1}{2}$. Therefore, $\\frac{1}{12} < \\frac{1}{2}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_9_2_1_step_2",
        "Two circles side by side. The left circle shows 1/12 with the circle divided into 12 wedges and only 1 shaded in teal. The right circle shows 1/2 with the top half shaded in pink."
      ]
    ],
    "question_number": "2_1"
  },
  {
    "question_text": "Which fraction is less?",
    "skills": "compare-fractions",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_2",
    "tag": "Gr4_9_E2",
    "choices": [
      "9/12",
      "8/12"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/5",
        "To compare these fractions, we can use models. Since both fractions have the same denominator (12), we can compare the numerators."
      ],
      [
        "2/5",
        "Look at the first model. It shows 9 out of 12 equal parts colored, which represents $\\frac{9}{12}$."
      ],
      [
        "3/5",
        "Look at the second model. It shows 8 out of 12 equal parts colored, which represents $\\frac{8}{12}$."
      ],
      [
        "4/5",
        "Both models are the same size and divided into 12 equal parts. This means each part in both models is the same size."
      ],
      [
        "5/5",
        "Since the parts are the same size, 8 parts are less than 9 parts. Therefore, $\\frac{8}{12}$ is less than $\\frac{9}{12}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr4_9_2_2_step_2",
        "A circle divided into 12 equal wedges. 9 wedges are shaded in light green, representing the fraction 9/12."
      ],
      [
        "3/5",
        "Gr4_9_2_2_step_3",
        "A circle divided into 12 equal wedges. 8 wedges are shaded in light purple, representing the fraction 8/12."
      ]
    ]
  },
  {
    "skills": "compare-fractions-with-like-denominators-in-recipes",
    "question_text": "Does this recipe call for more peppermint candies or caramel candies?",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_9_E3",
    "choices": [
      "peppermint candies",
      "caramel candies"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/4",
        "To find which candy the recipe calls for more of, we need to compare the fractions. Look at the recipe ingredients."
      ],
      [
        "2/4",
        "The recipe calls for $\\frac{7}{8}$ cup of peppermint candies and $\\frac{5}{8}$ cup of caramel candies."
      ],
      [
        "3/4",
        "Since both fractions have the same denominator (8), we can compare the numerators directly."
      ],
      [
        "4/4",
        "Since 7 is greater than 5, we have $\\frac{7}{8} > \\frac{5}{8}$. Therefore, the recipe calls for more peppermint candies."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_1"
  },
  {
    "skills": "order-fractions-with-like-denominators",
    "question_text": "Put these fractions in order from least to greatest.",
    "tag": "Gr4_9_E4",
    "question_type": "Ordering Items",
    "choices": [
      "2/7",
      "6/7",
      "1/7"
    ],
    "correct_answers": [
      "1/7",
      "2/7",
      "6/7"
    ],
    "solution": [
      [
        "1/4",
        "To order fractions from least to greatest, we can use models. Since all fractions have the same denominator (7), we can compare the numerators."
      ],
      [
        "2/4",
        "Look at the models. Each circle is divided into 7 equal parts. The first shows $\\frac{1}{7}$ (1 part colored), the second shows $\\frac{2}{7}$ (2 parts colored), and the third shows $\\frac{6}{7}$ (6 parts colored)."
      ],
      [
        "3/4",
        "When fractions have the same denominator, the fraction with the smaller numerator is smaller. Since 1 < 2 < 6, we have $\\frac{1}{7} < \\frac{2}{7} < \\frac{6}{7}$."
      ],
      [
        "4/4",
        "Therefore, the fractions in order from least to greatest are: $\\frac{1}{7}$, $\\frac{2}{7}$, $\\frac{6}{7}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_9_4_1_step_2",
        "Three circles representing fractions 1/7, 2/7, and 6/7. Each circle is divided into 7 wedges with 1, 2, and 6 wedges shaded in purple respectively, demonstrating fraction progression."
      ]
    ],
    "question_number": "4_1"
  },
  {
    "skills": "order-fractions-with-like-numerators-or-denominators",
    "question_text": "Put these fractions in order from least to greatest.",
    "tag": "Gr4_10_E1",
    "question_type": "Ordering Items",
    "choices": [
      "5/9",
      "1/9",
      "6/9"
    ],
    "correct_answers": [
      "1/9",
      "5/9",
      "6/9"
    ],
    "solution": [
      [
        "1/4",
        "To order fractions from least to greatest, we can use models. Since all fractions have the same denominator (9), we can compare the numerators."
      ],
      [
        "2/4",
        "Look at the models. Each circle is divided into 9 equal parts. The first shows $\\frac{1}{9}$ (1 part colored), the second shows $\\frac{5}{9}$ (5 parts colored), and the third shows $\\frac{6}{9}$ (6 parts colored)."
      ],
      [
        "3/4",
        "When fractions have the same denominator, the fraction with the smaller numerator is smaller. Since 1 < 5 < 6, we have $\\frac{1}{9} < \\frac{5}{9} < \\frac{6}{9}$."
      ],
      [
        "4/4",
        "Therefore, the fractions in order from least to greatest are: $\\frac{1}{9}$, $\\frac{5}{9}$, $\\frac{6}{9}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_10_1_1_step_2",
        "Three circles showing fractions 1/9, 5/9, and 6/9. Each circle is divided into 9 wedges with the appropriate number of wedges shaded in blue."
      ]
    ],
    "question_number": "1_1"
  },
  {
    "skills": "order-fractions",
    "question_text": "Put these fractions in order from greatest to least.",
    "tag": "Gr4_10_E2",
    "question_type": "Ordering Items",
    "choices": [
      "2/9",
      "1/9",
      "3/9"
    ],
    "correct_answers": [
      "3/9",
      "2/9",
      "1/9"
    ],
    "solution": [
      [
        "1/4",
        "To order fractions from greatest to least, we can use models. Since all fractions have the same denominator (9), we can compare the numerators."
      ],
      [
        "2/4",
        "Look at the models. Each circle is divided into 9 equal parts. The first shows $\\frac{3}{9}$ (3 parts colored), the second shows $\\frac{2}{9}$ (2 parts colored), and the third shows $\\frac{1}{9}$ (1 part colored)."
      ],
      [
        "3/4",
        "When fractions have the same denominator, the fraction with the larger numerator is larger. Since 3 > 2 > 1, we have $\\frac{3}{9} > \\frac{2}{9} > \\frac{1}{9}$."
      ],
      [
        "4/4",
        "Therefore, the fractions in order from greatest to least are: $\\frac{3}{9}$, $\\frac{2}{9}$, $\\frac{1}{9}$."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_10_2_1_step_2",
        "Three circles representing fractions 3/9, 2/9, and 1/9. Each circle is divided into 9 wedges with 3, 2, and 1 wedge shaded in orange respectively, showing decreasing fractions."
      ]
    ],
    "question_number": "2_1"
  },
  {
    "skills": "understanding-decimals-expressed-in-words-up-to-tenths",
    "question_text": "Write nine and one tenth as a decimal number.\n",
    "question_type": "Fill in the blank",
    "tag": "Gr4_10_E3",
    "correct_answers": [
      "9.1"
    ],
    "solution": [
      [
        "1/4",
        "To write a decimal number, we need to understand place values. Use a place value chart to help organize the number."
      ],
      [
        "2/4",
        "Break down the words: 'nine' is the whole number part (9 ones), and 'one tenth' means 1 in the tenths place."
      ],
      [
        "3/4",
        "In the place value chart, write 9 in the ones place and 1 in the tenths place. Put a decimal point between the ones and tenths places."
      ],
      [
        "4/4",
        "Therefore, nine and one tenth written as a decimal number is 9.1."
      ]
    ],
    "solution_image_tag": [
      [
        "3/4",
        "Gr4_10_3_1_step_3",
        "A place value chart with two columns labeled 'ones' and 'tenths' separated by a vertical line representing the decimal point. The number 9 is written in the ones column and the number 1 is written in the tenths column, showing 9.1."
      ]
    ],
    "question_number": "3_1"
  },
  {
    "skills": "place-values-in-decimal-numbers-up-to-tenths",
    "question_text": "In 12.3, which digit is in the tenths place?\n",
    "question_type": "Fill in the blank",
    "tag": "Gr4_10_E4",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/3",
        "To find which digit is in the tenths place, we need to understand decimal place values. Look at the place value chart."
      ],
      [
        "2/3",
        "In the decimal number 12.3, the digit 1 is in the tens place, the digit 2 is in the ones place, and the digit 3 is in the tenths place. The decimal point separates the whole number part from the decimal part."
      ],
      [
        "3/3",
        "Therefore, the digit 3 is in the tenths place."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr4_10_4_1_step_1",
        "A place value chart with three columns: 'tens', 'ones', and 'tenths'. The numbers 1, 2, and 3 are placed in their respective columns, representing 12.3."
      ]
    ],
    "question_number": "4_1"
  },
  {
    "question_text": "In 5169.8, in which place is the 8?",
    "skills": "place-values-in-decimal-numbers-up-to-tenths",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_2",
    "tag": "Gr4_10_E4",
    "choices": [
      "tenths",
      "thousands",
      "hundreds",
      "tens"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "To find which place the digit 8 is in, we need to look at the decimal number 5169.8 and use a place value chart."
      ],
      [
        "2/3",
        "In the place value chart, we can see that 5 is in the thousands place, 1 is in the hundreds place, 6 is in the tens place, 9 is in the ones place, and 8 is in the tenths place. The decimal point separates the whole number part from the decimal part."
      ],
      [
        "3/3",
        "Therefore, the digit 8 is in the tenths place."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr4_10_4_2_step_1",
        "A place value chart with four columns: 'thousands', 'hundreds', 'tens', 'ones' and 'tenths'. The numbers 5, 1, 6, 9, and 8 are placed in their respective columns, representing 5169.8."
      ]
    ]
  },
  {
    "skills": "decimal-number-lines-up-to-tenths",
    "question_text": "Find the value of x. Write your answer as a decimal number.\n",
    "image_tag": "Gr4_11_1_1",
    "question_type": "Fill in the blank",
    "tag": "Gr4_11_E1",
    "correct_answers": [
      "0.2"
    ],
    "solution": [
      [
        "1/4",
        "To find the value of x, look at the number line that goes from 0 to 1."
      ],
      [
        "2/4",
        "Count the equal intervals between 0 and 1. There are 10 equal intervals, so each interval represents 0.1 (one tenth)."
      ],
      [
        "3/4",
        "Find where x is located. Count the intervals from 0 to x. The point x is 2 intervals away from 0."
      ],
      [
        "4/4",
        "Since each interval is 0.1 and x is 2 intervals from 0, then x = 0.2."
      ]
    ],
    "solution_image_tag": [
      [
        "3/4",
        "Gr4_11_1_1_step_3",
        "A number line from 0 to 1 with tick marks at every 0.1 interval. The point x = 0.2 is labeled on the line."
      ]
    ],
    "question_number": "1_1",
    "backend_description": "A horizontal number line with arrows on both ends, marked from 0 to 1 with tick marks in between. There is a variable 'x' marked at approximately the 0.2 position on the line."
  },
  {
    "skills": "compare-decimals-on-number-lines-up-to-tenths",
    "question_text": "Based on the number line, determine which number is closer to 0.0?",
    "image_tag": "Gr4_11_2_1",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr4_11_E2",
    "choices": [
      "0.9",
      "0.3"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/4",
        "To find which number is closer to 0.0, look at the number line and find where 0.9 and 0.3 are located."
      ],
      [
        "2/4",
        "Find 0.9 on the number line. It is located 9 spaces away from 0.0."
      ],
      [
        "3/4",
        "Find 0.3 on the number line. It is located 3 spaces away from 0.0."
      ],
      [
        "4/4",
        "Compare the distances: 0.3 is 3 spaces from 0.0, while 0.9 is 9 spaces from 0.0. Since 3 is less than 9, the number 0.3 is closer to 0.0."
      ]
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr4_11_2_1_step_2",
        "A number line from 0.0 to 1.0 with marks at every 0.1 interval. A green dot marks the position 0.3."
      ],
      [
        "3/4",
        "Gr4_11_2_1_step_3",
        "A number line from 0.0 to 1.0 with marks at every 0.1 interval. Two points are highlighted: 0.3 and 0.9, showing their relative positions for comparison."
      ]
    ],
    "question_number": "2_1",
    "backend_description": "A horizontal number line with arrows on both ends, marked from 0.0 to 1.0 with increments of 0.1 (0.0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0)."
  }
]
