{
  "quizzes": [
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Newton Furniture needs to ship 400 couches across the country. If they can fit 6 couches in each truck, how many couches will be in the partially full truck?\n\n\n_ couches",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "4"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of couches by the number each truck holds. Divide: 400 ÷ 6 = 66 with R 4."
        ],
        [
          "2/2",
          "The remainder is 4.\nThis means there will be 4 couches in the partially full truck."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_1_step_1",
          "Long division showing 400 ÷ 6 = 66 R4. The quotient 66 is written above with 'R4' indicating the remainder. The calculation shows the division process with a remainder of 4, meaning 66 trucks can be filled completely with 4 couches remaining."
        ]
      ],
      "question_number": "4_1"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Mario store needs to ship 649 power-up replicas across the country. If they can fit 7 power-up replicas in each pipe container, how many power-up replicas will be in the partially full pipe container?\n\n\n_ power-up replicas",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "5"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of power-up replicas by the number each pipe container holds. Divide: 649 ÷ 7 = 92 with R 5."
        ],
        [
          "2/2",
          "The remainder is 5.\nThis means there will be 5 power-up replicas in the partially full pipe container."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_2_step_1",
          "Long division showing 649 ÷ 7 = 92 R5. The quotient 92 is written above with 'R5' indicating the remainder. The calculation shows the division process with a remainder of 5, meaning 92 pipe containers can be filled completely with 5 power-up replicas remaining."
        ]
      ],
      "question_number": "4_2"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Dragon Ball store needs to ship 314 power scouters across the country. If they can fit 6 power scouters in each collector's shelf, how many power scouters will be in the partially full collector's shelf?\n\n\n_ power scouters",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of power scouters by the number each collector's shelf holds. Divide: 314 ÷ 6 = 52 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 power scouters in the partially full collector's shelf."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_3_step_1",
          "Long division showing 314 ÷ 6 = 52 R2. The quotient 52 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 52 collector's shelves can be filled completely with 2 power scouters remaining."
        ]
      ],
      "question_number": "4_3"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Star Wars merchandise center needs to ship 298 action figures across the country. If they can fit 8 action figures in each collector's box, how many action figures will be in the partially full collector's box?\n\n\n_ action figures",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of action figures by the number each collector's box holds. Divide: 298 ÷ 8 = 37 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 action figures in the partially full collector's box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_4_step_1",
          "Long division showing 298 ÷ 8 = 37 R2. The quotient 37 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 37 collector's boxes can be filled completely with 2 action figures remaining."
        ]
      ],
      "question_number": "4_4"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Wednesday Addams boutique needs to ship 387 gothic accessories across the country. If they can fit 8 gothic accessories in each jewelry box, how many gothic accessories will be in the partially full jewelry box?\n\n\n_ gothic accessories",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of gothic accessories by the number each jewelry box holds. Divide: 387 ÷ 8 = 48 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 gothic accessories in the partially full jewelry box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_5_step_1",
          "Long division showing 387 ÷ 8 = 48 R3. The quotient 48 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 48 jewelry boxes can be filled completely with 3 gothic accessories remaining."
        ]
      ],
      "question_number": "4_5"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Barbie Dream House store needs to ship 478 dolls across the country. If they can fit 5 dolls in each display cabinet, how many dolls will be in the partially full display cabinet?\n\n\n_ dolls",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of dolls by the number each display cabinet holds. Divide: 478 ÷ 5 = 95 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 dolls in the partially full display cabinet."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_6_step_1",
          "Long division showing 478 ÷ 5 = 95 R3. The quotient 95 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 95 display cabinets can be filled completely with 3 dolls remaining."
        ]
      ],
      "question_number": "4_6"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Pikachu store needs to ship 185 Pokeballs across the country. If they can fit 4 Pokeballs in each trainer bag, how many Pokeballs will be in the partially full trainer bag?\n\n\n_ Pokeballs",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Pokeballs by the number each trainer bag holds. Divide: 185 ÷ 4 = 46 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 Pokeballs in the partially full trainer bag."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_7_step_1",
          "Long division showing 185 ÷ 4 = 46 R1. The quotient 46 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 46 trainer bags can be filled completely with 1 Pokeballs remaining."
        ]
      ],
      "question_number": "4_7"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Demon Slayer boutique needs to ship 284 replica swords across the country. If they can fit 3 replica swords in each weapon rack, how many replica swords will be in the partially full weapon rack?\n\n\n_ replica swords",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of replica swords by the number each weapon rack holds. Divide: 284 ÷ 3 = 94 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 replica swords in the partially full weapon rack."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_8_step_1",
          "Long division showing 284 ÷ 3 = 94 R2. The quotient 94 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 94 weapon racks can be filled completely with 2 replica swords remaining."
        ]
      ],
      "question_number": "4_8"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Roblox gift center needs to ship 307 gift cards across the country. If they can fit 6 gift cards in each display holder, how many gift cards will be in the partially full display holder?\n\n\n_ gift cards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of gift cards by the number each display holder holds. Divide: 307 ÷ 6 = 51 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 gift cards in the partially full display holder."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_9_step_1",
          "Long division showing 307 ÷ 6 = 51 R1. The quotient 51 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 51 display holders can be filled completely with 1 gift cards remaining."
        ]
      ],
      "question_number": "4_9"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Frozen merchandise store needs to ship 277 Elsa dolls across the country. If they can fit 8 Elsa dolls in each ice palace display, how many Elsa dolls will be in the partially full ice palace display?\n\n\n_ Elsa dolls",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "5"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Elsa dolls by the number each ice palace display holds. Divide: 277 ÷ 8 = 34 with R 5."
        ],
        [
          "2/2",
          "The remainder is 5.\nThis means there will be 5 Elsa dolls in the partially full ice palace display."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_10_step_1",
          "Long division showing 277 ÷ 8 = 34 R5. The quotient 34 is written above with 'R5' indicating the remainder. The calculation shows the division process with a remainder of 5, meaning 34 ice palace displays can be filled completely with 5 Elsa dolls remaining."
        ]
      ],
      "question_number": "4_10"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Genshin Impact store needs to ship 261 character figures across the country. If they can fit 8 character figures in each display tower, how many character figures will be in the partially full display tower?\n\n\n_ character figures",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "5"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of character figures by the number each display tower holds. Divide: 261 ÷ 8 = 32 with R 5."
        ],
        [
          "2/2",
          "The remainder is 5.\nThis means there will be 5 character figures in the partially full display tower."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_11_step_1",
          "Long division showing 261 ÷ 8 = 32 R5. The quotient 32 is written above with 'R5' indicating the remainder. The calculation shows the division process with a remainder of 5, meaning 32 display towers can be filled completely with 5 character figures remaining."
        ]
      ],
      "question_number": "4_11"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Disney Store needs to ship 478 plush toys across the country. If they can fit 4 plush toys in each display shelf, how many plush toys will be in the partially full display shelf?\n\n\n_ plush toys",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of plush toys by the number each display shelf holds. Divide: 478 ÷ 4 = 119 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 plush toys in the partially full display shelf."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_12_step_1",
          "Long division showing 478 ÷ 4 = 119 R2. The quotient 119 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 119 display shelves can be filled completely with 2 plush toys remaining."
        ]
      ],
      "question_number": "4_12"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Apex Legends depot needs to ship 331 legend badges across the country. If they can fit 8 legend badges in each banner display, how many legend badges will be in the partially full banner display?\n\n\n_ legend badges",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of legend badges by the number each banner display holds. Divide: 331 ÷ 8 = 41 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 legend badges in the partially full banner display."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_13_step_1",
          "Long division showing 331 ÷ 8 = 41 R3. The quotient 41 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 41 banner displays can be filled completely with 3 legend badges remaining."
        ]
      ],
      "question_number": "4_13"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Attack on Titan store needs to ship 459 Scout Regiment badges across the country. If they can fit 6 Scout Regiment badges in each display board, how many Scout Regiment badges will be in the partially full display board?\n\n\n_ Scout Regiment badges",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Scout Regiment badges by the number each display board holds. Divide: 459 ÷ 6 = 76 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 Scout Regiment badges in the partially full display board."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_14_step_1",
          "Long division showing 459 ÷ 6 = 76 R3. The quotient 76 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 76 display boards can be filled completely with 3 Scout Regiment badges remaining."
        ]
      ],
      "question_number": "4_14"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Call of Duty warehouse needs to ship 340 weapon replicas across the country. If they can fit 8 weapon replicas in each armory case, how many weapon replicas will be in the partially full armory case?\n\n\n_ weapon replicas",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "4"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of weapon replicas by the number each armory case holds. Divide: 340 ÷ 8 = 42 with R 4."
        ],
        [
          "2/2",
          "The remainder is 4.\nThis means there will be 4 weapon replicas in the partially full armory case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_15_step_1",
          "Long division showing 340 ÷ 8 = 42 R4. The quotient 42 is written above with 'R4' indicating the remainder. The calculation shows the division process with a remainder of 4, meaning 42 armory cases can be filled completely with 4 weapon replicas remaining."
        ]
      ],
      "question_number": "4_15"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Naruto store needs to ship 532 headbands across the country. If they can fit 8 headbands in each display wall, how many headbands will be in the partially full display wall?\n\n\n_ headbands",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "4"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of headbands by the number each display wall holds. Divide: 532 ÷ 8 = 66 with R 4."
        ],
        [
          "2/2",
          "The remainder is 4.\nThis means there will be 4 headbands in the partially full display wall."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_16_step_1",
          "Long division showing 532 ÷ 8 = 66 R4. The quotient 66 is written above with 'R4' indicating the remainder. The calculation shows the division process with a remainder of 4, meaning 66 display walls can be filled completely with 4 headbands remaining."
        ]
      ],
      "question_number": "4_16"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Squishmallow warehouse needs to ship 772 soft plushies across the country. If they can fit 7 soft plushies in each cuddle bin, how many soft plushies will be in the partially full cuddle bin?\n\n\n_ soft plushies",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of soft plushies by the number each cuddle bin holds. Divide: 772 ÷ 7 = 110 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 soft plushies in the partially full cuddle bin."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_17_step_1",
          "Long division showing 772 ÷ 7 = 110 R2. The quotient 110 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 110 cuddle bins can be filled completely with 2 soft plushies remaining."
        ]
      ],
      "question_number": "4_17"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Hot Wheels factory needs to ship 379 die-cast cars across the country. If they can fit 4 die-cast cars in each collector case, how many die-cast cars will be in the partially full collector case?\n\n\n_ die-cast cars",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of die-cast cars by the number each collector case holds. Divide: 379 ÷ 4 = 94 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 die-cast cars in the partially full collector case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_18_step_1",
          "Long division showing 379 ÷ 4 = 94 R3. The quotient 94 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 94 collector cases can be filled completely with 3 die-cast cars remaining."
        ]
      ],
      "question_number": "4_18"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Encanto gift shop needs to ship 590 magical door replicas across the country. If they can fit 4 magical door replicas in each display case, how many magical door replicas will be in the partially full display case?\n\n\n_ magical door replicas",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of magical door replicas by the number each display case holds. Divide: 590 ÷ 4 = 147 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 magical door replicas in the partially full display case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_19_step_1",
          "Long division showing 590 ÷ 4 = 147 R2. The quotient 147 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 147 display cases can be filled completely with 2 magical door replicas remaining."
        ]
      ],
      "question_number": "4_19"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Jujutsu Kaisen shop needs to ship 361 cursed objects replicas across the country. If they can fit 3 cursed objects replicas in each storage vault, how many cursed objects replicas will be in the partially full storage vault?\n\n\n_ cursed objects replicas",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of cursed objects replicas by the number each storage vault holds. Divide: 361 ÷ 3 = 120 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 cursed objects replicas in the partially full storage vault."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_20_step_1",
          "Long division showing 361 ÷ 3 = 120 R1. The quotient 120 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 120 storage vaults can be filled completely with 1 cursed objects replicas remaining."
        ]
      ],
      "question_number": "4_20"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Minecraft merchandise center needs to ship 238 creeper plushies across the country. If they can fit 3 creeper plushies in each storage chest, how many creeper plushies will be in the partially full storage chest?\n\n\n_ creeper plushies",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of creeper plushies by the number each storage chest holds. Divide: 238 ÷ 3 = 79 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 creeper plushies in the partially full storage chest."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_21_step_1",
          "Long division showing 238 ÷ 3 = 79 R1. The quotient 79 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 79 storage chests can be filled completely with 1 creeper plushies remaining."
        ]
      ],
      "question_number": "4_21"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Marvel Comics Store needs to ship 369 comic books across the country. If they can fit 6 comic books in each display box, how many comic books will be in the partially full display box?\n\n\n_ comic books",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of comic books by the number each display box holds. Divide: 369 ÷ 6 = 61 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 comic books in the partially full display box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_22_step_1",
          "Long division showing 369 ÷ 6 = 61 R3. The quotient 61 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 61 display boxes can be filled completely with 3 comic books remaining."
        ]
      ],
      "question_number": "4_22"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "NBA 2K shop needs to ship 255 player cards across the country. If they can fit 8 player cards in each team binder, how many player cards will be in the partially full team binder?\n\n\n_ player cards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "7"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of player cards by the number each team binder holds. Divide: 255 ÷ 8 = 31 with R 7."
        ],
        [
          "2/2",
          "The remainder is 7.\nThis means there will be 7 player cards in the partially full team binder."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_23_step_1",
          "Long division showing 255 ÷ 8 = 31 R7. The quotient 31 is written above with 'R7' indicating the remainder. The calculation shows the division process with a remainder of 7, meaning 31 team binders can be filled completely with 7 player cards remaining."
        ]
      ],
      "question_number": "4_23"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Avatar merchandise center needs to ship 128 element badges across the country. If they can fit 3 element badges in each collector's frame, how many element badges will be in the partially full collector's frame?\n\n\n_ element badges",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of element badges by the number each collector's frame holds. Divide: 128 ÷ 3 = 42 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 element badges in the partially full collector's frame."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_24_step_1",
          "Long division showing 128 ÷ 3 = 42 R2. The quotient 42 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 42 collector's frames can be filled completely with 2 element badges remaining."
        ]
      ],
      "question_number": "4_24"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Spy x Family store needs to ship 381 Anya plushies across the country. If they can fit 6 Anya plushies in each toy bin, how many Anya plushies will be in the partially full toy bin?\n\n\n_ Anya plushies",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Anya plushies by the number each toy bin holds. Divide: 381 ÷ 6 = 63 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 Anya plushies in the partially full toy bin."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_25_step_1",
          "Long division showing 381 ÷ 6 = 63 R3. The quotient 63 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 63 toy bins can be filled completely with 3 Anya plushies remaining."
        ]
      ],
      "question_number": "4_25"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Studio Ghibli store needs to ship 643 art prints across the country. If they can fit 7 art prints in each portfolio, how many art prints will be in the partially full portfolio?\n\n\n_ art prints",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "6"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of art prints by the number each portfolio holds. Divide: 643 ÷ 7 = 91 with R 6."
        ],
        [
          "2/2",
          "The remainder is 6.\nThis means there will be 6 art prints in the partially full portfolio."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_26_step_1",
          "Long division showing 643 ÷ 7 = 91 R6. The quotient 91 is written above with 'R6' indicating the remainder. The calculation shows the division process with a remainder of 6, meaning 91 portfolios can be filled completely with 6 art prints remaining."
        ]
      ],
      "question_number": "4_26"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Cocomelon store needs to ship 508 musical toys across the country. If they can fit 6 musical toys in each toy chest, how many musical toys will be in the partially full toy chest?\n\n\n_ musical toys",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "4"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of musical toys by the number each toy chest holds. Divide: 508 ÷ 6 = 84 with R 4."
        ],
        [
          "2/2",
          "The remainder is 4.\nThis means there will be 4 musical toys in the partially full toy chest."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_27_step_1",
          "Long division showing 508 ÷ 6 = 84 R4. The quotient 84 is written above with 'R4' indicating the remainder. The calculation shows the division process with a remainder of 4, meaning 84 toy chests can be filled completely with 4 musical toys remaining."
        ]
      ],
      "question_number": "4_27"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "One Piece warehouse needs to ship 343 Straw Hat replicas across the country. If they can fit 9 Straw Hat replicas in each shipping container, how many Straw Hat replicas will be in the partially full shipping container?\n\n\n_ Straw Hat replicas",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Straw Hat replicas by the number each shipping container holds. Divide: 343 ÷ 9 = 38 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 Straw Hat replicas in the partially full shipping container."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_28_step_1",
          "Long division showing 343 ÷ 9 = 38 R1. The quotient 38 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 38 shipping containers can be filled completely with 1 Straw Hat replicas remaining."
        ]
      ],
      "question_number": "4_28"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Zelda treasure shop needs to ship 143 rupee gems across the country. If they can fit 4 rupee gems in each treasure chest, how many rupee gems will be in the partially full treasure chest?\n\n\n_ rupee gems",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of rupee gems by the number each treasure chest holds. Divide: 143 ÷ 4 = 35 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 rupee gems in the partially full treasure chest."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_29_step_1",
          "Long division showing 143 ÷ 4 = 35 R3. The quotient 35 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 35 treasure chests can be filled completely with 3 rupee gems remaining."
        ]
      ],
      "question_number": "4_29"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "FIFA store needs to ship 915 team jerseys across the country. If they can fit 7 team jerseys in each locker, how many team jerseys will be in the partially full locker?\n\n\n_ team jerseys",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "5"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of team jerseys by the number each locker holds. Divide: 915 ÷ 7 = 130 with R 5."
        ],
        [
          "2/2",
          "The remainder is 5.\nThis means there will be 5 team jerseys in the partially full locker."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_30_step_1",
          "Long division showing 915 ÷ 7 = 130 R5. The quotient 130 is written above with 'R5' indicating the remainder. The calculation shows the division process with a remainder of 5, meaning 130 lockers can be filled completely with 5 team jerseys remaining."
        ]
      ],
      "question_number": "4_30"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "BTS merchandise store needs to ship 393 photocards across the country. If they can fit 5 photocards in each album, how many photocards will be in the partially full album?\n\n\n_ photocards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of photocards by the number each album holds. Divide: 393 ÷ 5 = 78 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 photocards in the partially full album."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_31_step_1",
          "Long division showing 393 ÷ 5 = 78 R3. The quotient 78 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 78 albums can be filled completely with 3 photocards remaining."
        ]
      ],
      "question_number": "4_31"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Nintendo warehouse needs to ship 367 Switch games across the country. If they can fit 7 Switch games in each shipping box, how many Switch games will be in the partially full shipping box?\n\n\n_ Switch games",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Switch games by the number each shipping box holds. Divide: 367 ÷ 7 = 52 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 Switch games in the partially full shipping box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_32_step_1",
          "Long division showing 367 ÷ 7 = 52 R3. The quotient 52 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 52 shipping boxes can be filled completely with 3 Switch games remaining."
        ]
      ],
      "question_number": "4_32"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Kirby shop needs to ship 219 ability stars across the country. If they can fit 4 ability stars in each dream box, how many ability stars will be in the partially full dream box?\n\n\n_ ability stars",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of ability stars by the number each dream box holds. Divide: 219 ÷ 4 = 54 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 ability stars in the partially full dream box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_33_step_1",
          "Long division showing 219 ÷ 4 = 54 R3. The quotient 54 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 54 dream boxes can be filled completely with 3 ability stars remaining."
        ]
      ],
      "question_number": "4_33"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Valorant store needs to ship 385 agent cards across the country. If they can fit 9 agent cards in each tactical case, how many agent cards will be in the partially full tactical case?\n\n\n_ agent cards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "7"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of agent cards by the number each tactical case holds. Divide: 385 ÷ 9 = 42 with R 7."
        ],
        [
          "2/2",
          "The remainder is 7.\nThis means there will be 7 agent cards in the partially full tactical case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_34_step_1",
          "Long division showing 385 ÷ 9 = 42 R7. The quotient 42 is written above with 'R7' indicating the remainder. The calculation shows the division process with a remainder of 7, meaning 42 tactical cases can be filled completely with 7 agent cards remaining."
        ]
      ],
      "question_number": "4_34"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Taylor Swift concert venue needs to ship 528 tour posters across the country. If they can fit 7 tour posters in each merchandise stand, how many tour posters will be in the partially full merchandise stand?\n\n\n_ tour posters",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of tour posters by the number each merchandise stand holds. Divide: 528 ÷ 7 = 75 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 tour posters in the partially full merchandise stand."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_35_step_1",
          "Long division showing 528 ÷ 7 = 75 R3. The quotient 75 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 75 merchandise stands can be filled completely with 3 tour posters remaining."
        ]
      ],
      "question_number": "4_35"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Among Us shop needs to ship 176 crewmate figures across the country. If they can fit 3 crewmate figures in each game box, how many crewmate figures will be in the partially full game box?\n\n\n_ crewmate figures",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of crewmate figures by the number each game box holds. Divide: 176 ÷ 3 = 58 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 crewmate figures in the partially full game box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_36_step_1",
          "Long division showing 176 ÷ 3 = 58 R2. The quotient 58 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 58 game boxes can be filled completely with 2 crewmate figures remaining."
        ]
      ],
      "question_number": "4_36"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Chainsaw Man shop needs to ship 491 character keychains across the country. If they can fit 4 character keychains in each display spinner, how many character keychains will be in the partially full display spinner?\n\n\n_ character keychains",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of character keychains by the number each display spinner holds. Divide: 491 ÷ 4 = 122 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 character keychains in the partially full display spinner."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_37_step_1",
          "Long division showing 491 ÷ 4 = 122 R3. The quotient 122 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 122 display spinners can be filled completely with 3 character keychains remaining."
        ]
      ],
      "question_number": "4_37"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "TikTok creator store needs to ship 419 ring lights across the country. If they can fit 4 ring lights in each equipment case, how many ring lights will be in the partially full equipment case?\n\n\n_ ring lights",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of ring lights by the number each equipment case holds. Divide: 419 ÷ 4 = 104 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 ring lights in the partially full equipment case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_38_step_1",
          "Long division showing 419 ÷ 4 = 104 R3. The quotient 104 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 104 equipment cases can be filled completely with 3 ring lights remaining."
        ]
      ],
      "question_number": "4_38"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Funko Pop warehouse needs to ship 838 collectible figures across the country. If they can fit 7 collectible figures in each shipping crate, how many collectible figures will be in the partially full shipping crate?\n\n\n_ collectible figures",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "5"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of collectible figures by the number each shipping crate holds. Divide: 838 ÷ 7 = 119 with R 5."
        ],
        [
          "2/2",
          "The remainder is 5.\nThis means there will be 5 collectible figures in the partially full shipping crate."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_39_step_1",
          "Long division showing 838 ÷ 7 = 119 R5. The quotient 119 is written above with 'R5' indicating the remainder. The calculation shows the division process with a remainder of 5, meaning 119 shipping crates can be filled completely with 5 collectible figures remaining."
        ]
      ],
      "question_number": "4_39"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Sonic merchandise center needs to ship 621 golden rings across the country. If they can fit 5 golden rings in each loop display, how many golden rings will be in the partially full loop display?\n\n\n_ golden rings",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of golden rings by the number each loop display holds. Divide: 621 ÷ 5 = 124 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 golden rings in the partially full loop display."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_40_step_1",
          "Long division showing 621 ÷ 5 = 124 R1. The quotient 124 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 124 loop displays can be filled completely with 1 golden rings remaining."
        ]
      ],
      "question_number": "4_40"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Pokemon Center needs to ship 494 trading cards across the country. If they can fit 8 trading cards in each binder, how many trading cards will be in the partially full binder?\n\n\n_ trading cards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "6"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of trading cards by the number each binder holds. Divide: 494 ÷ 8 = 61 with R 6."
        ],
        [
          "2/2",
          "The remainder is 6.\nThis means there will be 6 trading cards in the partially full binder."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_41_step_1",
          "Long division showing 494 ÷ 8 = 61 R6. The quotient 61 is written above with 'R6' indicating the remainder. The calculation shows the division process with a remainder of 6, meaning 61 binders can be filled completely with 6 trading cards remaining."
        ]
      ],
      "question_number": "4_41"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Netflix gift shop needs to ship 776 Stranger Things keychains across the country. If they can fit 7 Stranger Things keychains in each display rack, how many Stranger Things keychains will be in the partially full display rack?\n\n\n_ Stranger Things keychains",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "6"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of Stranger Things keychains by the number each display rack holds. Divide: 776 ÷ 7 = 110 with R 6."
        ],
        [
          "2/2",
          "The remainder is 6.\nThis means there will be 6 Stranger Things keychains in the partially full display rack."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_42_step_1",
          "Long division showing 776 ÷ 7 = 110 R6. The quotient 110 is written above with 'R6' indicating the remainder. The calculation shows the division process with a remainder of 6, meaning 110 display racks can be filled completely with 6 Stranger Things keychains remaining."
        ]
      ],
      "question_number": "4_42"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Paw Patrol center needs to ship 490 rescue vehicles across the country. If they can fit 4 rescue vehicles in each garage shelf, how many rescue vehicles will be in the partially full garage shelf?\n\n\n_ rescue vehicles",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of rescue vehicles by the number each garage shelf holds. Divide: 490 ÷ 4 = 122 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 rescue vehicles in the partially full garage shelf."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_43_step_1",
          "Long division showing 490 ÷ 4 = 122 R2. The quotient 122 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 122 garage shelves can be filled completely with 2 rescue vehicles remaining."
        ]
      ],
      "question_number": "4_43"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "My Hero Academia shop needs to ship 731 hero costumes across the country. If they can fit 7 hero costumes in each closet section, how many hero costumes will be in the partially full closet section?\n\n\n_ hero costumes",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of hero costumes by the number each closet section holds. Divide: 731 ÷ 7 = 104 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 hero costumes in the partially full closet section."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_44_step_1",
          "Long division showing 731 ÷ 7 = 104 R3. The quotient 104 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 104 closet sections can be filled completely with 3 hero costumes remaining."
        ]
      ],
      "question_number": "4_44"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Bluey toy store needs to ship 819 family figurine sets across the country. If they can fit 8 family figurine sets in each play set box, how many family figurine sets will be in the partially full play set box?\n\n\n_ family figurine sets",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of family figurine sets by the number each play set box holds. Divide: 819 ÷ 8 = 102 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 family figurine sets in the partially full play set box."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_45_step_1",
          "Long division showing 819 ÷ 8 = 102 R3. The quotient 102 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 102 play set boxes can be filled completely with 3 family figurine sets remaining."
        ]
      ],
      "question_number": "4_45"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Fortnite store needs to ship 523 V-Bucks cards across the country. If they can fit 6 V-Bucks cards in each register display, how many V-Bucks cards will be in the partially full register display?\n\n\n_ V-Bucks cards",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "1"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of V-Bucks cards by the number each register display holds. Divide: 523 ÷ 6 = 87 with R 1."
        ],
        [
          "2/2",
          "The remainder is 1.\nThis means there will be 1 V-Bucks cards in the partially full register display."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_46_step_1",
          "Long division showing 523 ÷ 6 = 87 R1. The quotient 87 is written above with 'R1' indicating the remainder. The calculation shows the division process with a remainder of 1, meaning 87 register displays can be filled completely with 1 V-Bucks cards remaining."
        ]
      ],
      "question_number": "4_46"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Anime convention needs to ship 565 manga volumes across the country. If they can fit 9 manga volumes in each vendor booth, how many manga volumes will be in the partially full vendor booth?\n\n\n_ manga volumes",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "7"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of manga volumes by the number each vendor booth holds. Divide: 565 ÷ 9 = 62 with R 7."
        ],
        [
          "2/2",
          "The remainder is 7.\nThis means there will be 7 manga volumes in the partially full vendor booth."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_47_step_1",
          "Long division showing 565 ÷ 9 = 62 R7. The quotient 62 is written above with 'R7' indicating the remainder. The calculation shows the division process with a remainder of 7, meaning 62 vendor booths can be filled completely with 7 manga volumes remaining."
        ]
      ],
      "question_number": "4_47"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "LEGO distribution center needs to ship 237 LEGO sets across the country. If they can fit 7 LEGO sets in each container, how many LEGO sets will be in the partially full container?\n\n\n_ LEGO sets",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "6"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of LEGO sets by the number each container holds. Divide: 237 ÷ 7 = 33 with R 6."
        ],
        [
          "2/2",
          "The remainder is 6.\nThis means there will be 6 LEGO sets in the partially full container."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_48_step_1",
          "Long division showing 237 ÷ 7 = 33 R6. The quotient 33 is written above with 'R6' indicating the remainder. The calculation shows the division process with a remainder of 6, meaning 33 containers can be filled completely with 6 LEGO sets remaining."
        ]
      ],
      "question_number": "4_48"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Peppa Pig shop needs to ship 748 storybooks across the country. If they can fit 7 storybooks in each bookshelf, how many storybooks will be in the partially full bookshelf?\n\n\n_ storybooks",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "6"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of storybooks by the number each bookshelf holds. Divide: 748 ÷ 7 = 106 with R 6."
        ],
        [
          "2/2",
          "The remainder is 6.\nThis means there will be 6 storybooks in the partially full bookshelf."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_49_step_1",
          "Long division showing 748 ÷ 7 = 106 R6. The quotient 106 is written above with 'R6' indicating the remainder. The calculation shows the division process with a remainder of 6, meaning 106 bookshelves can be filled completely with 6 storybooks remaining."
        ]
      ],
      "question_number": "4_49"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "Harry Potter shop needs to ship 326 wands across the country. If they can fit 4 wands in each display case, how many wands will be in the partially full display case?\n\n\n_ wands",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "2"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of wands by the number each display case holds. Divide: 326 ÷ 4 = 81 with R 2."
        ],
        [
          "2/2",
          "The remainder is 2.\nThis means there will be 2 wands in the partially full display case."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_50_step_1",
          "Long division showing 326 ÷ 4 = 81 R2. The quotient 81 is written above with 'R2' indicating the remainder. The calculation shows the division process with a remainder of 2, meaning 81 display cases can be filled completely with 2 wands remaining."
        ]
      ],
      "question_number": "4_50"
    },
    {
      "skills": "divide-3-digit-numbers-and-interpret-remainders",
      "question_text": "League of Legends shop needs to ship 399 champion miniatures across the country. If they can fit 6 champion miniatures in each game board, how many champion miniatures will be in the partially full game board?\n\n\n_ champion miniatures",
      "question_type": "Fill in the blank",
      "tag": "Gr4_31_E4",
      "correct_answers": [
        "3"
      ],
      "solution": [
        [
          "1/2",
          "Divide the number of champion miniatures by the number each game board holds. Divide: 399 ÷ 6 = 66 with R 3."
        ],
        [
          "2/2",
          "The remainder is 3.\nThis means there will be 3 champion miniatures in the partially full game board."
        ]
      ],
      "solution_image_tag": [
        [
          "1/2",
          "Gr4_31_4_51_step_1",
          "Long division showing 399 ÷ 6 = 66 R3. The quotient 66 is written above with 'R3' indicating the remainder. The calculation shows the division process with a remainder of 3, meaning 66 game boards can be filled completely with 3 champion miniatures remaining."
        ]
      ],
      "question_number": "4_51"
    }
  ]
}