{
  "quizzes": [
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "image_choice_tags": [
        "Gr4_5_3_1_A",
        "Gr4_5_3_1_B",
        "Gr4_5_3_1_C"
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_1_step_2",
          "A horizontal number line from 0 to 1 with regular interval markings. A blue line segment is highlighted from approximately 0.167 to 0.333, representing one-sixth of the unit interval at that position."
        ],
        [
          "3/5",
          "Gr4_5_3_1_step_3",
          "A number line from 0 to 1 with a blue segment highlighted from approximately 0.667 to 0.833, showing another one-sixth interval further along the line."
        ],
        [
          "4/5",
          "Gr4_5_3_1_step_4",
          "A number line from 0 to 1 with a blue segment highlighted from approximately 0.5 to 0.667, demonstrating yet another one-sixth interval at the middle portion of the line."
        ]
      ],
      "question_number": "3_1",
      "image_choice_tags_backend_description": [
        "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.167 to 0.333 (covering one-sixth of the number line, between the 1st and 2nd tick marks).",
        "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.667 to 0.833 (covering one-sixth of the number line, between the 4th and 5th tick marks).",
        "A horizontal number line from 0 to 1 with tick marks dividing it into 6 equal segments. A blue highlighted segment spans from approximately 0.5 to 0.667 (covering one-sixth of the number line, between the 3rd and 4th tick marks)."
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{7}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_2",
      "image_choice_tags": [
        "Gr4_5_3_2_A",
        "Gr4_5_3_2_B",
        "Gr4_5_3_2_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.875 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.857 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.000 to 0.143, covering 1 part."
      ],
      "correct_answers": [
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 7 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{7}$."
        ],
        [
          "5/5",
          "Therefore, the third and second number lines show a coloured segment with a length of $\\frac{1}{7}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_2_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.875 to 1.000, showing 1/8 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_2_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.857 to 1.000, showing 1/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_2_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.000 to 0.143, showing 1/7 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{9}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_3",
      "image_choice_tags": [
        "Gr4_5_3_3_A",
        "Gr4_5_3_3_B",
        "Gr4_5_3_3_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.889 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.556 to 0.667, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.778 to 0.889, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "3/5",
          "Second number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{9}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_3_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.889 to 1.000, showing 1/9 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_3_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.556 to 0.667, showing 1/9 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_3_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.778 to 0.889, showing 1/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_4",
      "image_choice_tags": [
        "Gr4_5_3_4_A",
        "Gr4_5_3_4_B",
        "Gr4_5_3_4_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.750 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.750 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_4_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.750 to 1.000, showing 1/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_4_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.750 to 1.000, showing 1/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_4_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{7}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_5",
      "image_choice_tags": [
        "Gr4_5_3_5_A",
        "Gr4_5_3_5_B",
        "Gr4_5_3_5_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.100 to 0.400, covering 3 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.143 to 0.571, covering 3 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.571 to 1.000, covering 3 parts."
      ],
      "correct_answers": [
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "5/5",
          "Therefore, the second and third number lines show a coloured segment with a length of $\\frac{3}{7}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_5_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.100 to 0.400, showing 3/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_5_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.143 to 0.571, showing 3/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_5_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.571 to 1.000, showing 3/7 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_6",
      "image_choice_tags": [
        "Gr4_5_3_6_A",
        "Gr4_5_3_6_B",
        "Gr4_5_3_6_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.400 to 1.000, covering 3 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.400 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{3}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_6_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.400 to 1.000, showing 3/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_6_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.400 to 0.500, showing 1/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_6_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{8}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_7",
      "image_choice_tags": [
        "Gr4_5_3_7_A",
        "Gr4_5_3_7_B",
        "Gr4_5_3_7_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.625 to 0.750, covering 1 part.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.500 to 0.625, covering 1 part.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.875 to 1.000, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "3/5",
          "Second number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "4/5",
          "Third number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{8}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_7_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.625 to 0.750, showing 1/8 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_7_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.500 to 0.625, showing 1/8 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_7_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.875 to 1.000, showing 1/8 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_8",
      "image_choice_tags": [
        "Gr4_5_3_8_A",
        "Gr4_5_3_8_B",
        "Gr4_5_3_8_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.500 to 1.000, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.750, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.750, covering 2 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{2}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_8_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 2/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_8_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.750, showing 2/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_8_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.750, showing 2/4 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{7}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_9",
      "image_choice_tags": [
        "Gr4_5_3_9_A",
        "Gr4_5_3_9_B",
        "Gr4_5_3_9_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.571 to 1.000, covering 3 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.429 to 0.857, covering 3 parts.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, the second and first number lines show a coloured segment with a length of $\\frac{3}{7}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_9_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.571 to 1.000, showing 3/7 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_9_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.429 to 0.857, showing 3/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_9_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_10",
      "image_choice_tags": [
        "Gr4_5_3_10_A",
        "Gr4_5_3_10_B",
        "Gr4_5_3_10_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.333 to 0.556, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.700 to 0.900, covering 2 parts."
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 9 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{9}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "5/5",
          "Therefore, only the second number line shows a coloured segment with a length of $\\frac{1}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_10_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.333 to 0.556, showing 2/9 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_10_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_10_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.700 to 0.900, showing 2/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_11",
      "image_choice_tags": [
        "Gr4_5_3_11_A",
        "Gr4_5_3_11_B",
        "Gr4_5_3_11_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.500 to 0.667, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.500 to 0.600, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.500 to 0.667, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "5/5",
          "Therefore, the third and first number lines show a coloured segment with a length of $\\frac{1}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_11_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.500 to 0.667, showing 1/6 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_11_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.500 to 0.600, showing 1/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_11_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.500 to 0.667, showing 1/6 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_12",
      "image_choice_tags": [
        "Gr4_5_3_12_A",
        "Gr4_5_3_12_B",
        "Gr4_5_3_12_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.750, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.000 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.375 to 0.750, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 8 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{8}$."
        ],
        [
          "5/5",
          "Therefore, the second and first number lines show a coloured segment with a length of $\\frac{2}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_12_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.750, showing 2/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_12_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 2/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_12_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.375 to 0.750, showing 3/8 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_13",
      "image_choice_tags": [
        "Gr4_5_3_13_A",
        "Gr4_5_3_13_B",
        "Gr4_5_3_13_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.667 to 0.833, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.333 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.167 to 0.333, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_13_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.667 to 0.833, showing 1/6 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_13_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.333 to 0.500, showing 1/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_13_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.167 to 0.333, showing 1/6 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_14",
      "image_choice_tags": [
        "Gr4_5_3_14_A",
        "Gr4_5_3_14_B",
        "Gr4_5_3_14_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.000 to 0.400, covering 2 parts.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.833 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.400 to 0.700, covering 3 parts."
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "5/5",
          "Therefore, only the second number line shows a coloured segment with a length of $\\frac{1}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_14_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.000 to 0.400, showing 2/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_14_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.833 to 1.000, showing 1/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_14_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.400 to 0.700, showing 3/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_15",
      "image_choice_tags": [
        "Gr4_5_3_15_A",
        "Gr4_5_3_15_B",
        "Gr4_5_3_15_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.000 to 0.100, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.100 to 0.200, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.600 to 0.700, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_15_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.000 to 0.100, showing 1/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_15_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.100 to 0.200, showing 1/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_15_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.600 to 0.700, showing 1/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_16",
      "image_choice_tags": [
        "Gr4_5_3_16_A",
        "Gr4_5_3_16_B",
        "Gr4_5_3_16_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.500 to 0.800, covering 3 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.571 to 1.000, covering 3 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.000 to 0.300, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "5/5",
          "Therefore, the first and third number lines show a coloured segment with a length of $\\frac{3}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_16_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.500 to 0.800, showing 3/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_16_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.571 to 1.000, showing 3/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_16_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.000 to 0.300, showing 3/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_17",
      "image_choice_tags": [
        "Gr4_5_3_17_A",
        "Gr4_5_3_17_B",
        "Gr4_5_3_17_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.000 to 0.300, covering 3 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.600 to 0.900, covering 3 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.500 to 0.800, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{3}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_17_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.000 to 0.300, showing 3/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_17_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.600 to 0.900, showing 3/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_17_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.500 to 0.800, showing 3/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_18",
      "image_choice_tags": [
        "Gr4_5_3_18_A",
        "Gr4_5_3_18_B",
        "Gr4_5_3_18_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.167 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.143 to 0.286, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.333 to 0.667, covering 2 parts."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{6}$."
        ],
        [
          "5/5",
          "Therefore, the first and third number lines show a coloured segment with a length of $\\frac{2}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_18_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.167 to 0.500, showing 2/6 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_18_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.143 to 0.286, showing 1/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_18_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.333 to 0.667, showing 2/6 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{8}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_19",
      "image_choice_tags": [
        "Gr4_5_3_19_A",
        "Gr4_5_3_19_B",
        "Gr4_5_3_19_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.250 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.000 to 0.250, covering 2 parts.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.125 to 0.375, covering 2 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 8 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{8}$."
        ],
        [
          "3/5",
          "Second number line: There are 8 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{8}$."
        ],
        [
          "4/5",
          "Third number line: There are 8 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{8}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{2}{8}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_19_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 2/8 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_19_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.000 to 0.250, showing 2/8 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_19_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.125 to 0.375, showing 2/8 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{6}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_20",
      "image_choice_tags": [
        "Gr4_5_3_20_A",
        "Gr4_5_3_20_B",
        "Gr4_5_3_20_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.667 to 0.833, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.500 to 0.667, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.667 to 0.833, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{6}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_20_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.667 to 0.833, showing 1/6 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_20_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.500 to 0.667, showing 1/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_20_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.667 to 0.833, showing 1/6 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_21",
      "image_choice_tags": [
        "Gr4_5_3_21_A",
        "Gr4_5_3_21_B",
        "Gr4_5_3_21_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.333 to 0.667, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.100 to 0.200, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part."
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, only the third number line shows a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_21_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.333 to 0.667, showing 1/3 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_21_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.100 to 0.200, showing 1/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_21_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{9}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_22",
      "image_choice_tags": [
        "Gr4_5_3_22_A",
        "Gr4_5_3_22_B",
        "Gr4_5_3_22_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.222 to 0.556, covering 3 parts.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.111 to 0.444, covering 3 parts.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.667 to 1.000, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "3/5",
          "Second number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{3}{9}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_22_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.222 to 0.556, showing 3/9 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_22_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.111 to 0.444, showing 3/9 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_22_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.667 to 1.000, showing 3/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_23",
      "image_choice_tags": [
        "Gr4_5_3_23_A",
        "Gr4_5_3_23_B",
        "Gr4_5_3_23_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.800, covering 3 parts.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.500 to 1.000, covering 3 parts.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.400 to 1.000, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "5/5",
          "Therefore, the third and first number lines show a coloured segment with a length of $\\frac{3}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_23_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.800, showing 3/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_23_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 3/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_23_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.400 to 1.000, showing 3/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_24",
      "image_choice_tags": [
        "Gr4_5_3_24_A",
        "Gr4_5_3_24_B",
        "Gr4_5_3_24_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.800, covering 3 parts.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.400 to 1.000, covering 3 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.200 to 0.500, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{10}$."
        ],
        [
          "5/5",
          "Therefore, the second and first number lines show a coloured segment with a length of $\\frac{3}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_24_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.800, showing 3/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_24_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.400 to 1.000, showing 3/5 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_24_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.200 to 0.500, showing 3/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_25",
      "image_choice_tags": [
        "Gr4_5_3_25_A",
        "Gr4_5_3_25_B",
        "Gr4_5_3_25_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.750, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.000 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.125 to 0.500, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 8 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{8}$."
        ],
        [
          "5/5",
          "Therefore, the second and first number lines show a coloured segment with a length of $\\frac{2}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_25_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.750, showing 2/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_25_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 2/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_25_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.125 to 0.500, showing 3/8 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{7}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_26",
      "image_choice_tags": [
        "Gr4_5_3_26_A",
        "Gr4_5_3_26_B",
        "Gr4_5_3_26_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.286 to 0.571, covering 2 parts.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.333, covering 1 part.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.333, covering 1 part."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 7 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{7}$."
        ],
        [
          "3/5",
          "Second number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "4/5",
          "Third number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{2}{7}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_26_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.286 to 0.571, showing 2/7 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_26_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 1/3 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_26_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 1/3 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{9}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_27",
      "image_choice_tags": [
        "Gr4_5_3_27_A",
        "Gr4_5_3_27_B",
        "Gr4_5_3_27_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.667 to 0.778, covering 1 part.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.143 to 0.286, covering 1 part.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.333, covering 1 part."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "3/5",
          "Second number line: There are 7 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{7}$."
        ],
        [
          "4/5",
          "Third number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{1}{9}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_27_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.667 to 0.778, showing 1/9 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_27_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.143 to 0.286, showing 1/7 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_27_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 1/3 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_28",
      "image_choice_tags": [
        "Gr4_5_3_28_A",
        "Gr4_5_3_28_B",
        "Gr4_5_3_28_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.600 to 1.000, covering 2 parts.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.375 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{2}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_28_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.600 to 1.000, showing 2/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_28_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.375 to 0.500, showing 1/8 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_28_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_29",
      "image_choice_tags": [
        "Gr4_5_3_29_A",
        "Gr4_5_3_29_B",
        "Gr4_5_3_29_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.400 to 0.600, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.600 to 0.800, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.400, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_29_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.400 to 0.600, showing 1/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_29_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.600 to 0.800, showing 1/5 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_29_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.400, showing 1/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_30",
      "image_choice_tags": [
        "Gr4_5_3_30_A",
        "Gr4_5_3_30_B",
        "Gr4_5_3_30_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.800 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.600 to 0.800, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.400 to 0.600, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_30_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.800 to 1.000, showing 1/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_30_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.600 to 0.800, showing 1/5 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_30_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.400 to 0.600, showing 1/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{8}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_31",
      "image_choice_tags": [
        "Gr4_5_3_31_A",
        "Gr4_5_3_31_B",
        "Gr4_5_3_31_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.250 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part."
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "3/5",
          "Second number line: There are 8 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{8}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, only the second number line shows a coloured segment with a length of $\\frac{2}{8}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_31_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_31_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 2/8 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_31_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_32",
      "image_choice_tags": [
        "Gr4_5_3_32_A",
        "Gr4_5_3_32_B",
        "Gr4_5_3_32_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.333 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.300 to 0.500, covering 2 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.500 to 0.700, covering 2 parts."
      ],
      "correct_answers": [
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "5/5",
          "Therefore, the third and second number lines show a coloured segment with a length of $\\frac{2}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_32_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.333 to 0.500, showing 1/6 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_32_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.300 to 0.500, showing 2/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_32_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.500 to 0.700, showing 2/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{9}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_33",
      "image_choice_tags": [
        "Gr4_5_3_33_A",
        "Gr4_5_3_33_B",
        "Gr4_5_3_33_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.600 to 0.800, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.111 to 0.444, covering 3 parts.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.000 to 0.333, covering 3 parts."
      ],
      "correct_answers": [
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "5/5",
          "Therefore, the third and second number lines show a coloured segment with a length of $\\frac{3}{9}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_33_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.600 to 0.800, showing 1/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_33_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.111 to 0.444, showing 3/9 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_33_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 3/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{3}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_34",
      "image_choice_tags": [
        "Gr4_5_3_34_A",
        "Gr4_5_3_34_B",
        "Gr4_5_3_34_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.400, covering 1 part.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.333 to 0.667, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.556 to 0.778, covering 2 parts."
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{9}$."
        ],
        [
          "5/5",
          "Therefore, only the second number line shows a coloured segment with a length of $\\frac{1}{3}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_34_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.400, showing 1/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_34_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.333 to 0.667, showing 1/3 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_34_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.556 to 0.778, showing 2/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{9}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_35",
      "image_choice_tags": [
        "Gr4_5_3_35_A",
        "Gr4_5_3_35_B",
        "Gr4_5_3_35_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.667 to 0.778, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.333 to 0.444, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.400, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "3/5",
          "Second number line: There are 9 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{9}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "5/5",
          "Therefore, the first and second number lines show a coloured segment with a length of $\\frac{1}{9}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_35_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.667 to 0.778, showing 1/9 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_35_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.333 to 0.444, showing 1/9 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_35_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.400, showing 1/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_36",
      "image_choice_tags": [
        "Gr4_5_3_36_A",
        "Gr4_5_3_36_B",
        "Gr4_5_3_36_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_36_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_36_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_36_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_37",
      "image_choice_tags": [
        "Gr4_5_3_37_A",
        "Gr4_5_3_37_B",
        "Gr4_5_3_37_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.600, covering 2 parts.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.600 to 1.000, covering 2 parts.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.200 to 0.600, covering 2 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 5 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{5}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{5}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{2}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_37_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.600, showing 2/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_37_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.600 to 1.000, showing 2/5 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_37_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.200 to 0.600, showing 2/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_38",
      "image_choice_tags": [
        "Gr4_5_3_38_A",
        "Gr4_5_3_38_B",
        "Gr4_5_3_38_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.111 to 0.444, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "5/5",
          "Therefore, the second and first number lines show a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_38_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_38_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_38_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.111 to 0.444, showing 3/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{7}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_39",
      "image_choice_tags": [
        "Gr4_5_3_39_A",
        "Gr4_5_3_39_B",
        "Gr4_5_3_39_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.286 to 0.714, covering 3 parts.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.286 to 0.714, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "5/5",
          "Therefore, the first and third number lines show a coloured segment with a length of $\\frac{3}{7}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_39_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.286 to 0.714, showing 3/7 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_39_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_39_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.286 to 0.714, showing 3/7 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_40",
      "image_choice_tags": [
        "Gr4_5_3_40_A",
        "Gr4_5_3_40_B",
        "Gr4_5_3_40_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_40_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_40_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_40_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{4}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_41",
      "image_choice_tags": [
        "Gr4_5_3_41_A",
        "Gr4_5_3_41_B",
        "Gr4_5_3_41_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.750 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.250 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.500 to 0.750, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "4/5",
          "Third number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{1}{4}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_41_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.750 to 1.000, showing 1/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_41_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.250 to 0.500, showing 1/4 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_41_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.500 to 0.750, showing 1/4 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_42",
      "image_choice_tags": [
        "Gr4_5_3_42_A",
        "Gr4_5_3_42_B",
        "Gr4_5_3_42_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.000 to 0.200, covering 1 part.",
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.000 to 0.200, covering 1 part."
      ],
      "correct_answers": [
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "3/5",
          "Second number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "4/5",
          "Third number line: There are 5 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{5}$."
        ],
        [
          "5/5",
          "Therefore, the second and third number lines show a coloured segment with a length of $\\frac{1}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_42_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_42_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.000 to 0.200, showing 1/5 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_42_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.000 to 0.200, showing 1/5 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_43",
      "image_choice_tags": [
        "Gr4_5_3_43_A",
        "Gr4_5_3_43_B",
        "Gr4_5_3_43_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.875 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.500 to 1.000, covering 3 parts."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "3/5",
          "Second number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "4/5",
          "Third number line: There are 6 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{6}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_43_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_43_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.875 to 1.000, showing 1/8 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_43_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 3/6 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_44",
      "image_choice_tags": [
        "Gr4_5_3_44_A",
        "Gr4_5_3_44_B",
        "Gr4_5_3_44_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.600 to 0.800, covering 2 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.500 to 0.700, covering 2 parts.",
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.800 to 1.000, covering 2 parts."
      ],
      "correct_answers": [
        "A",
        "B",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "4/5",
          "Third number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "5/5",
          "Therefore, all three number lines show a coloured segment with a length of $\\frac{2}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_44_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.600 to 0.800, showing 2/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_44_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.500 to 0.700, showing 2/10 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_44_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.800 to 1.000, showing 2/10 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{3}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_45",
      "image_choice_tags": [
        "Gr4_5_3_45_A",
        "Gr4_5_3_45_B",
        "Gr4_5_3_45_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.667, covering 2 parts.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.667, covering 2 parts.",
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.000 to 0.750, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 3 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{3}$."
        ],
        [
          "3/5",
          "Second number line: There are 3 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{3}$."
        ],
        [
          "4/5",
          "Third number line: There are 4 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{4}$."
        ],
        [
          "5/5",
          "Therefore, the first and second number lines show a coloured segment with a length of $\\frac{2}{3}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_45_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.667, showing 2/3 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_45_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.667, showing 2/3 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_45_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.000 to 0.750, showing 3/4 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{10}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_46",
      "image_choice_tags": [
        "Gr4_5_3_46_A",
        "Gr4_5_3_46_B",
        "Gr4_5_3_46_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.700 to 0.800, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.000 to 0.500, covering 1 part.",
        "A number line from 0 to 1 divided into 8 equal parts. A blue segment spans from 0.000 to 0.125, covering 1 part."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 8 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{8}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{1}{10}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_46_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.700 to 0.800, showing 1/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_46_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.000 to 0.500, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_46_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each eighth. A blue line segment is highlighted from approximately 0.000 to 0.125, showing 1/8 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_47",
      "image_choice_tags": [
        "Gr4_5_3_47_A",
        "Gr4_5_3_47_B",
        "Gr4_5_3_47_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 4 equal parts. A blue segment spans from 0.500 to 0.750, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.667 to 0.833, covering 1 part.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part."
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 4 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{4}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "5/5",
          "Therefore, only the third number line shows a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_47_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fourth. A blue line segment is highlighted from approximately 0.500 to 0.750, showing 1/4 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_47_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.667 to 0.833, showing 1/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_47_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{3}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_48",
      "image_choice_tags": [
        "Gr4_5_3_48_A",
        "Gr4_5_3_48_B",
        "Gr4_5_3_48_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.667 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 6 equal parts. A blue segment spans from 0.000 to 0.333, covering 2 parts.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.333, covering 1 part."
      ],
      "correct_answers": [
        "A",
        "C"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "3/5",
          "Second number line: There are 6 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{6}$."
        ],
        [
          "4/5",
          "Third number line: There are 3 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{3}$."
        ],
        [
          "5/5",
          "Therefore, the third and first number lines show a coloured segment with a length of $\\frac{1}{3}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_48_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.667 to 1.000, showing 1/3 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_48_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each sixth. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 2/6 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_48_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.333, showing 1/3 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{2}{3}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_49",
      "image_choice_tags": [
        "Gr4_5_3_49_A",
        "Gr4_5_3_49_B",
        "Gr4_5_3_49_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.333 to 1.000, covering 2 parts.",
        "A number line from 0 to 1 divided into 3 equal parts. A blue segment spans from 0.000 to 0.667, covering 2 parts.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.429 to 0.857, covering 3 parts."
      ],
      "correct_answers": [
        "A",
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 3 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{3}$."
        ],
        [
          "3/5",
          "Second number line: There are 3 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{3}$."
        ],
        [
          "4/5",
          "Third number line: There are 7 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{7}$."
        ],
        [
          "5/5",
          "Therefore, the first and second number lines show a coloured segment with a length of $\\frac{2}{3}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_49_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.333 to 1.000, showing 2/3 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_49_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each third. A blue line segment is highlighted from approximately 0.000 to 0.667, showing 2/3 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_49_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.429 to 0.857, showing 3/7 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{3}{5}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_50",
      "image_choice_tags": [
        "Gr4_5_3_50_A",
        "Gr4_5_3_50_B",
        "Gr4_5_3_50_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 5 equal parts. A blue segment spans from 0.000 to 0.600, covering 3 parts.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 9 equal parts. A blue segment spans from 0.222 to 0.556, covering 3 parts."
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 5 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{5}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 9 equal parts between 0 and 1. There are 3 coloured parts. So the segment has a length of $\\frac{3}{9}$."
        ],
        [
          "5/5",
          "Therefore, only the first number line shows a coloured segment with a length of $\\frac{3}{5}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_50_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each fifth. A blue line segment is highlighted from approximately 0.000 to 0.600, showing 3/5 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_50_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_50_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each ninth. A blue line segment is highlighted from approximately 0.222 to 0.556, showing 3/9 of the unit interval."
        ]
      ]
    },
    {
      "skills": "fractions-of-number-lines",
      "question_text": "Which number lines show a coloured segment with a length of $\\frac{1}{2}$?",
      "question_type": "Multiple Choice with Multiple Answers",
      "tag": "Gr4_5_E3",
      "question_number": "3_51",
      "image_choice_tags": [
        "Gr4_5_3_51_A",
        "Gr4_5_3_51_B",
        "Gr4_5_3_51_C"
      ],
      "image_choice_tags_backend_description": [
        "A number line from 0 to 1 divided into 10 equal parts. A blue segment spans from 0.200 to 0.400, covering 2 parts.",
        "A number line from 0 to 1 divided into 2 equal parts. A blue segment spans from 0.500 to 1.000, covering 1 part.",
        "A number line from 0 to 1 divided into 7 equal parts. A blue segment spans from 0.571 to 0.857, covering 2 parts."
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/5",
          "Count the number of equal parts between 0 and 1. Then, count how many are coloured."
        ],
        [
          "2/5",
          "First number line: There are 10 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{10}$."
        ],
        [
          "3/5",
          "Second number line: There are 2 equal parts between 0 and 1. There is 1 coloured part. So the segment has a length of $\\frac{1}{2}$."
        ],
        [
          "4/5",
          "Third number line: There are 7 equal parts between 0 and 1. There are 2 coloured parts. So the segment has a length of $\\frac{2}{7}$."
        ],
        [
          "5/5",
          "Therefore, only the second number line shows a coloured segment with a length of $\\frac{1}{2}$."
        ]
      ],
      "solution_image_tag": [
        [
          "2/5",
          "Gr4_5_3_51_step_2",
          "A horizontal number line from 0 to 1 with tick marks at each tenth. A blue line segment is highlighted from approximately 0.200 to 0.400, showing 2/10 of the unit interval."
        ],
        [
          "3/5",
          "Gr4_5_3_51_step_3",
          "A horizontal number line from 0 to 1 with tick marks at each half. A blue line segment is highlighted from approximately 0.500 to 1.000, showing 1/2 of the unit interval."
        ],
        [
          "4/5",
          "Gr4_5_3_51_step_4",
          "A horizontal number line from 0 to 1 with tick marks at each seventh. A blue line segment is highlighted from approximately 0.571 to 0.857, showing 2/7 of the unit interval."
        ]
      ]
    }
  ]
}