{
  "quizzes": [
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Adam's class wants to give some money to the children's hospital in town. The class is planning to earn the money with a bake sale. So, Adam has baked banana bread to sell. Adam cuts the banana bread into 2 equal pieces.\n\nWhich fraction model represents one piece of the banana bread?\n",
      "image_tag": "Gr4_6_1_1",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_1_A",
        "Gr4_6_1_1_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The banana bread is the whole. Adam cuts it into 2 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 2 equal parts to match how Adam cut the banana bread."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the banana bread."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{2}$ and represents one piece of the banana bread."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_1_step_2",
          "A rectangle divided into two equal vertical sections. Both sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
        ],
        [
          "3/4",
          "Gr4_6_1_1_step_3",
          "The same rectangle divided into two equal vertical sections. The left half is now filled with blue color while the right half remains white, clearly showing one-half shaded."
        ]
      ],
      "question_number": "1_1",
      "backend_description": "A simple rectangle divided into two equal parts. The left half is colored blue, and the right half is white/empty. This represents the fraction 1/2 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into two sections. The left section is filled with a medium blue color and takes up exactly half of the rectangle. The right section is white/unfilled and also takes up half of the rectangle. The rectangle has a black border outline.",
        "A rectangular bar divided into three equal sections by vertical lines. The leftmost section is filled with a light green color and takes up one-third of the rectangle. The middle and right sections are white/unfilled, each taking up one-third of the rectangle. The rectangle has a black border outline."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Mario's team wants to share with Luigi. The team is planning to earn money with a bake sale. So, Mario has baked mushroom pizza to sell. Mario cuts the mushroom pizza into 5 equal pieces.\n\nWhich fraction model represents one piece of the mushroom pizza?\n",
      "image_tag": "Gr4_6_1_2",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_2_A",
        "Gr4_6_1_2_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The mushroom pizza is the whole. Mario cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Mario cut the mushroom pizza."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the mushroom pizza."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the mushroom pizza."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_2_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_2_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_2",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Flash's team wants to share with Kid Flash. The team is planning to earn money with a bake sale. So, Flash has baked speed-boost energy bar to sell. Flash cuts the speed-boost energy bar into 8 equal pieces.\n\nWhich fraction model represents one piece of the speed-boost energy bar?\n",
      "image_tag": "Gr4_6_1_3",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_3_A",
        "Gr4_6_1_3_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The speed-boost energy bar is the whole. Flash cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Flash cut the speed-boost energy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the speed-boost energy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the speed-boost energy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_3_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_3_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_3",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Luffy's team wants to share with the Straw Hat crew. The team is planning to earn money with a bake sale. So, Luffy has baked meat pie to sell. Luffy cuts the meat pie into 7 equal pieces.\n\nWhich fraction model represents one piece of the meat pie?\n",
      "image_tag": "Gr4_6_1_4",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_4_A",
        "Gr4_6_1_4_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The meat pie is the whole. Luffy cuts it into 7 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 7 equal parts to match how Luffy cut the meat pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the meat pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{7}$ and represents one piece of the meat pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_4_step_2",
          "A rectangle divided into 7 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sevenths."
        ],
        [
          "3/4",
          "Gr4_6_1_4_step_3",
          "The same rectangle divided into 7 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-seventh shaded."
        ]
      ],
      "question_number": "1_4",
      "backend_description": "A simple rectangle divided into 7 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/7 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Thor's team wants to share with Loki. The team is planning to earn money with a bake sale. So, Thor has baked Asgardian bread to sell. Thor cuts the Asgardian bread into 3 equal pieces.\n\nWhich fraction model represents one piece of the Asgardian bread?\n",
      "image_tag": "Gr4_6_1_5",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_5_A",
        "Gr4_6_1_5_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Asgardian bread is the whole. Thor cuts it into 3 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 3 equal parts to match how Thor cut the Asgardian bread."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Asgardian bread."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{3}$ and represents one piece of the Asgardian bread."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_5_step_2",
          "A rectangle divided into 3 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into thirds."
        ],
        [
          "3/4",
          "Gr4_6_1_5_step_3",
          "The same rectangle divided into 3 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-third shaded."
        ]
      ],
      "question_number": "1_5",
      "backend_description": "A simple rectangle divided into 3 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/3 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ash's team wants to celebrate at the Pokemon Center. The team is planning to earn money with a bake sale. So, Ash has baked Pokeball cake to sell. Ash cuts the Poke ball cake into 2 equal pieces.\n\nWhich fraction model represents one piece of the Poke ball cake?\n",
      "image_tag": "Gr4_6_1_6",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_6_A",
        "Gr4_6_1_6_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The Poke ball cake is the whole. Ash cuts it into 2 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 2 equal parts to match how Ash cut the Poke ball cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Poke ball cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{2}$ and represents one piece of the Poke ball cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_6_step_2",
          "A rectangle divided into 2 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
        ],
        [
          "3/4",
          "Gr4_6_1_6_step_3",
          "The same rectangle divided into 2 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-half shaded."
        ]
      ],
      "question_number": "1_6",
      "backend_description": "A simple rectangle divided into 2 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/2 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ichigo's team wants to share with the Soul Reapers. The team is planning to earn money with a bake sale. So, Ichigo has baked soul candy bar to sell. Ichigo cuts the soul candy bar into 6 equal pieces.\n\nWhich fraction model represents one piece of the soul candy bar?\n",
      "image_tag": "Gr4_6_1_7",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_7_A",
        "Gr4_6_1_7_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The soul candy bar is the whole. Ichigo cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Ichigo cut the soul candy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the soul candy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the soul candy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_7_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_7_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_7",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Yoda's team wants to share with young Padawans. The team is planning to earn money with a bake sale. So, Yoda has baked Force energy bar to sell. Yoda cuts the Force energy bar into 6 equal pieces.\n\nWhich fraction model represents one piece of the Force energy bar?\n",
      "image_tag": "Gr4_6_1_8",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_8_A",
        "Gr4_6_1_8_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Force energy bar is the whole. Yoda cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Yoda cut the Force energy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Force energy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the Force energy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_8_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_8_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_8",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Optimus Prime's team wants to share with Autobots. The team is planning to earn money with a bake sale. So, Optimus Prime has baked energon cube cake to sell. Optimus Prime cuts the energon cube cake into 4 equal pieces.\n\nWhich fraction model represents one piece of the energon cube cake?\n",
      "image_tag": "Gr4_6_1_9",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_9_A",
        "Gr4_6_1_9_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The energon cube cake is the whole. Optimus Prime cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Optimus Prime cut the energon cube cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the energon cube cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the energon cube cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_9_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_9_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_9",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Groot's team wants to share with Rocket. The team is planning to earn money with a bake sale. So, Groot has baked tree bark cookies to sell. Groot cuts the tree bark cookies into 5 equal pieces.\n\nWhich fraction model represents one piece of the tree bark cookies?\n",
      "image_tag": "Gr4_6_1_10",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_10_A",
        "Gr4_6_1_10_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The tree bark cookies is the whole. Groot cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Groot cut the tree bark cookies."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the tree bark cookies."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the tree bark cookies."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_10_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_10_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_10",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Captain America's team wants to share with Bucky. The team is planning to earn money with a bake sale. So, Captain America has baked shield-shaped pie to sell. Captain America cuts the shield-shaped pie into 6 equal pieces.\n\nWhich fraction model represents one piece of the shield-shaped pie?\n",
      "image_tag": "Gr4_6_1_11",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_11_A",
        "Gr4_6_1_11_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The shield-shaped pie is the whole. Captain America cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Captain America cut the shield-shaped pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the shield-shaped pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the shield-shaped pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_11_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_11_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_11",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Elsa's team wants to share with Anna. The team is planning to earn money with a bake sale. So, Elsa has baked frozen ice cake to sell. Elsa cuts the frozen ice cake into 4 equal pieces.\n\nWhich fraction model represents one piece of the frozen ice cake?\n",
      "image_tag": "Gr4_6_1_12",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_12_A",
        "Gr4_6_1_12_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The frozen ice cake is the whole. Elsa cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Elsa cut the frozen ice cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the frozen ice cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the frozen ice cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_12_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_12_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_12",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Thanos's team wants to share with his army. The team is planning to earn money with a bake sale. So, Thanos has baked infinity stone cookies to sell. Thanos cuts the infinity stone cookies into 4 equal pieces.\n\nWhich fraction model represents one piece of the infinity stone cookies?\n",
      "image_tag": "Gr4_6_1_13",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_13_A",
        "Gr4_6_1_13_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The infinity stone cookies is the whole. Thanos cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Thanos cut the infinity stone cookies."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the infinity stone cookies."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the infinity stone cookies."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_13_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_13_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_13",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Hermione's team wants to share at the Gryffindor party. The team is planning to earn money with a bake sale. So, Hermione has baked spell book cake to sell. Hermione cuts the spell book cake into 8 equal pieces.\n\nWhich fraction model represents one piece of the spell book cake?\n",
      "image_tag": "Gr4_6_1_14",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_14_A",
        "Gr4_6_1_14_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The spell book cake is the whole. Hermione cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Hermione cut the spell book cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the spell book cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the spell book cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_14_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_14_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_14",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Sonic's team wants to share with Tails. The team is planning to earn money with a bake sale. So, Sonic has baked chili dog casserole to sell. Sonic cuts the chili dog casserole into 6 equal pieces.\n\nWhich fraction model represents one piece of the chili dog casserole?\n",
      "image_tag": "Gr4_6_1_15",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_15_A",
        "Gr4_6_1_15_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The chili dog casserole is the whole. Sonic cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Sonic cut the chili dog casserole."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the chili dog casserole."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the chili dog casserole."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_15_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_15_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_15",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Todoroki's team wants to share at the UA festival. The team is planning to earn money with a bake sale. So, Todoroki has baked ice-fire cake to sell. Todoroki cuts the ice-fire cake into 3 equal pieces.\n\nWhich fraction model represents one piece of the ice-fire cake?\n",
      "image_tag": "Gr4_6_1_16",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_16_A",
        "Gr4_6_1_16_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The ice-fire cake is the whole. Todoroki cuts it into 3 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 3 equal parts to match how Todoroki cut the ice-fire cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the ice-fire cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{3}$ and represents one piece of the ice-fire cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_16_step_2",
          "A rectangle divided into 3 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into thirds."
        ],
        [
          "3/4",
          "Gr4_6_1_16_step_3",
          "The same rectangle divided into 3 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-third shaded."
        ]
      ],
      "question_number": "1_16",
      "backend_description": "A simple rectangle divided into 3 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/3 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Todoroki's team wants to share at the UA festival. The team is planning to earn money with a bake sale. So, Todoroki has baked ice-fire cake to sell. Todoroki cuts the ice-fire cake into 8 equal pieces.\n\nWhich fraction model represents one piece of the ice-fire cake?\n",
      "image_tag": "Gr4_6_1_17",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_17_A",
        "Gr4_6_1_17_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The ice-fire cake is the whole. Todoroki cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Todoroki cut the ice-fire cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the ice-fire cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the ice-fire cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_17_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_17_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_17",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Sonic's team wants to share with Tails. The team is planning to earn money with a bake sale. So, Sonic has baked chili dog casserole to sell. Sonic cuts the chili dog casserole into 4 equal pieces.\n\nWhich fraction model represents one piece of the chili dog casserole?\n",
      "image_tag": "Gr4_6_1_18",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_18_A",
        "Gr4_6_1_18_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The chili dog casserole is the whole. Sonic cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Sonic cut the chili dog casserole."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the chili dog casserole."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the chili dog casserole."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_18_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_18_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_18",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Captain America's team wants to share with Bucky. The team is planning to earn money with a bake sale. So, Captain America has baked shield-shaped pie to sell. Captain America cuts the shield-shaped pie into 5 equal pieces.\n\nWhich fraction model represents one piece of the shield-shaped pie?\n",
      "image_tag": "Gr4_6_1_19",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_19_A",
        "Gr4_6_1_19_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The shield-shaped pie is the whole. Captain America cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Captain America cut the shield-shaped pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the shield-shaped pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the shield-shaped pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_19_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_19_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_19",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Kirito's team wants to share with his party. The team is planning to earn money with a bake sale. So, Kirito has baked health potion pie to sell. Kirito cuts the health potion pie into 3 equal pieces.\n\nWhich fraction model represents one piece of the health potion pie?\n",
      "image_tag": "Gr4_6_1_20",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_20_A",
        "Gr4_6_1_20_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The health potion pie is the whole. Kirito cuts it into 3 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 3 equal parts to match how Kirito cut the health potion pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the health potion pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{3}$ and represents one piece of the health potion pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_20_step_2",
          "A rectangle divided into 3 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into thirds."
        ],
        [
          "3/4",
          "Gr4_6_1_20_step_3",
          "The same rectangle divided into 3 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-third shaded."
        ]
      ],
      "question_number": "1_20",
      "backend_description": "A simple rectangle divided into 3 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/3 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ichigo's team wants to share with the Soul Reapers. The team is planning to earn money with a bake sale. So, Ichigo has baked soul candy bar to sell. Ichigo cuts the soul candy bar into 2 equal pieces.\n\nWhich fraction model represents one piece of the soul candy bar?\n",
      "image_tag": "Gr4_6_1_21",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_21_A",
        "Gr4_6_1_21_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The soul candy bar is the whole. Ichigo cuts it into 2 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 2 equal parts to match how Ichigo cut the soul candy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the soul candy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{2}$ and represents one piece of the soul candy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_21_step_2",
          "A rectangle divided into 2 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
        ],
        [
          "3/4",
          "Gr4_6_1_21_step_3",
          "The same rectangle divided into 2 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-half shaded."
        ]
      ],
      "question_number": "1_21",
      "backend_description": "A simple rectangle divided into 2 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/2 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ash's team wants to celebrate at the Poke9mon Center. The team is planning to earn money with a bake sale. So, Ash has baked Poke ball cake to sell. Ash cuts the Poke ball cake into 7 equal pieces.\n\nWhich fraction model represents one piece of the Poke ball cake?\n",
      "image_tag": "Gr4_6_1_22",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_22_A",
        "Gr4_6_1_22_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Poke ball cake is the whole. Ash cuts it into 7 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 7 equal parts to match how Ash cut the Poke ball cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Poke ball cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{7}$ and represents one piece of the Poke ball cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_22_step_2",
          "A rectangle divided into 7 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sevenths."
        ],
        [
          "3/4",
          "Gr4_6_1_22_step_3",
          "The same rectangle divided into 7 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-seventh shaded."
        ]
      ],
      "question_number": "1_22",
      "backend_description": "A simple rectangle divided into 7 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/7 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Link's team wants to share with Zelda. The team is planning to earn money with a bake sale. So, Link has baked Hyrulean bread to sell. Link cuts the Hyrulean bread into 8 equal pieces.\n\nWhich fraction model represents one piece of the Hyrulean bread?\n",
      "image_tag": "Gr4_6_1_23",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_23_A",
        "Gr4_6_1_23_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Hyrulean bread is the whole. Link cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Link cut the Hyrulean bread."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Hyrulean bread."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the Hyrulean bread."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_23_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_23_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_23",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Hulk's team wants to share with Bruce Banner. The team is planning to earn money with a bake sale. So, Hulk has baked gamma-green smoothie bar to sell. Hulk cuts the gamma-green smoothie bar into 8 equal pieces.\n\nWhich fraction model represents one piece of the gamma-green smoothie bar?\n",
      "image_tag": "Gr4_6_1_24",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_24_A",
        "Gr4_6_1_24_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The gamma-green smoothie bar is the whole. Hulk cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Hulk cut the gamma-green smoothie bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the gamma-green smoothie bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the gamma-green smoothie bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_24_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_24_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_24",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Doctor Strange's team wants to share with Wong. The team is planning to earn money with a bake sale. So, Doctor Strange has baked mystic arts pie to sell. Doctor Strange cuts the mystic arts pie into 3 equal pieces.\n\nWhich fraction model represents one piece of the mystic arts pie?\n",
      "image_tag": "Gr4_6_1_25",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_25_A",
        "Gr4_6_1_25_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The mystic arts pie is the whole. Doctor Strange cuts it into 3 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 3 equal parts to match how Doctor Strange cut the mystic arts pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the mystic arts pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{3}$ and represents one piece of the mystic arts pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_25_step_2",
          "A rectangle divided into 3 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into thirds."
        ],
        [
          "3/4",
          "Gr4_6_1_25_step_3",
          "The same rectangle divided into 3 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-third shaded."
        ]
      ],
      "question_number": "1_25",
      "backend_description": "A simple rectangle divided into 3 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/3 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Batman's team wants to share with Robin. The team is planning to earn money with a bake sale. So, Batman has baked bat-shaped cookie bar to sell. Batman cuts the bat-shaped cookie bar into 2 equal pieces.\n\nWhich fraction model represents one piece of the bat-shaped cookie bar?\n",
      "image_tag": "Gr4_6_1_26",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_26_A",
        "Gr4_6_1_26_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The bat-shaped cookie bar is the whole. Batman cuts it into 2 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 2 equal parts to match how Batman cut the bat-shaped cookie bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the bat-shaped cookie bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{2}$ and represents one piece of the bat-shaped cookie bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_26_step_2",
          "A rectangle divided into 2 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
        ],
        [
          "3/4",
          "Gr4_6_1_26_step_3",
          "The same rectangle divided into 2 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-half shaded."
        ]
      ],
      "question_number": "1_26",
      "backend_description": "A simple rectangle divided into 2 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/2 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Deadpool's team wants to share with Wolverine. The team is planning to earn money with a bake sale. So, Deadpool has baked chimichanga casserole to sell. Deadpool cuts the chimichanga casserole into 4 equal pieces.\n\nWhich fraction model represents one piece of the chimichanga casserole?\n",
      "image_tag": "Gr4_6_1_27",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_27_A",
        "Gr4_6_1_27_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The chimichanga casserole is the whole. Deadpool cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Deadpool cut the chimichanga casserole."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the chimichanga casserole."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the chimichanga casserole."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_27_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_27_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_27",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Mario's team wants to share with Luigi. The team is planning to earn money with a bake sale. So, Mario has baked mushroom pizza to sell. Mario cuts the mushroom pizza into 4 equal pieces.\n\nWhich fraction model represents one piece of the mushroom pizza?\n",
      "image_tag": "Gr4_6_1_28",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_28_A",
        "Gr4_6_1_28_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The mushroom pizza is the whole. Mario cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Mario cut the mushroom pizza."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the mushroom pizza."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the mushroom pizza."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_28_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_28_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_28",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Mickey Mouse's team wants to share with Minnie. The team is planning to earn money with a bake sale. So, Mickey Mouse has baked clubhouse cake to sell. Mickey Mouse cuts the clubhouse cake into 6 equal pieces.\n\nWhich fraction model represents one piece of the clubhouse cake?\n",
      "image_tag": "Gr4_6_1_29",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_29_A",
        "Gr4_6_1_29_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The clubhouse cake is the whole. Mickey Mouse cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Mickey Mouse cut the clubhouse cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the clubhouse cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the clubhouse cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_29_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_29_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_29",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Thanos's team wants to share with his army. The team is planning to earn money with a bake sale. So, Thanos has baked infinity stone cookies to sell. Thanos cuts the infinity stone cookies into 5 equal pieces.\n\nWhich fraction model represents one piece of the infinity stone cookies?\n",
      "image_tag": "Gr4_6_1_30",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_30_A",
        "Gr4_6_1_30_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The infinity stone cookies is the whole. Thanos cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Thanos cut the infinity stone cookies."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the infinity stone cookies."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the infinity stone cookies."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_30_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_30_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_30",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Sonic's team wants to share with Tails. The team is planning to earn money with a bake sale. So, Sonic has baked chili dog casserole to sell. Sonic cuts the chili dog casserole into 6 equal pieces.\n\nWhich fraction model represents one piece of the chili dog casserole?\n",
      "image_tag": "Gr4_6_1_31",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_31_A",
        "Gr4_6_1_31_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The chili dog casserole is the whole. Sonic cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Sonic cut the chili dog casserole."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the chili dog casserole."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the chili dog casserole."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_31_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_31_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_31",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Saitama's team wants to share with Genos. The team is planning to earn money with a bake sale. So, Saitama has baked discount supermarket cake to sell. Saitama cuts the discount supermarket cake into 5 equal pieces.\n\nWhich fraction model represents one piece of the discount supermarket cake?\n",
      "image_tag": "Gr4_6_1_32",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_32_A",
        "Gr4_6_1_32_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The discount supermarket cake is the whole. Saitama cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Saitama cut the discount supermarket cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the discount supermarket cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the discount supermarket cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_32_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_32_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_32",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Iron Man's team wants to share with the Avengers. The team is planning to earn money with a bake sale. So, Iron Man has baked arc reactor cake to sell. Iron Man cuts the arc reactor cake into 8 equal pieces.\n\nWhich fraction model represents one piece of the arc reactor cake?\n",
      "image_tag": "Gr4_6_1_33",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_33_A",
        "Gr4_6_1_33_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The arc reactor cake is the whole. Iron Man cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Iron Man cut the arc reactor cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the arc reactor cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the arc reactor cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_33_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_33_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_33",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Kakashi's team wants to share with his students. The team is planning to earn money with a bake sale. So, Kakashi has baked ninja food bar to sell. Kakashi cuts the ninja food bar into 6 equal pieces.\n\nWhich fraction model represents one piece of the ninja food bar?\n",
      "image_tag": "Gr4_6_1_34",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_34_A",
        "Gr4_6_1_34_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The ninja food bar is the whole. Kakashi cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Kakashi cut the ninja food bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the ninja food bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the ninja food bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_34_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_34_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_34",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Batman's team wants to share with Robin. The team is planning to earn money with a bake sale. So, Batman has baked bat-shaped cookie bar to sell. Batman cuts the bat-shaped cookie bar into 3 equal pieces.\n\nWhich fraction model represents one piece of the bat-shaped cookie bar?\n",
      "image_tag": "Gr4_6_1_35",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_35_A",
        "Gr4_6_1_35_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The bat-shaped cookie bar is the whole. Batman cuts it into 3 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 3 equal parts to match how Batman cut the bat-shaped cookie bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the bat-shaped cookie bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{3}$ and represents one piece of the bat-shaped cookie bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_35_step_2",
          "A rectangle divided into 3 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into thirds."
        ],
        [
          "3/4",
          "Gr4_6_1_35_step_3",
          "The same rectangle divided into 3 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-third shaded."
        ]
      ],
      "question_number": "1_35",
      "backend_description": "A simple rectangle divided into 3 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/3 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 3 sections. The first section is filled with blue color and the rest are white, representing 1/3.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Kakashi's team wants to share with his students. The team is planning to earn money with a bake sale. So, Kakashi has baked ninja food bar to sell. Kakashi cuts the ninja food bar into 5 equal pieces.\n\nWhich fraction model represents one piece of the ninja food bar?\n",
      "image_tag": "Gr4_6_1_36",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_36_A",
        "Gr4_6_1_36_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The ninja food bar is the whole. Kakashi cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Kakashi cut the ninja food bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the ninja food bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the ninja food bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_36_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_36_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_36",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "SpongeBob's team wants to share with Patrick. The team is planning to earn money with a bake sale. So, SpongeBob has baked Krabby Patty pie to sell. SpongeBob cuts the Krabby Patty pie into 7 equal pieces.\n\nWhich fraction model represents one piece of the Krabby Patty pie?\n",
      "image_tag": "Gr4_6_1_37",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_37_A",
        "Gr4_6_1_37_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The Krabby Patty pie is the whole. SpongeBob cuts it into 7 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 7 equal parts to match how SpongeBob cut the Krabby Patty pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Krabby Patty pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{7}$ and represents one piece of the Krabby Patty pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_37_step_2",
          "A rectangle divided into 7 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sevenths."
        ],
        [
          "3/4",
          "Gr4_6_1_37_step_3",
          "The same rectangle divided into 7 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-seventh shaded."
        ]
      ],
      "question_number": "1_37",
      "backend_description": "A simple rectangle divided into 7 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/7 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7.",
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Yoda's team wants to share with young Padawans. The team is planning to earn money with a bake sale. So, Yoda has baked Force energy bar to sell. Yoda cuts the Force energy bar into 5 equal pieces.\n\nWhich fraction model represents one piece of the Force energy bar?\n",
      "image_tag": "Gr4_6_1_38",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_38_A",
        "Gr4_6_1_38_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The Force energy bar is the whole. Yoda cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Yoda cut the Force energy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Force energy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the Force energy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_38_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_38_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_38",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Doctor Strange's team wants to share with Wong. The team is planning to earn money with a bake sale. So, Doctor Strange has baked mystic arts pie to sell. Doctor Strange cuts the mystic arts pie into 5 equal pieces.\n\nWhich fraction model represents one piece of the mystic arts pie?\n",
      "image_tag": "Gr4_6_1_39",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_39_A",
        "Gr4_6_1_39_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The mystic arts pie is the whole. Doctor Strange cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Doctor Strange cut the mystic arts pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the mystic arts pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the mystic arts pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_39_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_39_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_39",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ichigo's team wants to share with the Soul Reapers. The team is planning to earn money with a bake sale. So, Ichigo has baked soul candy bar to sell. Ichigo cuts the soul candy bar into 5 equal pieces.\n\nWhich fraction model represents one piece of the soul candy bar?\n",
      "image_tag": "Gr4_6_1_40",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_40_A",
        "Gr4_6_1_40_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The soul candy bar is the whole. Ichigo cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Ichigo cut the soul candy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the soul candy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the soul candy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_40_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_40_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_40",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Eren's team wants to share with the Survey Corps. The team is planning to earn money with a bake sale. So, Eren has baked potato bread to sell. Eren cuts the potato bread into 6 equal pieces.\n\nWhich fraction model represents one piece of the potato bread?\n",
      "image_tag": "Gr4_6_1_41",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_41_A",
        "Gr4_6_1_41_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The potato bread is the whole. Eren cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Eren cut the potato bread."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the potato bread."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the potato bread."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_41_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_41_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_41",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Optimus Prime's team wants to share with Autobots. The team is planning to earn money with a bake sale. So, Optimus Prime has baked energon cube cake to sell. Optimus Prime cuts the energon cube cake into 7 equal pieces.\n\nWhich fraction model represents one piece of the energon cube cake?\n",
      "image_tag": "Gr4_6_1_42",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_42_A",
        "Gr4_6_1_42_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The energon cube cake is the whole. Optimus Prime cuts it into 7 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 7 equal parts to match how Optimus Prime cut the energon cube cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the energon cube cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{7}$ and represents one piece of the energon cube cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_42_step_2",
          "A rectangle divided into 7 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sevenths."
        ],
        [
          "3/4",
          "Gr4_6_1_42_step_3",
          "The same rectangle divided into 7 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-seventh shaded."
        ]
      ],
      "question_number": "1_42",
      "backend_description": "A simple rectangle divided into 7 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/7 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 7 sections. The first section is filled with blue color and the rest are white, representing 1/7."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Doctor Strange's team wants to share with Wong. The team is planning to earn money with a bake sale. So, Doctor Strange has baked mystic arts pie to sell. Doctor Strange cuts the mystic arts pie into 5 equal pieces.\n\nWhich fraction model represents one piece of the mystic arts pie?\n",
      "image_tag": "Gr4_6_1_43",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_43_A",
        "Gr4_6_1_43_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The mystic arts pie is the whole. Doctor Strange cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Doctor Strange cut the mystic arts pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the mystic arts pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the mystic arts pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_43_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_43_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_43",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5.",
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Thanos's team wants to share with his army. The team is planning to earn money with a bake sale. So, Thanos has baked infinity stone cookies to sell. Thanos cuts the infinity stone cookies into 8 equal pieces.\n\nWhich fraction model represents one piece of the infinity stone cookies?\n",
      "image_tag": "Gr4_6_1_44",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_44_A",
        "Gr4_6_1_44_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The infinity stone cookies is the whole. Thanos cuts it into 8 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 8 equal parts to match how Thanos cut the infinity stone cookies."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the infinity stone cookies."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{8}$ and represents one piece of the infinity stone cookies."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_44_step_2",
          "A rectangle divided into 8 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into eighths."
        ],
        [
          "3/4",
          "Gr4_6_1_44_step_3",
          "The same rectangle divided into 8 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-eighth shaded."
        ]
      ],
      "question_number": "1_44",
      "backend_description": "A simple rectangle divided into 8 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/8 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 8 sections. The first section is filled with blue color and the rest are white, representing 1/8.",
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Levi's team wants to share with the scouts. The team is planning to earn money with a bake sale. So, Levi has baked tea cake to sell. Levi cuts the tea cake into 4 equal pieces.\n\nWhich fraction model represents one piece of the tea cake?\n",
      "image_tag": "Gr4_6_1_45",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_45_A",
        "Gr4_6_1_45_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The tea cake is the whole. Levi cuts it into 4 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 4 equal parts to match how Levi cut the tea cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the tea cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{4}$ and represents one piece of the tea cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_45_step_2",
          "A rectangle divided into 4 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into quarters."
        ],
        [
          "3/4",
          "Gr4_6_1_45_step_3",
          "The same rectangle divided into 4 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-quarter shaded."
        ]
      ],
      "question_number": "1_45",
      "backend_description": "A simple rectangle divided into 4 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/4 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Spider-Man's team wants to share with MJ. The team is planning to earn money with a bake sale. So, Spider-Man has baked web-pattern pizza to sell. Spider-Man cuts the web-pattern pizza into 5 equal pieces.\n\nWhich fraction model represents one piece of the web-pattern pizza?\n",
      "image_tag": "Gr4_6_1_46",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_46_A",
        "Gr4_6_1_46_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The web-pattern pizza is the whole. Spider-Man cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Spider-Man cut the web-pattern pizza."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the web-pattern pizza."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the web-pattern pizza."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_46_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_46_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_46",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Yoda's team wants to share with young Padawans. The team is planning to earn money with a bake sale. So, Yoda has baked Force energy bar to sell. Yoda cuts the Force energy bar into 2 equal pieces.\n\nWhich fraction model represents one piece of the Force energy bar?\n",
      "image_tag": "Gr4_6_1_47",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_47_A",
        "Gr4_6_1_47_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Force energy bar is the whole. Yoda cuts it into 2 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 2 equal parts to match how Yoda cut the Force energy bar."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Force energy bar."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{2}$ and represents one piece of the Force energy bar."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_47_step_2",
          "A rectangle divided into 2 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into halves."
        ],
        [
          "3/4",
          "Gr4_6_1_47_step_3",
          "The same rectangle divided into 2 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-half shaded."
        ]
      ],
      "question_number": "1_47",
      "backend_description": "A simple rectangle divided into 2 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/2 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "SpongeBob's team wants to share with Patrick. The team is planning to earn money with a bake sale. So, SpongeBob has baked Krabby Patty pie to sell. SpongeBob cuts the Krabby Patty pie into 6 equal pieces.\n\nWhich fraction model represents one piece of the Krabby Patty pie?\n",
      "image_tag": "Gr4_6_1_48",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_48_A",
        "Gr4_6_1_48_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The Krabby Patty pie is the whole. SpongeBob cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how SpongeBob cut the Krabby Patty pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Krabby Patty pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the Krabby Patty pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_48_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_48_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_48",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "SpongeBob's team wants to share with Patrick. The team is planning to earn money with a bake sale. So, SpongeBob has baked Krabby Patty pie to sell. SpongeBob cuts the Krabby Patty pie into 6 equal pieces.\n\nWhich fraction model represents one piece of the Krabby Patty pie?\n",
      "image_tag": "Gr4_6_1_49",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_49_A",
        "Gr4_6_1_49_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Krabby Patty pie is the whole. SpongeBob cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how SpongeBob cut the Krabby Patty pie."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Krabby Patty pie."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the Krabby Patty pie."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_49_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_49_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_49",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 4 sections. The first section is filled with blue color and the rest are white, representing 1/4.",
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Ash's team wants to celebrate at the Poke9mon Center. The team is planning to earn money with a bake sale. So, Ash has baked Poke ball cake to sell. Ash cuts the Poke ball cake into 5 equal pieces.\n\nWhich fraction model represents one piece of the Poke ball cake?\n",
      "image_tag": "Gr4_6_1_50",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_50_A",
        "Gr4_6_1_50_B"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/4",
          "The Poke ball cake is the whole. Ash cuts it into 5 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 5 equal parts to match how Ash cut the Poke ball cake."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the Poke ball cake."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{5}$ and represents one piece of the Poke ball cake."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_50_step_2",
          "A rectangle divided into 5 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into fifths."
        ],
        [
          "3/4",
          "Gr4_6_1_50_step_3",
          "The same rectangle divided into 5 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-fifth shaded."
        ]
      ],
      "question_number": "1_50",
      "backend_description": "A simple rectangle divided into 5 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/5 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 5 sections. The first section is filled with blue color and the rest are white, representing 1/5."
      ]
    },
    {
      "skills": "unit-fractions-modelling-word-problems",
      "question_text": "Groot's team wants to share with Rocket. The team is planning to earn money with a bake sale. So, Groot has baked tree bark cookies to sell. Groot cuts the tree bark cookies into 6 equal pieces.\n\nWhich fraction model represents one piece of the tree bark cookies?\n",
      "image_tag": "Gr4_6_1_51",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_6_E1",
      "image_choice_tags": [
        "Gr4_6_1_51_A",
        "Gr4_6_1_51_B"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/4",
          "The tree bark cookies is the whole. Groot cuts it into 6 equal pieces."
        ],
        [
          "2/4",
          "The fraction model should have 6 equal parts to match how Groot cut the tree bark cookies."
        ],
        [
          "3/4",
          "Color 1 part to show one piece of the tree bark cookies."
        ],
        [
          "4/4",
          "This fraction model shows $\\frac{1}{6}$ and represents one piece of the tree bark cookies."
        ]
      ],
      "solution_image_tag": [
        [
          "2/4",
          "Gr4_6_1_51_step_2",
          "A rectangle divided into 6 equal sections. All sections are outlined in blue but remain unfilled (white interior), representing the whole divided into sixths."
        ],
        [
          "3/4",
          "Gr4_6_1_51_step_3",
          "The same rectangle divided into 6 equal sections. The first section is now filled with blue color while the rest remain white, clearly showing one-sixth shaded."
        ]
      ],
      "question_number": "1_51",
      "backend_description": "A simple rectangle divided into 6 equal parts. One part is colored blue, and the rest are white/empty. This represents the fraction 1/6 visually.",
      "image_choice_tags_backend_description": [
        "A rectangular bar divided into 6 sections. The first section is filled with blue color and the rest are white, representing 1/6.",
        "A rectangular bar divided into 2 sections. The first section is filled with blue color and the rest are white, representing 1/2."
      ]
    }
  ]
}