{
  "quizzes": [
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Jerry had 9 DVDs. His mother bought him d more DVDs. Choose the expression that shows how many DVDs Jerry has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "9",
        "9 - d",
        "9 + d",
        "d - 9"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let’s look at each answer choice:\n9\nThis is the total amount of DVDs that Jerry had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "9 - d\nThis means Jerry is losing DVDs, but the question says his mother bought him more, not less."
        ],
        [
          "3/4",
          "9 + d\nThis means you start with 9 DVDs, then add d more. So, this expression shows how many DVDs Jerry has now."
        ],
        [
          "4/4",
          "d - 9\nThis means you're taking 9 away from d. That isn't what happened. Jerry already had 9, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_1"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Jamie had 14 books. Her teacher bought him y more books. Choose the expression that shows how many books Jamie has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "14",
        "14 - y",
        "14 + y",
        "y - 14"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n14\nThis is the total amount of books that Jamie had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "14 - y\nThis means Jamie is losing books, but the question says her teacher bought him more, not less."
        ],
        [
          "3/4",
          "14 + y\nThis means you start with 14 books, then add y more. So, this expression shows how many books Jamie has now."
        ],
        [
          "4/4",
          "y - 14\nThis means you're taking 14 away from y. That isn't what happened. Jamie already had 14, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_2"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Jordan had 38 marbles. His grandfather bought her e more marbles. Choose the expression that shows how many marbles Jordan has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "38",
        "38 - e",
        "38 + e",
        "e - 38"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n38\nThis is the total amount of marbles that Jordan had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "38 - e\nThis means Jordan is losing marbles, but the question says his grandfather bought him more, not less."
        ],
        [
          "3/4",
          "38 + e\nThis means you start with 38 marbles, then add e more. So, this expression shows how many marbles Jordan has now."
        ],
        [
          "4/4",
          "e - 38\nThis means you're taking 38 away from e. That isn't what happened. Jordan already had 38, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_3"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Nami had 17 anime figures. His sister bought her n more anime figures. Choose the expression that shows how many anime figures Nami has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "17",
        "17 - n",
        "17 + n",
        "n - 17"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n17\nThis is the total amount of anime figures that Nami had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "17 - n\nThis means Nami is losing anime figures, but the question says her sister bought him more, not less."
        ],
        [
          "3/4",
          "17 + n\nThis means you start with 17 anime figures, then add n more. So, this expression shows how many anime figures Nami has now."
        ],
        [
          "4/4",
          "n - 17\nThis means you're taking 17 away from n. That isn't what happened. Nami already had 17, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_4"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Brock had 5 action figures. His dad bought him c more action figures. Choose the expression that shows how many action figures Brock has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "5",
        "5 - c",
        "5 + c",
        "c - 5"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n5\nThis is the total amount of action figures that Brock had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "5 - c\nThis means Brock is losing action figures, but the question says her dad bought him more, not less."
        ],
        [
          "3/4",
          "5 + c\nThis means you start with 5 action figures, then add c more. So, this expression shows how many action figures Brock has now."
        ],
        [
          "4/4",
          "c - 5\nThis means you're taking 5 away from c. That isn't what happened. Brock already had 5, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_5"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Emerson had 25 marbles. His grandfather bought him h more marbles. Choose the expression that shows how many marbles Emerson has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "25",
        "25 - h",
        "25 + h",
        "h - 25"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n25\nThis is the total amount of marbles that Emerson had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "25 - h\nThis means Emerson is losing marbles, but the question says her grandfather bought him more, not less."
        ],
        [
          "3/4",
          "25 + h\nThis means you start with 25 marbles, then add h more. So, this expression shows how many marbles Emerson has now."
        ],
        [
          "4/4",
          "h - 25\nThis means you're taking 25 away from h. That isn't what happened. Emerson already had 25, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_6"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Rey had 2 anime figures. His sister bought him a more anime figures. Choose the expression that shows how many anime figures Rey has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "2",
        "2 - a",
        "2 + a",
        "a - 2"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n2\nThis is the total amount of anime figures that Rey had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "2 - a\nThis means Rey is losing anime figures, but the question says her sister bought him more, not less."
        ],
        [
          "3/4",
          "2 + a\nThis means you start with 2 anime figures, then add a more. So, this expression shows how many anime figures Rey has now."
        ],
        [
          "4/4",
          "a - 2\nThis means you're taking 2 away from a. That isn't what happened. Rey already had 2, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_7"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Cameron had 5 Pokemon. Her Professor Oak bought him v more Pokemon. Choose the expression that shows how many Pokemon Cameron has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "5",
        "5 - v",
        "5 + v",
        "v - 5"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n5\nThis is the total amount of Pokemon that Cameron had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "5 - v\nThis means Cameron is losing Pokemon, but the question says his Professor Oak bought her more, not less."
        ],
        [
          "3/4",
          "5 + v\nThis means you start with 5 Pokemon, then add v more. So, this expression shows how many Pokemon Cameron has now."
        ],
        [
          "4/4",
          "v - 5\nThis means you're taking 5 away from v. That isn't what happened. Cameron already had 5, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_8"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Misty had 50 Fortnite skins. His teammate bought him e more Fortnite skins. Choose the expression that shows how many Fortnite skins Misty has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "50",
        "50 - e",
        "50 + e",
        "e - 50"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n50\nThis is the total amount of Fortnite skins that Misty had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "50 - e\nThis means Misty is losing Fortnite skins, but the question says her teammate bought him more, not less."
        ],
        [
          "3/4",
          "50 + e\nThis means you start with 50 Fortnite skins, then add e more. So, this expression shows how many Fortnite skins Misty has now."
        ],
        [
          "4/4",
          "e - 50\nThis means you're taking 50 away from e. That isn't what happened. Misty already had 50, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_9"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Morgan had 13 Minecraft blocks. His Steve bought her a more Minecraft blocks. Choose the expression that shows how many Minecraft blocks Morgan has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "13",
        "13 - a",
        "13 + a",
        "a - 13"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n13\nThis is the total amount of Minecraft blocks that Morgan had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "13 - a\nThis means Morgan is losing Minecraft blocks, but the question says her Steve bought him more, not less."
        ],
        [
          "3/4",
          "13 + a\nThis means you start with 13 Minecraft blocks, then add a more. So, this expression shows how many Minecraft blocks Morgan has now."
        ],
        [
          "4/4",
          "a - 13\nThis means you're taking 13 away from a. That isn't what happened. Morgan already had 13, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_10"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Zoro had 34 comic books. His neighbor bought her q more comic books. Choose the expression that shows how many comic books Zoro has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "34",
        "34 - q",
        "34 + q",
        "q - 34"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n34\nThis is the total amount of comic books that Zoro had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "34 - q\nThis means Zoro is losing comic books, but the question says his neighbor bought her more, not less."
        ],
        [
          "3/4",
          "34 + q\nThis means you start with 34 comic books, then add q more. So, this expression shows how many comic books Zoro has now."
        ],
        [
          "4/4",
          "q - 34\nThis means you're taking 34 away from q. That isn't what happened. Zoro already had 34, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_11"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Cameron had 26 Dragon Balls. His Goku bought him s more Dragon Balls. Choose the expression that shows how many Dragon Balls Cameron has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "26",
        "26 - s",
        "26 + s",
        "s - 26"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n26\nThis is the total amount of Dragon Balls that Cameron had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "26 - s\nThis means Cameron is losing Dragon Balls, but the question says her Goku bought her more, not less."
        ],
        [
          "3/4",
          "26 + s\nThis means you start with 26 Dragon Balls, then add s more. So, this expression shows how many Dragon Balls Cameron has now."
        ],
        [
          "4/4",
          "s - 26\nThis means you're taking 26 away from s. That isn't what happened. Cameron already had 26, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_12"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Blake had 11 Nintendo games. Her friend bought her a more Nintendo games. Choose the expression that shows how many Nintendo games Blake has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "11",
        "11 - a",
        "11 + a",
        "a - 11"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n11\nThis is the total amount of Nintendo games that Blake had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "11 - a\nThis means Blake is losing Nintendo games, but the question says his friend bought him more, not less."
        ],
        [
          "3/4",
          "11 + a\nThis means you start with 11 Nintendo games, then add a more. So, this expression shows how many Nintendo games Blake has now."
        ],
        [
          "4/4",
          "a - 11\nThis means you're taking 11 away from a. That isn't what happened. Blake already had 11, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_13"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Riley had 7 vibranium shields. Her Black Panther bought her k more vibranium shields. Choose the expression that shows how many vibranium shields Riley has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "7",
        "7 - k",
        "7 + k",
        "k - 7"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n7\nThis is the total amount of vibranium shields that Riley had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "7 - k\nThis means Riley is losing vibranium shields, but the question says his Black Panther bought him more, not less."
        ],
        [
          "3/4",
          "7 + k\nThis means you start with 7 vibranium shields, then add k more. So, this expression shows how many vibranium shields Riley has now."
        ],
        [
          "4/4",
          "k - 7\nThis means you're taking 7 away from k. That isn't what happened. Riley already had 7, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_14"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Natasha had 11 books. His teacher bought him v more books. Choose the expression that shows how many books Natasha has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "11",
        "11 - v",
        "11 + v",
        "v - 11"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n11\nThis is the total amount of books that Natasha had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "11 - v\nThis means Natasha is losing books, but the question says her teacher bought him more, not less."
        ],
        [
          "3/4",
          "11 + v\nThis means you start with 11 books, then add v more. So, this expression shows how many books Natasha has now."
        ],
        [
          "4/4",
          "v - 11\nThis means you're taking 11 away from v. That isn't what happened. Natasha already had 11, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_15"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Robin had 32 Nintendo games. His friend bought him s more Nintendo games. Choose the expression that shows how many Nintendo games Robin has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "32",
        "32 - s",
        "32 + s",
        "s - 32"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n32\nThis is the total amount of Nintendo games that Robin had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "32 - s\nThis means Robin is losing Nintendo games, but the question says her friend bought her more, not less."
        ],
        [
          "3/4",
          "32 + s\nThis means you start with 32 Nintendo games, then add s more. So, this expression shows how many Nintendo games Robin has now."
        ],
        [
          "4/4",
          "s - 32\nThis means you're taking 32 away from s. That isn't what happened. Robin already had 32, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_16"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Dawn had 45 Pokemon. Her Professor Oak bought her d more Pokemon. Choose the expression that shows how many Pokemon Dawn has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "45",
        "45 - d",
        "45 + d",
        "d - 45"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n45\nThis is the total amount of Pokemon that Dawn had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "45 - d\nThis means Dawn is losing Pokemon, but the question says his Professor Oak bought him more, not less."
        ],
        [
          "3/4",
          "45 + d\nThis means you start with 45 Pokemon, then add d more. So, this expression shows how many Pokemon Dawn has now."
        ],
        [
          "4/4",
          "d - 45\nThis means you're taking 45 away from d. That isn't what happened. Dawn already had 45, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_17"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Luffy had 9 anime figures. His sister bought him b more anime figures. Choose the expression that shows how many anime figures Luffy has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "9",
        "9 - b",
        "9 + b",
        "b - 9"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n9\nThis is the total amount of anime figures that Luffy had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "9 - b\nThis means Luffy is losing anime figures, but the question says her sister bought him more, not less."
        ],
        [
          "3/4",
          "9 + b\nThis means you start with 9 anime figures, then add b more. So, this expression shows how many anime figures Luffy has now."
        ],
        [
          "4/4",
          "b - 9\nThis means you're taking 9 away from b. That isn't what happened. Luffy already had 9, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_18"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Peter had 14 Minecraft blocks. His Steve bought her m more Minecraft blocks. Choose the expression that shows how many Minecraft blocks Peter has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "14",
        "14 - m",
        "14 + m",
        "m - 14"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n14\nThis is the total amount of Minecraft blocks that Peter had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "14 - m\nThis means Peter is losing Minecraft blocks, but the question says his Steve bought her more, not less."
        ],
        [
          "3/4",
          "14 + m\nThis means you start with 14 Minecraft blocks, then add m more. So, this expression shows how many Minecraft blocks Peter has now."
        ],
        [
          "4/4",
          "m - 14\nThis means you're taking 14 away from m. That isn't what happened. Peter already had 14, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_19"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Riley had 28 anime figures. Her sister bought him c more anime figures. Choose the expression that shows how many anime figures Riley has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "28",
        "28 - c",
        "28 + c",
        "c - 28"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n28\nThis is the total amount of anime figures that Riley had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "28 - c\nThis means Riley is losing anime figures, but the question says her sister bought him more, not less."
        ],
        [
          "3/4",
          "28 + c\nThis means you start with 28 anime figures, then add c more. So, this expression shows how many anime figures Riley has now."
        ],
        [
          "4/4",
          "c - 28\nThis means you're taking 28 away from c. That isn't what happened. Riley already had 28, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_20"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Sanji had 31 lightsabers. His Yoda bought him z more lightsabers. Choose the expression that shows how many lightsabers Sanji has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "31",
        "31 - z",
        "31 + z",
        "z - 31"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n31\nThis is the total amount of lightsabers that Sanji had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "31 - z\nThis means Sanji is losing lightsabers, but the question says his Yoda bought her more, not less."
        ],
        [
          "3/4",
          "31 + z\nThis means you start with 31 lightsabers, then add z more. So, this expression shows how many lightsabers Sanji has now."
        ],
        [
          "4/4",
          "z - 31\nThis means you're taking 31 away from z. That isn't what happened. Sanji already had 31, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_21"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Jordan had 28 Twitch viewers. His streamer bought him t more Twitch viewers. Choose the expression that shows how many Twitch viewers Jordan has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "28",
        "28 - t",
        "28 + t",
        "t - 28"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n28\nThis is the total amount of Twitch viewers that Jordan had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "28 - t\nThis means Jordan is losing Twitch viewers, but the question says his streamer bought her more, not less."
        ],
        [
          "3/4",
          "28 + t\nThis means you start with 28 Twitch viewers, then add t more. So, this expression shows how many Twitch viewers Jordan has now."
        ],
        [
          "4/4",
          "t - 28\nThis means you're taking 28 away from t. That isn't what happened. Jordan already had 28, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_22"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Riley had 28 YouTube subscribers. His creator bought her h more YouTube subscribers. Choose the expression that shows how many YouTube subscribers Riley has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "28",
        "28 - h",
        "28 + h",
        "h - 28"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n28\nThis is the total amount of YouTube subscribers that Riley had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "28 - h\nThis means Riley is losing YouTube subscribers, but the question says his creator bought her more, not less."
        ],
        [
          "3/4",
          "28 + h\nThis means you start with 28 YouTube subscribers, then add h more. So, this expression shows how many YouTube subscribers Riley has now."
        ],
        [
          "4/4",
          "h - 28\nThis means you're taking 28 away from h. That isn't what happened. Riley already had 28, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_23"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Bruce had 3 anime figures. Her sister bought her q more anime figures. Choose the expression that shows how many anime figures Bruce has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "3",
        "3 - q",
        "3 + q",
        "q - 3"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n3\nThis is the total amount of anime figures that Bruce had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "3 - q\nThis means Bruce is losing anime figures, but the question says his sister bought her more, not less."
        ],
        [
          "3/4",
          "3 + q\nThis means you start with 3 anime figures, then add q more. So, this expression shows how many anime figures Bruce has now."
        ],
        [
          "4/4",
          "q - 3\nThis means you're taking 3 away from q. That isn't what happened. Bruce already had 3, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_24"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Jamie had 34 video games. His cousin bought him d more video games. Choose the expression that shows how many video games Jamie has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "34",
        "34 - d",
        "34 + d",
        "d - 34"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n34\nThis is the total amount of video games that Jamie had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "34 - d\nThis means Jamie is losing video games, but the question says her cousin bought him more, not less."
        ],
        [
          "3/4",
          "34 + d\nThis means you start with 34 video games, then add d more. So, this expression shows how many video games Jamie has now."
        ],
        [
          "4/4",
          "d - 34\nThis means you're taking 34 away from d. That isn't what happened. Jamie already had 34, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_25"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Cameron had 38 vibranium shields. His Black Panther bought her h more vibranium shields. Choose the expression that shows how many vibranium shields Cameron has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "38",
        "38 - h",
        "38 + h",
        "h - 38"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n38\nThis is the total amount of vibranium shields that Cameron had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "38 - h\nThis means Cameron is losing vibranium shields, but the question says her Black Panther bought him more, not less."
        ],
        [
          "3/4",
          "38 + h\nThis means you start with 38 vibranium shields, then add h more. So, this expression shows how many vibranium shields Cameron has now."
        ],
        [
          "4/4",
          "h - 38\nThis means you're taking 38 away from h. That isn't what happened. Cameron already had 38, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_26"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Ash had 32 TikTok followers. Her influencer bought her s more TikTok followers. Choose the expression that shows how many TikTok followers Ash has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "32",
        "32 - s",
        "32 + s",
        "s - 32"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n32\nThis is the total amount of TikTok followers that Ash had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "32 - s\nThis means Ash is losing TikTok followers, but the question says her influencer bought him more, not less."
        ],
        [
          "3/4",
          "32 + s\nThis means you start with 32 TikTok followers, then add s more. So, this expression shows how many TikTok followers Ash has now."
        ],
        [
          "4/4",
          "s - 32\nThis means you're taking 32 away from s. That isn't what happened. Ash already had 32, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_27"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Sasuke had 37 spell books. His Dumbledore bought her p more spell books. Choose the expression that shows how many spell books Sasuke has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "37",
        "37 - p",
        "37 + p",
        "p - 37"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n37\nThis is the total amount of spell books that Sasuke had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "37 - p\nThis means Sasuke is losing spell books, but the question says his Dumbledore bought him more, not less."
        ],
        [
          "3/4",
          "37 + p\nThis means you start with 37 spell books, then add p more. So, this expression shows how many spell books Sasuke has now."
        ],
        [
          "4/4",
          "p - 37\nThis means you're taking 37 away from p. That isn't what happened. Sasuke already had 37, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_28"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Luffy had 22 spell books. Her Dumbledore bought him k more spell books. Choose the expression that shows how many spell books Luffy has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "22",
        "22 - k",
        "22 + k",
        "k - 22"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n22\nThis is the total amount of spell books that Luffy had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "22 - k\nThis means Luffy is losing spell books, but the question says her Dumbledore bought him more, not less."
        ],
        [
          "3/4",
          "22 + k\nThis means you start with 22 spell books, then add k more. So, this expression shows how many spell books Luffy has now."
        ],
        [
          "4/4",
          "k - 22\nThis means you're taking 22 away from k. That isn't what happened. Luffy already had 22, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_29"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Bruce had 36 Pikachu cards. His trainer bought her z more Pikachu cards. Choose the expression that shows how many Pikachu cards Bruce has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "36",
        "36 - z",
        "36 + z",
        "z - 36"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n36\nThis is the total amount of Pikachu cards that Bruce had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "36 - z\nThis means Bruce is losing Pikachu cards, but the question says her trainer bought her more, not less."
        ],
        [
          "3/4",
          "36 + z\nThis means you start with 36 Pikachu cards, then add z more. So, this expression shows how many Pikachu cards Bruce has now."
        ],
        [
          "4/4",
          "z - 36\nThis means you're taking 36 away from z. That isn't what happened. Bruce already had 36, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_30"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Leia had 18 Pokemon. Her Professor Oak bought her u more Pokemon. Choose the expression that shows how many Pokemon Leia has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "18",
        "18 - u",
        "18 + u",
        "u - 18"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n18\nThis is the total amount of Pokemon that Leia had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "18 - u\nThis means Leia is losing Pokemon, but the question says her Professor Oak bought her more, not less."
        ],
        [
          "3/4",
          "18 + u\nThis means you start with 18 Pokemon, then add u more. So, this expression shows how many Pokemon Leia has now."
        ],
        [
          "4/4",
          "u - 18\nThis means you're taking 18 away from u. That isn't what happened. Leia already had 18, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_31"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Alex had 17 Pikachu cards. His trainer bought her r more Pikachu cards. Choose the expression that shows how many Pikachu cards Alex has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "17",
        "17 - r",
        "17 + r",
        "r - 17"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n17\nThis is the total amount of Pikachu cards that Alex had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "17 - r\nThis means Alex is losing Pikachu cards, but the question says her trainer bought him more, not less."
        ],
        [
          "3/4",
          "17 + r\nThis means you start with 17 Pikachu cards, then add r more. So, this expression shows how many Pikachu cards Alex has now."
        ],
        [
          "4/4",
          "r - 17\nThis means you're taking 17 away from r. That isn't what happened. Alex already had 17, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_32"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Finley had 43 baseball cards. His uncle bought him q more baseball cards. Choose the expression that shows how many baseball cards Finley has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "43",
        "43 - q",
        "43 + q",
        "q - 43"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n43\nThis is the total amount of baseball cards that Finley had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "43 - q\nThis means Finley is losing baseball cards, but the question says her uncle bought her more, not less."
        ],
        [
          "3/4",
          "43 + q\nThis means you start with 43 baseball cards, then add q more. So, this expression shows how many baseball cards Finley has now."
        ],
        [
          "4/4",
          "q - 43\nThis means you're taking 43 away from q. That isn't what happened. Finley already had 43, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_33"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Tony had 20 books. Her teacher bought him t more books. Choose the expression that shows how many books Tony has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "20",
        "20 - t",
        "20 + t",
        "t - 20"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n20\nThis is the total amount of books that Tony had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "20 - t\nThis means Tony is losing books, but the question says his teacher bought her more, not less."
        ],
        [
          "3/4",
          "20 + t\nThis means you start with 20 books, then add t more. So, this expression shows how many books Tony has now."
        ],
        [
          "4/4",
          "t - 20\nThis means you're taking 20 away from t. That isn't what happened. Tony already had 20, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_34"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Sasuke had 18 Fortnite skins. Her teammate bought him m more Fortnite skins. Choose the expression that shows how many Fortnite skins Sasuke has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "18",
        "18 - m",
        "18 + m",
        "m - 18"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n18\nThis is the total amount of Fortnite skins that Sasuke had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "18 - m\nThis means Sasuke is losing Fortnite skins, but the question says his teammate bought her more, not less."
        ],
        [
          "3/4",
          "18 + m\nThis means you start with 18 Fortnite skins, then add m more. So, this expression shows how many Fortnite skins Sasuke has now."
        ],
        [
          "4/4",
          "m - 18\nThis means you're taking 18 away from m. That isn't what happened. Sasuke already had 18, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_35"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Luke had 33 toy cars. His aunt bought her j more toy cars. Choose the expression that shows how many toy cars Luke has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "33",
        "33 - j",
        "33 + j",
        "j - 33"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n33\nThis is the total amount of toy cars that Luke had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "33 - j\nThis means Luke is losing toy cars, but the question says her aunt bought him more, not less."
        ],
        [
          "3/4",
          "33 + j\nThis means you start with 33 toy cars, then add j more. So, this expression shows how many toy cars Luke has now."
        ],
        [
          "4/4",
          "j - 33\nThis means you're taking 33 away from j. That isn't what happened. Luke already had 33, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_36"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Nami had 44 stickers. Her friend bought him u more stickers. Choose the expression that shows how many stickers Nami has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "44",
        "44 - u",
        "44 + u",
        "u - 44"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n44\nThis is the total amount of stickers that Nami had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "44 - u\nThis means Nami is losing stickers, but the question says his friend bought him more, not less."
        ],
        [
          "3/4",
          "44 + u\nThis means you start with 44 stickers, then add u more. So, this expression shows how many stickers Nami has now."
        ],
        [
          "4/4",
          "u - 44\nThis means you're taking 44 away from u. That isn't what happened. Nami already had 44, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_37"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Morgan had 43 marbles. His grandfather bought her c more marbles. Choose the expression that shows how many marbles Morgan has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "43",
        "43 - c",
        "43 + c",
        "c - 43"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n43\nThis is the total amount of marbles that Morgan had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "43 - c\nThis means Morgan is losing marbles, but the question says his grandfather bought her more, not less."
        ],
        [
          "3/4",
          "43 + c\nThis means you start with 43 marbles, then add c more. So, this expression shows how many marbles Morgan has now."
        ],
        [
          "4/4",
          "c - 43\nThis means you're taking 43 away from c. That isn't what happened. Morgan already had 43, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_38"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Blake had 8 books. His teacher bought him v more books. Choose the expression that shows how many books Blake has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "8",
        "8 - v",
        "8 + v",
        "v - 8"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n8\nThis is the total amount of books that Blake had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "8 - v\nThis means Blake is losing books, but the question says her teacher bought him more, not less."
        ],
        [
          "3/4",
          "8 + v\nThis means you start with 8 books, then add v more. So, this expression shows how many books Blake has now."
        ],
        [
          "4/4",
          "v - 8\nThis means you're taking 8 away from v. That isn't what happened. Blake already had 8, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_39"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Finn had 17 pencils. His mother bought her f more pencils. Choose the expression that shows how many pencils Finn has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "17",
        "17 - f",
        "17 + f",
        "f - 17"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n17\nThis is the total amount of pencils that Finn had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "17 - f\nThis means Finn is losing pencils, but the question says her mother bought him more, not less."
        ],
        [
          "3/4",
          "17 + f\nThis means you start with 17 pencils, then add f more. So, this expression shows how many pencils Finn has now."
        ],
        [
          "4/4",
          "f - 17\nThis means you're taking 17 away from f. That isn't what happened. Finn already had 17, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_40"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Han had 46 toy cars. Her aunt bought her a more toy cars. Choose the expression that shows how many toy cars Han has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "46",
        "46 - a",
        "46 + a",
        "a - 46"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n46\nThis is the total amount of toy cars that Han had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "46 - a\nThis means Han is losing toy cars, but the question says her aunt bought him more, not less."
        ],
        [
          "3/4",
          "46 + a\nThis means you start with 46 toy cars, then add a more. So, this expression shows how many toy cars Han has now."
        ],
        [
          "4/4",
          "a - 46\nThis means you're taking 46 away from a. That isn't what happened. Han already had 46, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_41"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Bruce had 19 spell books. His Dumbledore bought her u more spell books. Choose the expression that shows how many spell books Bruce has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "19",
        "19 - u",
        "19 + u",
        "u - 19"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n19\nThis is the total amount of spell books that Bruce had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "19 - u\nThis means Bruce is losing spell books, but the question says his Dumbledore bought him more, not less."
        ],
        [
          "3/4",
          "19 + u\nThis means you start with 19 spell books, then add u more. So, this expression shows how many spell books Bruce has now."
        ],
        [
          "4/4",
          "u - 19\nThis means you're taking 19 away from u. That isn't what happened. Bruce already had 19, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_42"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Brock had 35 books. His teacher bought him n more books. Choose the expression that shows how many books Brock has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "35",
        "35 - n",
        "35 + n",
        "n - 35"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n35\nThis is the total amount of books that Brock had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "35 - n\nThis means Brock is losing books, but the question says his teacher bought her more, not less."
        ],
        [
          "3/4",
          "35 + n\nThis means you start with 35 books, then add n more. So, this expression shows how many books Brock has now."
        ],
        [
          "4/4",
          "n - 35\nThis means you're taking 35 away from n. That isn't what happened. Brock already had 35, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_43"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Ash had 39 infinity stones. His collector bought him x more infinity stones. Choose the expression that shows how many infinity stones Ash has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "39",
        "39 - x",
        "39 + x",
        "x - 39"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n39\nThis is the total amount of infinity stones that Ash had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "39 - x\nThis means Ash is losing infinity stones, but the question says his collector bought her more, not less."
        ],
        [
          "3/4",
          "39 + x\nThis means you start with 39 infinity stones, then add x more. So, this expression shows how many infinity stones Ash has now."
        ],
        [
          "4/4",
          "x - 39\nThis means you're taking 39 away from x. That isn't what happened. Ash already had 39, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_44"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Taylor had 37 vibranium shields. His Black Panther bought her g more vibranium shields. Choose the expression that shows how many vibranium shields Taylor has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "37",
        "37 - g",
        "37 + g",
        "g - 37"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n37\nThis is the total amount of vibranium shields that Taylor had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "37 - g\nThis means Taylor is losing vibranium shields, but the question says his Black Panther bought him more, not less."
        ],
        [
          "3/4",
          "37 + g\nThis means you start with 37 vibranium shields, then add g more. So, this expression shows how many vibranium shields Taylor has now."
        ],
        [
          "4/4",
          "g - 37\nThis means you're taking 37 away from g. That isn't what happened. Taylor already had 37, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_45"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Steve had 37 Minecraft blocks. Her Steve bought her a more Minecraft blocks. Choose the expression that shows how many Minecraft blocks Steve has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "37",
        "37 - a",
        "37 + a",
        "a - 37"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n37\nThis is the total amount of Minecraft blocks that Steve had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "37 - a\nThis means Steve is losing Minecraft blocks, but the question says her Steve bought him more, not less."
        ],
        [
          "3/4",
          "37 + a\nThis means you start with 37 Minecraft blocks, then add a more. So, this expression shows how many Minecraft blocks Steve has now."
        ],
        [
          "4/4",
          "a - 37\nThis means you're taking 37 away from a. That isn't what happened. Steve already had 37, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_46"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Nami had 48 Fortnite skins. His teammate bought her n more Fortnite skins. Choose the expression that shows how many Fortnite skins Nami has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "48",
        "48 - n",
        "48 + n",
        "n - 48"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n48\nThis is the total amount of Fortnite skins that Nami had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "48 - n\nThis means Nami is losing Fortnite skins, but the question says his teammate bought her more, not less."
        ],
        [
          "3/4",
          "48 + n\nThis means you start with 48 Fortnite skins, then add n more. So, this expression shows how many Fortnite skins Nami has now."
        ],
        [
          "4/4",
          "n - 48\nThis means you're taking 48 away from n. That isn't what happened. Nami already had 48, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_47"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Nami had 14 action figures. Her dad bought him x more action figures. Choose the expression that shows how many action figures Nami has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "14",
        "14 - x",
        "14 + x",
        "x - 14"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n14\nThis is the total amount of action figures that Nami had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "14 - x\nThis means Nami is losing action figures, but the question says her dad bought him more, not less."
        ],
        [
          "3/4",
          "14 + x\nThis means you start with 14 action figures, then add x more. So, this expression shows how many action figures Nami has now."
        ],
        [
          "4/4",
          "x - 14\nThis means you're taking 14 away from x. That isn't what happened. Nami already had 14, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_48"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Riley had 15 Twitch viewers. Her streamer bought him t more Twitch viewers. Choose the expression that shows how many Twitch viewers Riley has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "15",
        "15 - t",
        "15 + t",
        "t - 15"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n15\nThis is the total amount of Twitch viewers that Riley had. This doesn't show how many he has now."
        ],
        [
          "2/4",
          "15 - t\nThis means Riley is losing Twitch viewers, but the question says his streamer bought him more, not less."
        ],
        [
          "3/4",
          "15 + t\nThis means you start with 15 Twitch viewers, then add t more. So, this expression shows how many Twitch viewers Riley has now."
        ],
        [
          "4/4",
          "t - 15\nThis means you're taking 15 away from t. That isn't what happened. Riley already had 15, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_49"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Sasuke had 21 Roblox items. His developer bought her u more Roblox items. Choose the expression that shows how many Roblox items Sasuke has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "21",
        "21 - u",
        "21 + u",
        "u - 21"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n21\nThis is the total amount of Roblox items that Sasuke had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "21 - u\nThis means Sasuke is losing Roblox items, but the question says his developer bought her more, not less."
        ],
        [
          "3/4",
          "21 + u\nThis means you start with 21 Roblox items, then add u more. So, this expression shows how many Roblox items Sasuke has now."
        ],
        [
          "4/4",
          "u - 21\nThis means you're taking 21 away from u. That isn't what happened. Sasuke already had 21, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_50"
    },
    {
      "skills": "write-variable-expressions-word-problems",
      "question_text": "Brock had 13 stickers. His friend bought her g more stickers. Choose the expression that shows how many stickers Brock has now.",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E2",
      "choices": [
        "13",
        "13 - g",
        "13 + g",
        "g - 13"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/4",
          "Let's look at each answer choice:\n13\nThis is the total amount of stickers that Brock had. This doesn't show how many she has now."
        ],
        [
          "2/4",
          "13 - g\nThis means Brock is losing stickers, but the question says her friend bought him more, not less."
        ],
        [
          "3/4",
          "13 + g\nThis means you start with 13 stickers, then add g more. So, this expression shows how many stickers Brock has now."
        ],
        [
          "4/4",
          "g - 13\nThis means you're taking 13 away from g. That isn't what happened. Brock already had 13, and then got more."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "2_51"
    }
  ]
}