{
  "quizzes": [
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "A toy company is going to use 7 boxes to ship some toys across the country. The company needs to ship 42 toys. Which equation, when solved, will tell how many toys the company should put in each box?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "42 x t= 7",
        "7 x t = 42",
        "42 - 7 = t",
        "7 + t = 42"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 42 toys in total, 7 boxes, and that the toys will be shared equally between the boxes.\nWe need to figure out how many toys go in each box. Let's use the variable t, to represent toys in each box."
        ],
        [
          "2/2",
          "So, if we multiply the number of boxes by the number of toys in each box, we should get the total number of toys.\nThat means: 7 × t = 42.\nThis equation shows: 7 boxes, with t toys in each one, equals 42 toys in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_1"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Pokemon Company is going to use 12 containers to store cookies across the country. The company needs to store 127 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "127 x d= 12",
        "127 - 12 = d",
        "12 x d = 127",
        "12 + d = 127"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 127 cookies in total, 12 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable d, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 12 x d = 127.\nThis equation shows: 12 containers, with d cookies in each one, equals 127 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_2"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Funimation is going to use 8 shelves to display books across the country. The company needs to display book 88 books. Which equation, when solved, will tell how many books the company should put in each shelve?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "88 x p= 8",
        "8 x p = 88",
        "88 - 8 = p",
        "8 + p = 88"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 88 books in total, 8 shelves, and that the books will be shared equally between the shelves.\nWe need to figure out how many books go in each shelve. Let's use the variable p, to represent books in each shelve."
        ],
        [
          "2/2",
          "So, if we multiply the number of shelves by the number of books in each shelve, we should get the total number of books.\nThat means: 8 x p = 88.\nThis equation shows: 8 shelves, with p books in each one, equals 88 books in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_3"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is is going to use 6 classrooms to store desks across the country. The company needs to store 159 desks. Which equation, when solved, will tell how many desks the company should put in each classroom?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "159 x p= 6",
        "6 x p = 159",
        "159 - 6 = p",
        "6 + p = 159"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 159 desks in total, 6 classrooms, and that the desks will be shared equally between the classrooms.\nWe need to figure out how many desks go in each classroom. Let's use the variable p, to represent desks in each classroom."
        ],
        [
          "2/2",
          "So, if we multiply the number of classrooms by the number of desks in each classroom, we should get the total number of desks.\nThat means: 6 x p = 159.\nThis equation shows: 6 classrooms, with p desks in each one, equals 159 desks in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_4"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Tech Corp is going to use 12 jars to store candies across the country. The company needs to store candie 62 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "62 x k= 12",
        "62 - 12 = k",
        "12 x k = 62",
        "12 + k = 62"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 62 candies in total, 12 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable k, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 12 x k = 62.\nThis equation shows: 12 jars, with k candies in each one, equals 62 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_5"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Studio Ghibli is going to use 10 jars to store candies across the country. The company needs to store 111 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "111 x n= 10",
        "111 - 10 = n",
        "10 x n = 111",
        "10 + n = 111"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 111 candies in total, 10 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable n, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 10 x n = 111.\nThis equation shows: 10 jars, with n candies in each one, equals 111 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_6"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Amazon Prime is going to use 15 folders to organize papers across the country. The company needs to organize paper 172 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "172 x z= 15",
        "15 x z = 172",
        "172 - 15 = z",
        "15 + z = 172"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 172 papers in total, 15 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable z, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 15 x z = 172.\nThis equation shows: 15 folders, with z papers in each one, equals 172 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_7"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Crunchyroll is is going to use 15 pages to store stickers across the country. The company needs to store 94 stickers. Which equation, when solved, will tell how many stickers the company should put in each page?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "94 x q= 15",
        "94 - 15 = q",
        "15 x q = 94",
        "15 + q = 94"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 94 stickers in total, 15 pages, and that the stickers will be shared equally between the pages.\nWe need to figure out how many stickers go in each page. Let's use the variable q, to represent stickers in each page."
        ],
        [
          "2/2",
          "So, if we multiply the number of pages by the number of stickers in each page, we should get the total number of stickers.\nThat means: 15 x q = 94.\nThis equation shows: 15 pages, with q stickers in each one, equals 94 stickers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_8"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Toy Factory is going to use 4 containers to store cookies across the country. The company needs to store cookie 102 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "102 x t= 4",
        "102 - 4 = t",
        "4 x t = 102",
        "4 + t = 102"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 102 cookies in total, 4 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable t, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 4 x t = 102.\nThis equation shows: 4 containers, with t cookies in each one, equals 102 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_9"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Entertainment Inc is going to use 13 groups to store members across the country. The company needs to store 101 members. Which equation, when solved, will tell how many members the company should put in each group?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "13 x m = 101",
        "101 x m= 13",
        "101 - 13 = m",
        "13 + m = 101"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 101 members in total, 13 groups, and that the members will be shared equally between the groups.\nWe need to figure out how many members go in each group. Let's use the variable m, to represent members in each group."
        ],
        [
          "2/2",
          "So, if we multiply the number of groups by the number of members in each group, we should get the total number of members.\nThat means: 13 x m = 101.\nThis equation shows: 13 groups, with m members in each one, equals 101 members in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_10"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Xbox Games is going to use 18 cases to store phones across the country. The company needs to store 26 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "26 x t= 18",
        "18 x t = 26",
        "26 - 18 = t",
        "18 + t = 26"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 26 phones in total, 18 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable t, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 18 x t = 26.\nThis equation shows: 18 cases, with t phones in each one, equals 26 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_11"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Entertainment Inc is going to use 3 crates to transport oranges across the country. The company needs to transport orange 101 oranges. Which equation, when solved, will tell how many oranges the company should put in each crate?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "3 x q = 101",
        "101 x q= 3",
        "101 - 3 = q",
        "3 + q = 101"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 101 oranges in total, 3 crates, and that the oranges will be shared equally between the crates.\nWe need to figure out how many oranges go in each crate. Let's use the variable q, to represent oranges in each crate."
        ],
        [
          "2/2",
          "So, if we multiply the number of crates by the number of oranges in each crate, we should get the total number of oranges.\nThat means: 3 x q = 101.\nThis equation shows: 3 crates, with q oranges in each one, equals 101 oranges in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_12"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Disney is is going to use 5 playlists to store songs across the country. The company needs to store 67 songs. Which equation, when solved, will tell how many songs the company should put in each playlist?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "67 x t= 5",
        "5 x t = 67",
        "67 - 5 = t",
        "5 + t = 67"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 67 songs in total, 5 playlists, and that the songs will be shared equally between the playlists.\nWe need to figure out how many songs go in each playlist. Let's use the variable t, to represent songs in each playlist."
        ],
        [
          "2/2",
          "So, if we multiply the number of playlists by the number of songs in each playlist, we should get the total number of songs.\nThat means: 5 x t = 67.\nThis equation shows: 5 playlists, with t songs in each one, equals 67 songs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_13"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Disney is is going to use 12 folders to store papers across the country. The company needs to store 135 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "135 x k= 12",
        "12 x k = 135",
        "135 - 12 = k",
        "12 + k = 135"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 135 papers in total, 12 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable k, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 12 x k = 135.\nThis equation shows: 12 folders, with k papers in each one, equals 135 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_14"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Xbox Games is going to use 13 containers to store cookies across the country. The company needs to store cookie 68 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "68 x j= 13",
        "68 - 13 = j",
        "13 + j = 68",
        "13 x j = 68"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 68 cookies in total, 13 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable j, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 13 x j = 68.\nThis equation shows: 13 containers, with j cookies in each one, equals 68 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_15"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Entertainment Inc is going to use 12 folders to organize papers across the country. The company needs to organize paper 39 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "39 x j= 12",
        "39 - 12 = j",
        "12 + j = 39",
        "12 x j = 39"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 39 papers in total, 12 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable j, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 12 x j = 39.\nThis equation shows: 12 folders, with j papers in each one, equals 39 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_16"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Pokemon Company is going to use 11 shelves to store books across the country. The company needs to store 67 books. Which equation, when solved, will tell how many books the company should put in each shelve?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "67 x r= 11",
        "67 - 11 = r",
        "11 x r = 67",
        "11 + r = 67"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 67 books in total, 11 shelves, and that the books will be shared equally between the shelves.\nWe need to figure out how many books go in each shelve. Let's use the variable r, to represent books in each shelve."
        ],
        [
          "2/2",
          "So, if we multiply the number of shelves by the number of books in each shelve, we should get the total number of books.\nThat means: 11 x r = 67.\nThis equation shows: 11 shelves, with r books in each one, equals 67 books in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_17"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Entertainment Inc is going to use 14 containers to store cookies across the country. The company needs to store cookie 110 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "110 x z= 14",
        "110 - 14 = z",
        "14 x z = 110",
        "14 + z = 110"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 110 cookies in total, 14 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable z, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 14 x z = 110.\nThis equation shows: 14 containers, with z cookies in each one, equals 110 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_18"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is is going to use 13 cases to store phones across the country. The company needs to store 191 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "191 x r= 13",
        "13 x r = 191",
        "191 - 13 = r",
        "13 + r = 191"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 191 phones in total, 13 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable r, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 13 x r = 191.\nThis equation shows: 13 cases, with r phones in each one, equals 191 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_19"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is going to use 12 cases to protect phones across the country. The company needs to protect phone 74 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "12 x n = 74",
        "74 x n= 12",
        "74 - 12 = n",
        "12 + n = 74"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 74 phones in total, 12 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable n, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 12 x n = 74.\nThis equation shows: 12 cases, with n phones in each one, equals 74 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_20"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Digital Media is going to use 12 groups to store members across the country. The company needs to store 172 members. Which equation, when solved, will tell how many members the company should put in each group?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "172 x r= 12",
        "12 x r = 172",
        "172 - 12 = r",
        "12 + r = 172"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 172 members in total, 12 groups, and that the members will be shared equally between the groups.\nWe need to figure out how many members go in each group. Let's use the variable r, to represent members in each group."
        ],
        [
          "2/2",
          "So, if we multiply the number of groups by the number of members in each group, we should get the total number of members.\nThat means: 12 x r = 172.\nThis equation shows: 12 groups, with r members in each one, equals 172 members in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_21"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Twitch Gaming is going to use 12 packages to deliver items across the country. The company needs to deliver item 162 items. Which equation, when solved, will tell how many items the company should put in each package?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "162 x e= 12",
        "162 - 12 = e",
        "12 + e = 162",
        "12 x e = 162"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 162 items in total, 12 packages, and that the items will be shared equally between the packages.\nWe need to figure out how many items go in each package. Let's use the variable e, to represent items in each package."
        ],
        [
          "2/2",
          "So, if we multiply the number of packages by the number of items in each package, we should get the total number of items.\nThat means: 12 x e = 162.\nThis equation shows: 12 packages, with e items in each one, equals 162 items in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_22"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is is going to use 19 teams to store players across the country. The company needs to store 108 players. Which equation, when solved, will tell how many players the company should put in each team?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "108 x m= 19",
        "19 x m = 108",
        "108 - 19 = m",
        "19 + m = 108"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 108 players in total, 19 teams, and that the players will be shared equally between the teams.\nWe need to figure out how many players go in each team. Let's use the variable m, to represent players in each team."
        ],
        [
          "2/2",
          "So, if we multiply the number of teams by the number of players in each team, we should get the total number of players.\nThat means: 19 x m = 108.\nThis equation shows: 19 teams, with m players in each one, equals 108 players in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_23"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "TikTok Creative is going to use 20 groups to store members across the country. The company needs to store 27 members. Which equation, when solved, will tell how many members the company should put in each group?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "20 x q = 27",
        "27 x q= 20",
        "27 - 20 = q",
        "20 + q = 27"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 27 members in total, 20 groups, and that the members will be shared equally between the groups.\nWe need to figure out how many members go in each group. Let's use the variable q, to represent members in each group."
        ],
        [
          "2/2",
          "So, if we multiply the number of groups by the number of members in each group, we should get the total number of members.\nThat means: 20 x q = 27.\nThis equation shows: 20 groups, with q members in each one, equals 27 members in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_24"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Xbox Games is going to use 19 classrooms to store desks across the country. The company needs to store 195 desks. Which equation, when solved, will tell how many desks the company should put in each classroom?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "195 x d= 19",
        "19 x d = 195",
        "195 - 19 = d",
        "19 + d = 195"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 195 desks in total, 19 classrooms, and that the desks will be shared equally between the classrooms.\nWe need to figure out how many desks go in each classroom. Let's use the variable d, to represent desks in each classroom."
        ],
        [
          "2/2",
          "So, if we multiply the number of classrooms by the number of desks in each classroom, we should get the total number of desks.\nThat means: 19 x d = 195.\nThis equation shows: 19 classrooms, with d desks in each one, equals 195 desks in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_25"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Toy Factory is going to use 6 cases to protect phones across the country. The company needs to protect phone 33 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "6 x d = 33",
        "33 x d= 6",
        "33 - 6 = d",
        "6 + d = 33"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 33 phones in total, 6 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable d, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 6 x d = 33.\nThis equation shows: 6 cases, with d phones in each one, equals 33 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_26"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Steam Games is going to use 17 jars to store candies across the country. The company needs to store 50 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "50 x v= 17",
        "50 - 17 = v",
        "17 x v = 50",
        "17 + v = 50"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 50 candies in total, 17 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable v, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 17 x v = 50.\nThis equation shows: 17 jars, with v candies in each one, equals 50 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_27"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Art Studio is going to use 5 boxes to ship toys across the country. The company needs to ship toy 66 toys. Which equation, when solved, will tell how many toys the company should put in each boxe?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "66 x m= 5",
        "66 - 5 = m",
        "5 x m = 66",
        "5 + m = 66"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 66 toys in total, 5 boxes, and that the toys will be shared equally between the boxes.\nWe need to figure out how many toys go in each boxe. Let's use the variable m, to represent toys in each boxe."
        ],
        [
          "2/2",
          "So, if we multiply the number of boxes by the number of toys in each boxe, we should get the total number of toys.\nThat means: 5 x m = 66.\nThis equation shows: 5 boxes, with m toys in each one, equals 66 toys in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_28"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Book Publisher is going to use 14 shelves to store books across the country. The company needs to store 43 books. Which equation, when solved, will tell how many books the company should put in each shelve?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "43 x g= 14",
        "14 x g = 43",
        "43 - 14 = g",
        "14 + g = 43"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 43 books in total, 14 shelves, and that the books will be shared equally between the shelves.\nWe need to figure out how many books go in each shelve. Let's use the variable g, to represent books in each shelve."
        ],
        [
          "2/2",
          "So, if we multiply the number of shelves by the number of books in each shelve, we should get the total number of books.\nThat means: 14 x g = 43.\nThis equation shows: 14 shelves, with g books in each one, equals 43 books in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_29"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Digital Media is going to use 18 containers to store cookies across the country. The company needs to store 171 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "18 x e = 171",
        "171 x e= 18",
        "171 - 18 = e",
        "18 + e = 171"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 171 cookies in total, 18 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable e, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 18 x e = 171.\nThis equation shows: 18 containers, with e cookies in each one, equals 171 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_30"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Amazon Prime is going to use 9 envelopes to store letters across the country. The company needs to store 171 letters. Which equation, when solved, will tell how many letters the company should put in each envelope?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "171 x v= 9",
        "171 - 9 = v",
        "9 + v = 171",
        "9 x v = 171"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 171 letters in total, 9 envelopes, and that the letters will be shared equally between the envelopes.\nWe need to figure out how many letters go in each envelope. Let's use the variable v, to represent letters in each envelope."
        ],
        [
          "2/2",
          "So, if we multiply the number of envelopes by the number of letters in each envelope, we should get the total number of letters.\nThat means: 9 x v = 171.\nThis equation shows: 9 envelopes, with v letters in each one, equals 171 letters in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_31"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Tech Corp is going to use 15 jars to store candies across the country. The company needs to store 33 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "33 x m= 15",
        "15 x m = 33",
        "33 - 15 = m",
        "15 + m = 33"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 33 candies in total, 15 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable m, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 15 x m = 33.\nThis equation shows: 15 jars, with m candies in each one, equals 33 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_32"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Production House is going to use 15 baskets to store eggs across the country. The company needs to store 168 eggs. Which equation, when solved, will tell how many eggs the company should put in each basket?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "168 x e= 15",
        "168 - 15 = e",
        "15 x e = 168",
        "15 + e = 168"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 168 eggs in total, 15 baskets, and that the eggs will be shared equally between the baskets.\nWe need to figure out how many eggs go in each basket. Let's use the variable e, to represent eggs in each basket."
        ],
        [
          "2/2",
          "So, if we multiply the number of baskets by the number of eggs in each basket, we should get the total number of eggs.\nThat means: 15 x e = 168.\nThis equation shows: 15 baskets, with e eggs in each one, equals 168 eggs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_33"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Nintendo is is going to use 13 playlists to store songs across the country. The company needs to store 92 songs. Which equation, when solved, will tell how many songs the company should put in each playlist?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "92 x c= 13",
        "13 x c = 92",
        "92 - 13 = c",
        "13 + c = 92"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 92 songs in total, 13 playlists, and that the songs will be shared equally between the playlists.\nWe need to figure out how many songs go in each playlist. Let's use the variable c, to represent songs in each playlist."
        ],
        [
          "2/2",
          "So, if we multiply the number of playlists by the number of songs in each playlist, we should get the total number of songs.\nThat means: 13 x c = 92.\nThis equation shows: 13 playlists, with c songs in each one, equals 92 songs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_34"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Crunchyroll is is going to use 4 teams to store players across the country. The company needs to store 75 players. Which equation, when solved, will tell how many players the company should put in each team?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "75 x s= 4",
        "75 - 4 = s",
        "4 + s = 75",
        "4 x s = 75"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 75 players in total, 4 teams, and that the players will be shared equally between the teams.\nWe need to figure out how many players go in each team. Let's use the variable s, to represent players in each team."
        ],
        [
          "2/2",
          "So, if we multiply the number of teams by the number of players in each team, we should get the total number of players.\nThat means: 4 x s = 75.\nThis equation shows: 4 teams, with s players in each one, equals 75 players in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_35"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Tech Corp is going to use 7 jars to store candies across the country. The company needs to store candie 123 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "123 x p= 7",
        "123 - 7 = p",
        "7 + p = 123",
        "7 x p = 123"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 123 candies in total, 7 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable p, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 7 x p = 123.\nThis equation shows: 7 jars, with p candies in each one, equals 123 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_36"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Amazon Prime is going to use 4 baskets to store eggs across the country. The company needs to store 26 eggs. Which equation, when solved, will tell how many eggs the company should put in each basket?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "26 x z= 4",
        "26 - 4 = z",
        "4 + z = 26",
        "4 x z = 26"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 26 eggs in total, 4 baskets, and that the eggs will be shared equally between the baskets.\nWe need to figure out how many eggs go in each basket. Let's use the variable z, to represent eggs in each basket."
        ],
        [
          "2/2",
          "So, if we multiply the number of baskets by the number of eggs in each basket, we should get the total number of eggs.\nThat means: 4 x z = 26.\nThis equation shows: 4 baskets, with z eggs in each one, equals 26 eggs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_37"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is going to use 18 baskets to hold eggs across the country. The company needs to hold egg 138 eggs. Which equation, when solved, will tell how many eggs the company should put in each basket?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "18 x j = 138",
        "138 x j= 18",
        "138 - 18 = j",
        "18 + j = 138"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 138 eggs in total, 18 baskets, and that the eggs will be shared equally between the baskets.\nWe need to figure out how many eggs go in each basket. Let's use the variable j, to represent eggs in each basket."
        ],
        [
          "2/2",
          "So, if we multiply the number of baskets by the number of eggs in each basket, we should get the total number of eggs.\nThat means: 18 x j = 138.\nThis equation shows: 18 baskets, with j eggs in each one, equals 138 eggs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_38"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Pixar is is going to use 4 folders to store papers across the country. The company needs to store 71 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "71 x p= 4",
        "71 - 4 = p",
        "4 + p = 71",
        "4 x p = 71"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 71 papers in total, 4 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable p, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 4 x p = 71.\nThis equation shows: 4 folders, with p papers in each one, equals 71 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_39"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Sony PlayStation is going to use 7 baskets to store eggs across the country. The company needs to store 101 eggs. Which equation, when solved, will tell how many eggs the company should put in each basket?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "101 x b= 7",
        "101 - 7 = b",
        "7 + b = 101",
        "7 x b = 101"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 101 eggs in total, 7 baskets, and that the eggs will be shared equally between the baskets.\nWe need to figure out how many eggs go in each basket. Let's use the variable b, to represent eggs in each basket."
        ],
        [
          "2/2",
          "So, if we multiply the number of baskets by the number of eggs in each basket, we should get the total number of eggs.\nThat means: 7 x b = 101.\nThis equation shows: 7 baskets, with b eggs in each one, equals 101 eggs in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_40"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "DC Comics is going to use 3 rows to store seats across the country. The company needs to store 115 seats. Which equation, when solved, will tell how many seats the company should put in each row?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "3 x r = 115",
        "115 x r= 3",
        "115 - 3 = r",
        "3 + r = 115"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 115 seats in total, 3 rows, and that the seats will be shared equally between the rows.\nWe need to figure out how many seats go in each row. Let's use the variable r, to represent seats in each row."
        ],
        [
          "2/2",
          "So, if we multiply the number of rows by the number of seats in each row, we should get the total number of seats.\nThat means: 3 x r = 115.\nThis equation shows: 3 rows, with r seats in each one, equals 115 seats in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_41"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Funimation is is going to use 12 folders to store papers across the country. The company needs to store 119 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "12 x y = 119",
        "119 x y= 12",
        "119 - 12 = y",
        "12 + y = 119"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 119 papers in total, 12 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable y, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 12 x y = 119.\nThis equation shows: 12 folders, with y papers in each one, equals 119 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_42"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Disney is is going to use 6 groups to store members across the country. The company needs to store 28 members. Which equation, when solved, will tell how many members the company should put in each group?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "28 x j= 6",
        "28 - 6 = j",
        "6 + j = 28",
        "6 x j = 28"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 28 members in total, 6 groups, and that the members will be shared equally between the groups.\nWe need to figure out how many members go in each group. Let's use the variable j, to represent members in each group."
        ],
        [
          "2/2",
          "So, if we multiply the number of groups by the number of members in each group, we should get the total number of members.\nThat means: 6 x j = 28.\nThis equation shows: 6 groups, with j members in each one, equals 28 members in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_43"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Twitch Gaming is going to use 7 folders to organize papers across the country. The company needs to organize paper 191 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "191 x y= 7",
        "191 - 7 = y",
        "7 x y = 191",
        "7 + y = 191"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 191 papers in total, 7 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable y, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 7 x y = 191.\nThis equation shows: 7 folders, with y papers in each one, equals 191 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_44"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Production House is going to use 9 cases to protect phones across the country. The company needs to protect phone 44 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "9 x b = 44",
        "44 x b= 9",
        "44 - 9 = b",
        "9 + b = 44"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 44 phones in total, 9 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable b, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 9 x b = 44.\nThis equation shows: 9 cases, with b phones in each one, equals 44 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_45"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Creative Studios is going to use 8 boxes to store toys across the country. The company needs to store 96 toys. Which equation, when solved, will tell how many toys the company should put in each boxe?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "96 x p= 8",
        "96 - 8 = p",
        "8 + p = 96",
        "8 x p = 96"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 96 toys in total, 8 boxes, and that the toys will be shared equally between the boxes.\nWe need to figure out how many toys go in each boxe. Let's use the variable p, to represent toys in each boxe."
        ],
        [
          "2/2",
          "So, if we multiply the number of boxes by the number of toys in each boxe, we should get the total number of toys.\nThat means: 8 x p = 96.\nThis equation shows: 8 boxes, with p toys in each one, equals 96 toys in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_46"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Entertainment Inc is going to use 17 folders to store papers across the country. The company needs to store 99 papers. Which equation, when solved, will tell how many papers the company should put in each folder?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "99 x g= 17",
        "99 - 17 = g",
        "17 + g = 99",
        "17 x g = 99"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 99 papers in total, 17 folders, and that the papers will be shared equally between the folders.\nWe need to figure out how many papers go in each folder. Let's use the variable g, to represent papers in each folder."
        ],
        [
          "2/2",
          "So, if we multiply the number of folders by the number of papers in each folder, we should get the total number of papers.\nThat means: 17 x g = 99.\nThis equation shows: 17 folders, with g papers in each one, equals 99 papers in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_47"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Production House is going to use 5 buses to store students across the country. The company needs to store 99 students. Which equation, when solved, will tell how many students the company should put in each buse?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "5 x n = 99",
        "99 x n= 5",
        "99 - 5 = n",
        "5 + n = 99"
      ],
      "correct_answers": [
        "A"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 99 students in total, 5 buses, and that the students will be shared equally between the buses.\nWe need to figure out how many students go in each buse. Let's use the variable n, to represent students in each buse."
        ],
        [
          "2/2",
          "So, if we multiply the number of buses by the number of students in each buse, we should get the total number of students.\nThat means: 5 x n = 99.\nThis equation shows: 5 buses, with n students in each one, equals 99 students in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_48"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "DC Comics is going to use 3 jars to store candies across the country. The company needs to store 178 candies. Which equation, when solved, will tell how many candies the company should put in each jar?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "178 x y= 3",
        "3 x y = 178",
        "178 - 3 = y",
        "3 + y = 178"
      ],
      "correct_answers": [
        "B"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 178 candies in total, 3 jars, and that the candies will be shared equally between the jars.\nWe need to figure out how many candies go in each jar. Let's use the variable y, to represent candies in each jar."
        ],
        [
          "2/2",
          "So, if we multiply the number of jars by the number of candies in each jar, we should get the total number of candies.\nThat means: 3 x y = 178.\nThis equation shows: 3 jars, with y candies in each one, equals 178 candies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_49"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Marvel Studios is going to use 9 cases to protect phones across the country. The company needs to protect phone 195 phones. Which equation, when solved, will tell how many phones the company should put in each case?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "195 x f= 9",
        "195 - 9 = f",
        "9 x f = 195",
        "9 + f = 195"
      ],
      "correct_answers": [
        "C"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 195 phones in total, 9 cases, and that the phones will be shared equally between the cases.\nWe need to figure out how many phones go in each case. Let's use the variable f, to represent phones in each case."
        ],
        [
          "2/2",
          "So, if we multiply the number of cases by the number of phones in each case, we should get the total number of phones.\nThat means: 9 x f = 195.\nThis equation shows: 9 cases, with f phones in each one, equals 195 phones in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_50"
    },
    {
      "skills": "write-variable-equations-to-represent-word-problems",
      "question_text": "Netflix is going to use 3 containers to store cookies across the country. The company needs to store cookie 97 cookies. Which equation, when solved, will tell how many cookies the company should put in each container?",
      "question_type": "Multiple Choice Question with Single Answer",
      "tag": "Gr4_39_E3",
      "choices": [
        "97 x x= 3",
        "97 - 3 = x",
        "3 + x = 97",
        "3 x x = 97"
      ],
      "correct_answers": [
        "D"
      ],
      "solution": [
        [
          "1/2",
          "We know that there are 97 cookies in total, 3 containers, and that the cookies will be shared equally between the containers.\nWe need to figure out how many cookies go in each container. Let's use the variable x, to represent cookies in each container."
        ],
        [
          "2/2",
          "So, if we multiply the number of containers by the number of cookies in each container, we should get the total number of cookies.\nThat means: 3 x x = 97.\nThis equation shows: 3 containers, with x cookies in each one, equals 97 cookies in total."
        ]
      ],
      "solution_image_tag": [],
      "question_number": "3_51"
    }
  ]
}