[
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n24 ÷ 5 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_1",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 24 dots divided into rows of 5 on the left side. There are 4 full rows and 4 dots left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 24 ÷ 5 = 4 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_1",
    "backend_description": "A division model showing 24 purple dots arranged to illustrate 24 ÷ 5. On the left side, there are 4 complete rows of 5 dots each (20 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n48 ÷ 4 = 12 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_2",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 48 dots divided into rows of 4 on the left side. There are 12 full rows and 0 dots left over on the right side.\nSince there are 12 full rows, the quotient is 12. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 48 ÷ 4 = 12 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_2",
    "backend_description": "A division model showing 48 purple dots arranged to illustrate 48 ÷ 4. The dots are arranged in 12 complete rows of 4 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n90 ÷ 7 = 12 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_3",
    "correct_answers": [
      "6"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 90 dots divided into rows of 7 on the left side. There are 12 full rows and 6 dots left over on the right side.\nSince there are 12 full rows, the quotient is 12. The 6 leftover dots tell you the remainder is 6."
      ],
      [
        "2/2",
        "So, 90 ÷ 7 = 12 with R 6."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_3",
    "backend_description": "A division model showing 90 purple dots arranged to illustrate 90 ÷ 7. On the left side, there are 12 complete rows of 7 dots each (84 dots total). On the right side, separated by a gap, are 6 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n57 ÷ 6 = 9 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_4",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 57 dots divided into rows of 6 on the left side. There are 9 full rows and 3 dots left over on the right side.\nSince there are 9 full rows, the quotient is 9. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 57 ÷ 6 = 9 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_4",
    "backend_description": "A division model showing 57 purple dots arranged to illustrate 57 ÷ 6. On the left side, there are 9 complete rows of 6 dots each (54 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n15 ÷ 3 = 5 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_5",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 15 dots divided into rows of 3 on the left side. There are 5 full rows and 0 dots left over on the right side.\nSince there are 5 full rows, the quotient is 5. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 15 ÷ 3 = 5 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_5",
    "backend_description": "A division model showing 15 purple dots arranged to illustrate 15 ÷ 3. The dots are arranged in 5 complete rows of 3 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n84 ÷ 8 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_6",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 84 dots divided into rows of 8 on the left side. There are 10 full rows and 4 dots left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 84 ÷ 8 = 10 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_6",
    "backend_description": "A division model showing 84 purple dots arranged to illustrate 84 ÷ 8. On the left side, there are 10 complete rows of 8 dots each (80 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 8, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n63 ÷ 6 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_7",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 63 dots divided into rows of 6 on the left side. There are 10 full rows and 3 dots left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 63 ÷ 6 = 10 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_7",
    "backend_description": "A division model showing 63 purple dots arranged to illustrate 63 ÷ 6. On the left side, there are 10 complete rows of 6 dots each (60 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n42 ÷ 8 = 5 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_8",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 42 dots divided into rows of 8 on the left side. There are 5 full rows and 2 dots left over on the right side.\nSince there are 5 full rows, the quotient is 5. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 42 ÷ 8 = 5 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_8",
    "backend_description": "A division model showing 42 purple dots arranged to illustrate 42 ÷ 8. On the left side, there are 5 complete rows of 8 dots each (40 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 8, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n27 ÷ 7 = 3 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_9",
    "correct_answers": [
      "6"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 27 dots divided into rows of 7 on the left side. There are 3 full rows and 6 dots left over on the right side.\nSince there are 3 full rows, the quotient is 3. The 6 leftover dots tell you the remainder is 6."
      ],
      [
        "2/2",
        "So, 27 ÷ 7 = 3 with R 6."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_9",
    "backend_description": "A division model showing 27 purple dots arranged to illustrate 27 ÷ 7. On the left side, there are 3 complete rows of 7 dots each (21 dots total). On the right side, separated by a gap, are 6 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n42 ÷ 5 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_10",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 42 dots divided into rows of 5 on the left side. There are 8 full rows and 2 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 42 ÷ 5 = 8 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_10",
    "backend_description": "A division model showing 42 purple dots arranged to illustrate 42 ÷ 5. On the left side, there are 8 complete rows of 5 dots each (40 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n91 ÷ 9 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_11",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 91 dots divided into rows of 9 on the left side. There are 10 full rows and 1 dot left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 91 ÷ 9 = 10 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_11",
    "backend_description": "A division model showing 91 purple dots arranged to illustrate 91 ÷ 9. On the left side, there are 10 complete rows of 9 dots each (90 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 9, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n35 ÷ 8 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_12",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 35 dots divided into rows of 8 on the left side. There are 4 full rows and 3 dots left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 35 ÷ 8 = 4 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_12",
    "backend_description": "A division model showing 35 purple dots arranged to illustrate 35 ÷ 8. On the left side, there are 4 complete rows of 8 dots each (32 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 8, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n38 ÷ 6 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_13",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 38 dots divided into rows of 6 on the left side. There are 6 full rows and 2 dots left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 38 ÷ 6 = 6 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_13",
    "backend_description": "A division model showing 38 purple dots arranged to illustrate 38 ÷ 6. On the left side, there are 6 complete rows of 6 dots each (36 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n60 ÷ 5 = 12 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_14",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 60 dots divided into rows of 5 on the left side. There are 12 full rows and 0 dots left over on the right side.\nSince there are 12 full rows, the quotient is 12. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 60 ÷ 5 = 12 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_14",
    "backend_description": "A division model showing 60 purple dots arranged to illustrate 60 ÷ 5. The dots are arranged in 12 complete rows of 5 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n55 ÷ 7 = 7 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_15",
    "correct_answers": [
      "6"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 55 dots divided into rows of 7 on the left side. There are 7 full rows and 6 dots left over on the right side.\nSince there are 7 full rows, the quotient is 7. The 6 leftover dots tell you the remainder is 6."
      ],
      [
        "2/2",
        "So, 55 ÷ 7 = 7 with R 6."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_15",
    "backend_description": "A division model showing 55 purple dots arranged to illustrate 55 ÷ 7. On the left side, there are 7 complete rows of 7 dots each (49 dots total). On the right side, separated by a gap, are 6 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n41 ÷ 5 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_16",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 41 dots divided into rows of 5 on the left side. There are 8 full rows and 1 dot left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 41 ÷ 5 = 8 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_16",
    "backend_description": "A division model showing 41 purple dots arranged to illustrate 41 ÷ 5. On the left side, there are 8 complete rows of 5 dots each (40 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n33 ÷ 6 = 5 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_17",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 33 dots divided into rows of 6 on the left side. There are 5 full rows and 3 dots left over on the right side.\nSince there are 5 full rows, the quotient is 5. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 33 ÷ 6 = 5 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_17",
    "backend_description": "A division model showing 33 purple dots arranged to illustrate 33 ÷ 6. On the left side, there are 5 complete rows of 6 dots each (30 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n66 ÷ 7 = 9 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_18",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 66 dots divided into rows of 7 on the left side. There are 9 full rows and 3 dots left over on the right side.\nSince there are 9 full rows, the quotient is 9. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 66 ÷ 7 = 9 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_18",
    "backend_description": "A division model showing 66 purple dots arranged to illustrate 66 ÷ 7. On the left side, there are 9 complete rows of 7 dots each (63 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n23 ÷ 7 = 3 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_19",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 23 dots divided into rows of 7 on the left side. There are 3 full rows and 2 dots left over on the right side.\nSince there are 3 full rows, the quotient is 3. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 23 ÷ 7 = 3 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_19",
    "backend_description": "A division model showing 23 purple dots arranged to illustrate 23 ÷ 7. On the left side, there are 3 complete rows of 7 dots each (21 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n33 ÷ 5 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_20",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 33 dots divided into rows of 5 on the left side. There are 6 full rows and 3 dots left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 33 ÷ 5 = 6 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_20",
    "backend_description": "A division model showing 33 purple dots arranged to illustrate 33 ÷ 5. On the left side, there are 6 complete rows of 5 dots each (30 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n70 ÷ 6 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_21",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 70 dots divided into rows of 6 on the left side. There are 11 full rows and 4 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 70 ÷ 6 = 11 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_21",
    "backend_description": "A division model showing 70 purple dots arranged to illustrate 70 ÷ 6. On the left side, there are 11 complete rows of 6 dots each (66 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n22 ÷ 3 = 7 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_22",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 22 dots divided into rows of 3 on the left side. There are 7 full rows and 1 dot left over on the right side.\nSince there are 7 full rows, the quotient is 7. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 22 ÷ 3 = 7 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_22",
    "backend_description": "A division model showing 22 purple dots arranged to illustrate 22 ÷ 3. On the left side, there are 7 complete rows of 3 dots each (21 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 3, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n56 ÷ 8 = 7 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_23",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 56 dots divided into rows of 8 on the left side. There are 7 full rows and 0 dots left over on the right side.\nSince there are 7 full rows, the quotient is 7. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 56 ÷ 8 = 7 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_23",
    "backend_description": "A division model showing 56 purple dots arranged to illustrate 56 ÷ 8. The dots are arranged in 7 complete rows of 8 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n59 ÷ 5 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_24",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 59 dots divided into rows of 5 on the left side. There are 11 full rows and 4 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 59 ÷ 5 = 11 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_24",
    "backend_description": "A division model showing 59 purple dots arranged to illustrate 59 ÷ 5. On the left side, there are 11 complete rows of 5 dots each (55 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n47 ÷ 4 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_25",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 47 dots divided into rows of 4 on the left side. There are 11 full rows and 3 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 47 ÷ 4 = 11 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_25",
    "backend_description": "A division model showing 47 purple dots arranged to illustrate 47 ÷ 4. On the left side, there are 11 complete rows of 4 dots each (44 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 4, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n21 ÷ 3 = 7 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_26",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 21 dots divided into rows of 3 on the left side. There are 7 full rows and 0 dots left over on the right side.\nSince there are 7 full rows, the quotient is 7. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 21 ÷ 3 = 7 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_26",
    "backend_description": "A division model showing 21 purple dots arranged to illustrate 21 ÷ 3. The dots are arranged in 7 complete rows of 3 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n30 ÷ 5 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_27",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 30 dots divided into rows of 5 on the left side. There are 6 full rows and 0 dots left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 30 ÷ 5 = 6 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_27",
    "backend_description": "A division model showing 30 purple dots arranged to illustrate 30 ÷ 5. The dots are arranged in 6 complete rows of 5 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n32 ÷ 5 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_28",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 32 dots divided into rows of 5 on the left side. There are 6 full rows and 2 dots left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 32 ÷ 5 = 6 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_28",
    "backend_description": "A division model showing 32 purple dots arranged to illustrate 32 ÷ 5. On the left side, there are 6 complete rows of 5 dots each (30 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n61 ÷ 6 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_29",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 61 dots divided into rows of 6 on the left side. There are 10 full rows and 1 dot left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 61 ÷ 6 = 10 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_29",
    "backend_description": "A division model showing 61 purple dots arranged to illustrate 61 ÷ 6. On the left side, there are 10 complete rows of 6 dots each (60 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n47 ÷ 5 = 9 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_30",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 47 dots divided into rows of 5 on the left side. There are 9 full rows and 2 dots left over on the right side.\nSince there are 9 full rows, the quotient is 9. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 47 ÷ 5 = 9 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_30",
    "backend_description": "A division model showing 47 purple dots arranged to illustrate 47 ÷ 5. On the left side, there are 9 complete rows of 5 dots each (45 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n18 ÷ 3 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_31",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 18 dots divided into rows of 3 on the left side. There are 6 full rows and 0 dots left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 18 ÷ 3 = 6 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_31",
    "backend_description": "A division model showing 18 purple dots arranged to illustrate 18 ÷ 3. The dots are arranged in 6 complete rows of 3 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n26 ÷ 3 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_32",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 26 dots divided into rows of 3 on the left side. There are 8 full rows and 2 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 26 ÷ 3 = 8 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_32",
    "backend_description": "A division model showing 26 purple dots arranged to illustrate 26 ÷ 3. On the left side, there are 8 complete rows of 3 dots each (24 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 3, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n51 ÷ 6 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_33",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 51 dots divided into rows of 6 on the left side. There are 8 full rows and 3 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 51 ÷ 6 = 8 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_33",
    "backend_description": "A division model showing 51 purple dots arranged to illustrate 51 ÷ 6. On the left side, there are 8 complete rows of 6 dots each (48 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n42 ÷ 4 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_34",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 42 dots divided into rows of 4 on the left side. There are 10 full rows and 2 dots left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 42 ÷ 4 = 10 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_34",
    "backend_description": "A division model showing 42 purple dots arranged to illustrate 42 ÷ 4. On the left side, there are 10 complete rows of 4 dots each (40 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 4, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n25 ÷ 4 = 6 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_35",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 25 dots divided into rows of 4 on the left side. There are 6 full rows and 1 dot left over on the right side.\nSince there are 6 full rows, the quotient is 6. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 25 ÷ 4 = 6 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_35",
    "backend_description": "A division model showing 25 purple dots arranged to illustrate 25 ÷ 4. On the left side, there are 6 complete rows of 4 dots each (24 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 4, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n29 ÷ 7 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_36",
    "correct_answers": [
      "1"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 29 dots divided into rows of 7 on the left side. There are 4 full rows and 1 dot left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 1 leftover dot tells you the remainder is 1."
      ],
      [
        "2/2",
        "So, 29 ÷ 7 = 4 with R 1."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_36",
    "backend_description": "A division model showing 29 purple dots arranged to illustrate 29 ÷ 7. On the left side, there are 4 complete rows of 7 dots each (28 dots total). On the right side, separated by a gap, is 1 remaining dot that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n29 ÷ 3 = 9 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_37",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 29 dots divided into rows of 3 on the left side. There are 9 full rows and 2 dots left over on the right side.\nSince there are 9 full rows, the quotient is 9. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 29 ÷ 3 = 9 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_37",
    "backend_description": "A division model showing 29 purple dots arranged to illustrate 29 ÷ 3. On the left side, there are 9 complete rows of 3 dots each (27 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 3, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n47 ÷ 6 = 7 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_38",
    "correct_answers": [
      "5"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 47 dots divided into rows of 6 on the left side. There are 7 full rows and 5 dots left over on the right side.\nSince there are 7 full rows, the quotient is 7. The 5 leftover dots tell you the remainder is 5."
      ],
      [
        "2/2",
        "So, 47 ÷ 6 = 7 with R 5."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_38",
    "backend_description": "A division model showing 47 purple dots arranged to illustrate 47 ÷ 6. On the left side, there are 7 complete rows of 6 dots each (42 dots total). On the right side, separated by a gap, are 5 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n57 ÷ 5 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_39",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 57 dots divided into rows of 5 on the left side. There are 11 full rows and 2 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 57 ÷ 5 = 11 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_39",
    "backend_description": "A division model showing 57 purple dots arranged to illustrate 57 ÷ 5. On the left side, there are 11 complete rows of 5 dots each (55 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n29 ÷ 6 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_40",
    "correct_answers": [
      "5"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 29 dots divided into rows of 6 on the left side. There are 4 full rows and 5 dots left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 5 leftover dots tell you the remainder is 5."
      ],
      [
        "2/2",
        "So, 29 ÷ 6 = 4 with R 5."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_40",
    "backend_description": "A division model showing 29 purple dots arranged to illustrate 29 ÷ 6. On the left side, there are 4 complete rows of 6 dots each (24 dots total). On the right side, separated by a gap, are 5 remaining dots that cannot form a complete row of 6, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n60 ÷ 7 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_41",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 60 dots divided into rows of 7 on the left side. There are 8 full rows and 4 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 60 ÷ 7 = 8 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_41",
    "backend_description": "A division model showing 60 purple dots arranged to illustrate 60 ÷ 7. On the left side, there are 8 complete rows of 7 dots each (56 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n36 ÷ 4 = 9 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_42",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 36 dots divided into rows of 4 on the left side. There are 9 full rows and 0 dots left over on the right side.\nSince there are 9 full rows, the quotient is 9. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 36 ÷ 4 = 9 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_42",
    "backend_description": "A division model showing 36 purple dots arranged to illustrate 36 ÷ 4. The dots are arranged in 9 complete rows of 4 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n32 ÷ 4 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_43",
    "correct_answers": [
      "0"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 32 dots divided into rows of 4 on the left side. There are 8 full rows and 0 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 0 leftover dots tell you the remainder is 0."
      ],
      [
        "2/2",
        "So, 32 ÷ 4 = 8 with R 0."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_43",
    "backend_description": "A division model showing 32 purple dots arranged to illustrate 32 ÷ 4. The dots are arranged in 8 complete rows of 4 dots each, with no remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n72 ÷ 7 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_44",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 72 dots divided into rows of 7 on the left side. There are 10 full rows and 2 dots left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 72 ÷ 7 = 10 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_44",
    "backend_description": "A division model showing 72 purple dots arranged to illustrate 72 ÷ 7. On the left side, there are 10 complete rows of 7 dots each (70 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n92 ÷ 8 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_45",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 92 dots divided into rows of 8 on the left side. There are 11 full rows and 4 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 92 ÷ 8 = 11 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_45",
    "backend_description": "A division model showing 92 purple dots arranged to illustrate 92 ÷ 8. On the left side, there are 11 complete rows of 8 dots each (88 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 8, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n79 ÷ 9 = 8 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_46",
    "correct_answers": [
      "7"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 79 dots divided into rows of 9 on the left side. There are 8 full rows and 7 dots left over on the right side.\nSince there are 8 full rows, the quotient is 8. The 7 leftover dots tell you the remainder is 7."
      ],
      [
        "2/2",
        "So, 79 ÷ 9 = 8 with R 7."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_46",
    "backend_description": "A division model showing 79 purple dots arranged to illustrate 79 ÷ 9. On the left side, there are 8 complete rows of 9 dots each (72 dots total). On the right side, separated by a gap, are 7 remaining dots that cannot form a complete row of 9, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n28 ÷ 5 = 5 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_47",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 28 dots divided into rows of 5 on the left side. There are 5 full rows and 3 dots left over on the right side.\nSince there are 5 full rows, the quotient is 5. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 28 ÷ 5 = 5 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_47",
    "backend_description": "A division model showing 28 purple dots arranged to illustrate 28 ÷ 5. On the left side, there are 5 complete rows of 5 dots each (25 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 5, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n31 ÷ 7 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_48",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 31 dots divided into rows of 7 on the left side. There are 4 full rows and 3 dots left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 31 ÷ 7 = 4 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_48",
    "backend_description": "A division model showing 31 purple dots arranged to illustrate 31 ÷ 7. On the left side, there are 4 complete rows of 7 dots each (28 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n79 ÷ 7 = 11 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_49",
    "correct_answers": [
      "2"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 79 dots divided into rows of 7 on the left side. There are 11 full rows and 2 dots left over on the right side.\nSince there are 11 full rows, the quotient is 11. The 2 leftover dots tell you the remainder is 2."
      ],
      [
        "2/2",
        "So, 79 ÷ 7 = 11 with R 2."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_49",
    "backend_description": "A division model showing 79 purple dots arranged to illustrate 79 ÷ 7. On the left side, there are 11 complete rows of 7 dots each (77 dots total). On the right side, separated by a gap, are 2 remaining dots that cannot form a complete row of 7, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n43 ÷ 4 = 10 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_50",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 43 dots divided into rows of 4 on the left side. There are 10 full rows and 3 dots left over on the right side.\nSince there are 10 full rows, the quotient is 10. The 3 leftover dots tell you the remainder is 3."
      ],
      [
        "2/2",
        "So, 43 ÷ 4 = 10 with R 3."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_50",
    "backend_description": "A division model showing 43 purple dots arranged to illustrate 43 ÷ 4. On the left side, there are 10 complete rows of 4 dots each (40 dots total). On the right side, separated by a gap, are 3 remaining dots that cannot form a complete row of 4, representing the remainder."
  },
  {
    "skills": "divide-using-arrays",
    "question_text": "Use the model to complete the division sentence.\n28 ÷ 6 = 4 R __",
    "question_type": "Fill in the blank",
    "tag": "Gr4_29_E1",
    "image_tag": "Gr4_29_1_51",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/2",
        "The model shows 28 dots divided into rows of 6 on the left side. There are 4 full rows and 4 dots left over on the right side.\nSince there are 4 full rows, the quotient is 4. The 4 leftover dots tell you the remainder is 4."
      ],
      [
        "2/2",
        "So, 28 ÷ 6 = 4 with R 4."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "1_51",
    "backend_description": "A division model showing 28 purple dots arranged to illustrate 28 ÷ 6. On the left side, there are 4 complete rows of 6 dots each (24 dots total). On the right side, separated by a gap, are 4 remaining dots that cannot form a complete row of 6, representing the remainder."
  }
]