[
  {
    "question_text": "Sunrise Diner is the most popular lunch spot on Highway 5. They have p pancake meals and 13 waffle meals on today's menu. There are 29 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_1_A",
      "Gr5_36_1_1_B",
      "Gr5_36_1_1_C",
      "Gr5_36_1_1_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'p' representing pancake meals, and the right section is labeled '13' representing waffle meals. The total length of the rectangle is labeled '29' at the top, showing that p+13=29.",
      "A bar diagram showing a rectangle with the total labeled '29' at the top. Inside, the left section shows 'p' and the right section shows '13', visually representing the equation p+13=29 where pancake meals plus waffle meals equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about pancake meals and waffle meals totaling 29."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Sunrise Diner is the most popular lunch spot on Highway 5. They have p pancake meals and 13 waffle meals on today's menu. There are 29 items on their menu in total."
      ],
      [
        "3/6",
        "There are p pancake meals and 13 waffle meals. There are 29 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation p+13=29 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_1_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'p' (representing pancake meals) and the right section labeled '13' (representing waffle meals). The total length is labeled '29' at the top, clearly demonstrating that p+13=29."
      ]
    ],
    "question_number": "1_1"
  },
  {
    "question_text": "Chloe creates art supply packages for the elementary school. He needs to make 8 packages for the art program. It takes c crayons to make each package, so Chloe needs a total of 16 crayons.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_2_A",
      "Gr5_36_1_2_B",
      "Gr5_36_1_2_C",
      "Gr5_36_1_2_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 8 equal sections, each labeled 'c' to represent the number of crayons needed for each package. The total length of the diagram is labeled '16' at the top, visually demonstrating that 8 groups of c crayons equals 16 total crayons, representing the equation 8c=16.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about packages.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 8 packages with c crayons each.",
      "A bar diagram that fails to properly illustrate the relationship between 8 packages, c crayons per package, and 16 total crayons."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about crayons."
      ],
      [
        "2/6",
        "Chloe creates art supply packages for the elementary school. He needs to make 8 packages for the art program. It takes c crayons to make each package, so Chloe needs a total of 16 crayons."
      ],
      [
        "3/6",
        "Chloe needs to make 8 packages. It takes c crayons to make each package. Chloe needs a total of 16 crayons."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 8×c can also be written as 8c. So, the equation 8c=16 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_2_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 8 equal sections, each labeled 'c' to represent the number of crayons needed for one package. The total length is labeled '16' at the top, clearly demonstrating that 8 × c = 16 or 8c=16."
      ]
    ],
    "question_number": "1_2"
  },
  {
    "question_text": "Starlight Cinema is the most popular lunch spot in the entertainment district. They have e evening shows and 23 matinee shows on today's menu. There are 32 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_3_A",
      "Gr5_36_1_3_B",
      "Gr5_36_1_3_C",
      "Gr5_36_1_3_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'e' representing evening shows, and the right section is labeled '23' representing matinee shows. The total length of the rectangle is labeled '32' at the top, showing that e+23=32.",
      "A bar diagram showing a rectangle with the total labeled '32' at the top. Inside, the left section shows 'e' and the right section shows '23', visually representing the equation e+23=32 where evening shows plus matinee shows equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about evening shows and matinee shows totaling 32."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Starlight Cinema is the most popular lunch spot in the entertainment district. They have e evening shows and 23 matinee shows on today's menu. There are 32 items on their menu in total."
      ],
      [
        "3/6",
        "There are e evening shows and 23 matinee shows. There are 32 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation e+23=32 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_3_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'e' (representing evening shows) and the right section labeled '23' (representing matinee shows). The total length is labeled '32' at the top, clearly demonstrating that e+23=32."
      ]
    ],
    "question_number": "1_3"
  },
  {
    "question_text": "Ethan builds robot prototypes for the robotics competition. He needs to make 6 robots for the state finals. It takes m motors to make each robot, so Ethan needs a total of 42 motors.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_4_A",
      "Gr5_36_1_4_B",
      "Gr5_36_1_4_C",
      "Gr5_36_1_4_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 6 equal sections, each labeled 'm' to represent the number of motors needed for each robot. The total length of the diagram is labeled '42' at the top, visually demonstrating that 6 groups of m motors equals 42 total motors, representing the equation 6m=42.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about robots.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 6 robots with m motors each.",
      "A bar diagram that fails to properly illustrate the relationship between 6 robots, m motors per robot, and 42 total motors."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about motors."
      ],
      [
        "2/6",
        "Ethan builds robot prototypes for the robotics competition. He needs to make 6 robots for the state finals. It takes m motors to make each robot, so Ethan needs a total of 42 motors."
      ],
      [
        "3/6",
        "Ethan needs to make 6 robots. It takes m motors to make each robot. Ethan needs a total of 42 motors."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 6×m can also be written as 6m. So, the equation 6m=42 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_4_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 6 equal sections, each labeled 'm' to represent the number of motors needed for one robot. The total length is labeled '42' at the top, clearly demonstrating that 6 × m = 42 or 6m=42."
      ]
    ],
    "question_number": "1_4"
  },
  {
    "question_text": "Adventure Gear Outfitters is the most popular lunch spot near the national park. They have h hiking boots and 11 running shoes on today's menu. There are 32 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_5_A",
      "Gr5_36_1_5_B",
      "Gr5_36_1_5_C",
      "Gr5_36_1_5_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'h' representing hiking boots, and the right section is labeled '11' representing running shoes. The total length of the rectangle is labeled '32' at the top, showing that h+11=32.",
      "A bar diagram showing a rectangle with the total labeled '32' at the top. Inside, the left section shows 'h' and the right section shows '11', visually representing the equation h+11=32 where hiking boots plus running shoes equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about hiking boots and running shoes totaling 32."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Adventure Gear Outfitters is the most popular lunch spot near the national park. They have h hiking boots and 11 running shoes on today's menu. There are 32 items on their menu in total."
      ],
      [
        "3/6",
        "There are h hiking boots and 11 running shoes. There are 32 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation h+11=32 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_5_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'h' (representing hiking boots) and the right section labeled '11' (representing running shoes). The total length is labeled '32' at the top, clearly demonstrating that h+11=32."
      ]
    ],
    "question_number": "1_5"
  },
  {
    "question_text": "Owen builds mini libraries for the literacy program. He needs to make 10 libraries for Reading Week. It takes b books to make each librarie, so Owen needs a total of 20 books.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_6_A",
      "Gr5_36_1_6_B",
      "Gr5_36_1_6_C",
      "Gr5_36_1_6_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 10 equal sections, each labeled 'b' to represent the number of books needed for each librarie. The total length of the diagram is labeled '20' at the top, visually demonstrating that 10 groups of b books equals 20 total books, representing the equation 10b=20.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about libraries.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 10 libraries with b books each.",
      "A bar diagram that fails to properly illustrate the relationship between 10 libraries, b books per librarie, and 20 total books."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about books."
      ],
      [
        "2/6",
        "Owen builds mini libraries for the literacy program. He needs to make 10 libraries for Reading Week. It takes b books to make each librarie, so Owen needs a total of 20 books."
      ],
      [
        "3/6",
        "Owen needs to make 10 libraries. It takes b books to make each librarie. Owen needs a total of 20 books."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 10×b can also be written as 10b. So, the equation 10b=20 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_6_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 10 equal sections, each labeled 'b' to represent the number of books needed for one librarie. The total length is labeled '20' at the top, clearly demonstrating that 10 × b = 20 or 10b=20."
      ]
    ],
    "question_number": "1_6"
  },
  {
    "question_text": "Melody Music Store is the most popular lunch spot in the music district. They have g guitar lessons and 19 piano lessons on today's menu. There are 51 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_7_A",
      "Gr5_36_1_7_B",
      "Gr5_36_1_7_C",
      "Gr5_36_1_7_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'g' representing guitar lessons, and the right section is labeled '19' representing piano lessons. The total length of the rectangle is labeled '51' at the top, showing that g+19=51.",
      "A bar diagram showing a rectangle with the total labeled '51' at the top. Inside, the left section shows 'g' and the right section shows '19', visually representing the equation g+19=51 where guitar lessons plus piano lessons equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about guitar lessons and piano lessons totaling 51."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Melody Music Store is the most popular lunch spot in the music district. They have g guitar lessons and 19 piano lessons on today's menu. There are 51 items on their menu in total."
      ],
      [
        "3/6",
        "There are g guitar lessons and 19 piano lessons. There are 51 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation g+19=51 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_7_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'g' (representing guitar lessons) and the right section labeled '19' (representing piano lessons). The total length is labeled '51' at the top, clearly demonstrating that g+19=51."
      ]
    ],
    "question_number": "1_7"
  },
  {
    "question_text": "Grace assembles emergency kits for the Red Cross. He needs to make 5 kits for disaster preparedness week. It takes b bandages to make each kit, so Grace needs a total of 15 bandages.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_8_A",
      "Gr5_36_1_8_B",
      "Gr5_36_1_8_C",
      "Gr5_36_1_8_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 5 equal sections, each labeled 'b' to represent the number of bandages needed for each kit. The total length of the diagram is labeled '15' at the top, visually demonstrating that 5 groups of b bandages equals 15 total bandages, representing the equation 5b=15.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about kits.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 5 kits with b bandages each.",
      "A bar diagram that fails to properly illustrate the relationship between 5 kits, b bandages per kit, and 15 total bandages."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about bandages."
      ],
      [
        "2/6",
        "Grace assembles emergency kits for the Red Cross. He needs to make 5 kits for disaster preparedness week. It takes b bandages to make each kit, so Grace needs a total of 15 bandages."
      ],
      [
        "3/6",
        "Grace needs to make 5 kits. It takes b bandages to make each kit. Grace needs a total of 15 bandages."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 5×b can also be written as 5b. So, the equation 5b=15 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_8_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 5 equal sections, each labeled 'b' to represent the number of bandages needed for one kit. The total length is labeled '15' at the top, clearly demonstrating that 5 × b = 15 or 5b=15."
      ]
    ],
    "question_number": "1_8"
  },
  {
    "question_text": "Vintage Vinyl Records is the most popular lunch spot on Retro Street. They have r rock albums and 22 jazz albums on today's menu. There are 40 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_9_A",
      "Gr5_36_1_9_B",
      "Gr5_36_1_9_C",
      "Gr5_36_1_9_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'r' representing rock albums, and the right section is labeled '22' representing jazz albums. The total length of the rectangle is labeled '40' at the top, showing that r+22=40.",
      "A bar diagram showing a rectangle with the total labeled '40' at the top. Inside, the left section shows 'r' and the right section shows '22', visually representing the equation r+22=40 where rock albums plus jazz albums equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about rock albums and jazz albums totaling 40."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Vintage Vinyl Records is the most popular lunch spot on Retro Street. They have r rock albums and 22 jazz albums on today's menu. There are 40 items on their menu in total."
      ],
      [
        "3/6",
        "There are r rock albums and 22 jazz albums. There are 40 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation r+22=40 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_9_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'r' (representing rock albums) and the right section labeled '22' (representing jazz albums). The total length is labeled '40' at the top, clearly demonstrating that r+22=40."
      ]
    ],
    "question_number": "1_9"
  },
  {
    "question_text": "Harper creates activity kits for children's hospital. He needs to make 13 kits for the patient care program. It takes c coloring books to make each kit, so Harper needs a total of 104 coloring books.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_10_A",
      "Gr5_36_1_10_B",
      "Gr5_36_1_10_C",
      "Gr5_36_1_10_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 'c' to represent the number of coloring books needed for each kit. The total length of the diagram is labeled '104' at the top, visually demonstrating that 13 groups of c coloring books equals 104 total coloring books, representing the equation 13c=104.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about kits.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 kits with c coloring books each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 kits, c coloring books per kit, and 104 total coloring books."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about coloring books."
      ],
      [
        "2/6",
        "Harper creates activity kits for children's hospital. He needs to make 13 kits for the patient care program. It takes c coloring books to make each kit, so Harper needs a total of 104 coloring books."
      ],
      [
        "3/6",
        "Harper needs to make 13 kits. It takes c coloring books to make each kit. Harper needs a total of 104 coloring books."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×c can also be written as 13c. So, the equation 13c=104 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_10_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 'c' to represent the number of coloring books needed for one kit. The total length is labeled '104' at the top, clearly demonstrating that 13 × c = 104 or 13c=104."
      ]
    ],
    "question_number": "1_10"
  },
  {
    "question_text": "Mountain Peak Lodge is the most popular lunch spot in the mountains. They have s single rooms and 10 double rooms on today's menu. There are 29 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_11_A",
      "Gr5_36_1_11_B",
      "Gr5_36_1_11_C",
      "Gr5_36_1_11_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 's' representing single rooms, and the right section is labeled '10' representing double rooms. The total length of the rectangle is labeled '29' at the top, showing that s+10=29.",
      "A bar diagram showing a rectangle with the total labeled '29' at the top. Inside, the left section shows 's' and the right section shows '10', visually representing the equation s+10=29 where single rooms plus double rooms equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about single rooms and double rooms totaling 29."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Mountain Peak Lodge is the most popular lunch spot in the mountains. They have s single rooms and 10 double rooms on today's menu. There are 29 items on their menu in total."
      ],
      [
        "3/6",
        "There are s single rooms and 10 double rooms. There are 29 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation s+10=29 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_11_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 's' (representing single rooms) and the right section labeled '10' (representing double rooms). The total length is labeled '29' at the top, clearly demonstrating that s+10=29."
      ]
    ],
    "question_number": "1_11"
  },
  {
    "question_text": "Olivia creates birthday party favor bags. He needs to make 8 bags for her sister's party. It takes s stickers to make each bag, so Olivia needs a total of 56 stickers.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_12_A",
      "Gr5_36_1_12_B",
      "Gr5_36_1_12_C",
      "Gr5_36_1_12_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 8 equal sections, each labeled 's' to represent the number of stickers needed for each bag. The total length of the diagram is labeled '56' at the top, visually demonstrating that 8 groups of s stickers equals 56 total stickers, representing the equation 8s=56.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about bags.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 8 bags with s stickers each.",
      "A bar diagram that fails to properly illustrate the relationship between 8 bags, s stickers per bag, and 56 total stickers."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about stickers."
      ],
      [
        "2/6",
        "Olivia creates birthday party favor bags. He needs to make 8 bags for her sister's party. It takes s stickers to make each bag, so Olivia needs a total of 56 stickers."
      ],
      [
        "3/6",
        "Olivia needs to make 8 bags. It takes s stickers to make each bag. Olivia needs a total of 56 stickers."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 8×s can also be written as 8s. So, the equation 8s=56 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_12_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 8 equal sections, each labeled 's' to represent the number of stickers needed for one bag. The total length is labeled '56' at the top, clearly demonstrating that 8 × s = 56 or 8s=56."
      ]
    ],
    "question_number": "1_12"
  },
  {
    "question_text": "Tech Repair Shop is the most popular lunch spot near the mall. They have p phone repairs and 13 laptop repairs on today's menu. There are 36 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_13_A",
      "Gr5_36_1_13_B",
      "Gr5_36_1_13_C",
      "Gr5_36_1_13_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'p' representing phone repairs, and the right section is labeled '13' representing laptop repairs. The total length of the rectangle is labeled '36' at the top, showing that p+13=36.",
      "A bar diagram showing a rectangle with the total labeled '36' at the top. Inside, the left section shows 'p' and the right section shows '13', visually representing the equation p+13=36 where phone repairs plus laptop repairs equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about phone repairs and laptop repairs totaling 36."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Tech Repair Shop is the most popular lunch spot near the mall. They have p phone repairs and 13 laptop repairs on today's menu. There are 36 items on their menu in total."
      ],
      [
        "3/6",
        "There are p phone repairs and 13 laptop repairs. There are 36 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation p+13=36 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_13_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'p' (representing phone repairs) and the right section labeled '13' (representing laptop repairs). The total length is labeled '36' at the top, clearly demonstrating that p+13=36."
      ]
    ],
    "question_number": "1_13"
  },
  {
    "question_text": "Jake creates photo albums for family reunions. He needs to make 6 albums for the Wilson family reunion. It takes p photos to make each album, so Jake needs a total of 24 photos.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_14_A",
      "Gr5_36_1_14_B",
      "Gr5_36_1_14_C",
      "Gr5_36_1_14_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 6 equal sections, each labeled 'p' to represent the number of photos needed for each album. The total length of the diagram is labeled '24' at the top, visually demonstrating that 6 groups of p photos equals 24 total photos, representing the equation 6p=24.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about albums.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 6 albums with p photos each.",
      "A bar diagram that fails to properly illustrate the relationship between 6 albums, p photos per album, and 24 total photos."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about photos."
      ],
      [
        "2/6",
        "Jake creates photo albums for family reunions. He needs to make 6 albums for the Wilson family reunion. It takes p photos to make each album, so Jake needs a total of 24 photos."
      ],
      [
        "3/6",
        "Jake needs to make 6 albums. It takes p photos to make each album. Jake needs a total of 24 photos."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 6×p can also be written as 6p. So, the equation 6p=24 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_14_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 6 equal sections, each labeled 'p' to represent the number of photos needed for one album. The total length is labeled '24' at the top, clearly demonstrating that 6 × p = 24 or 6p=24."
      ]
    ],
    "question_number": "1_14"
  },
  {
    "question_text": "Memory Lane Antiques is the most popular lunch spot on Historic Avenue. They have v vintage chairs and 11 modern chairs on today's menu. There are 33 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_15_A",
      "Gr5_36_1_15_B",
      "Gr5_36_1_15_C",
      "Gr5_36_1_15_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'v' representing vintage chairs, and the right section is labeled '11' representing modern chairs. The total length of the rectangle is labeled '33' at the top, showing that v+11=33.",
      "A bar diagram showing a rectangle with the total labeled '33' at the top. Inside, the left section shows 'v' and the right section shows '11', visually representing the equation v+11=33 where vintage chairs plus modern chairs equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about vintage chairs and modern chairs totaling 33."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Memory Lane Antiques is the most popular lunch spot on Historic Avenue. They have v vintage chairs and 11 modern chairs on today's menu. There are 33 items on their menu in total."
      ],
      [
        "3/6",
        "There are v vintage chairs and 11 modern chairs. There are 33 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation v+11=33 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_15_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'v' (representing vintage chairs) and the right section labeled '11' (representing modern chairs). The total length is labeled '33' at the top, clearly demonstrating that v+11=33."
      ]
    ],
    "question_number": "1_15"
  },
  {
    "question_text": "Alex designs jewelry sets for the craft fair. He needs to make 10 necklaces for the upcoming fair. It takes b beads to make each necklace, so Alex needs a total of 110 beads.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_16_A",
      "Gr5_36_1_16_B",
      "Gr5_36_1_16_C",
      "Gr5_36_1_16_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 10 equal sections, each labeled 'b' to represent the number of beads needed for each necklace. The total length of the diagram is labeled '110' at the top, visually demonstrating that 10 groups of b beads equals 110 total beads, representing the equation 10b=110.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about necklaces.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 10 necklaces with b beads each.",
      "A bar diagram that fails to properly illustrate the relationship between 10 necklaces, b beads per necklace, and 110 total beads."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about beads."
      ],
      [
        "2/6",
        "Alex designs jewelry sets for the craft fair. He needs to make 10 necklaces for the upcoming fair. It takes b beads to make each necklace, so Alex needs a total of 110 beads."
      ],
      [
        "3/6",
        "Alex needs to make 10 necklaces. It takes b beads to make each necklace. Alex needs a total of 110 beads."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 10×b can also be written as 10b. So, the equation 10b=110 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_16_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 10 equal sections, each labeled 'b' to represent the number of beads needed for one necklace. The total length is labeled '110' at the top, clearly demonstrating that 10 × b = 110 or 10b=110."
      ]
    ],
    "question_number": "1_16"
  },
  {
    "question_text": "Maya's Pizza Palace is the most popular lunch spot downtown. They have c cheese pizzas and 3 pepperoni pizzas on today's menu. There are 28 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_17_A",
      "Gr5_36_1_17_B",
      "Gr5_36_1_17_C",
      "Gr5_36_1_17_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'c' representing cheese pizzas, and the right section is labeled '3' representing pepperoni pizzas. The total length of the rectangle is labeled '28' at the top, showing that c+3=28.",
      "A bar diagram showing a rectangle with the total labeled '28' at the top. Inside, the left section shows 'c' and the right section shows '3', visually representing the equation c+3=28 where cheese pizzas plus pepperoni pizzas equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about cheese pizzas and pepperoni pizzas totaling 28."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Maya's Pizza Palace is the most popular lunch spot downtown. They have c cheese pizzas and 3 pepperoni pizzas on today's menu. There are 28 items on their menu in total."
      ],
      [
        "3/6",
        "There are c cheese pizzas and 3 pepperoni pizzas. There are 28 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation c+3=28 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_17_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'c' (representing cheese pizzas) and the right section labeled '3' (representing pepperoni pizzas). The total length is labeled '28' at the top, clearly demonstrating that c+3=28."
      ]
    ],
    "question_number": "1_17"
  },
  {
    "question_text": "Sofia creates origami flowers for wedding decorations. He needs to make 7 roses for the Johnson wedding. It takes p sheets of paper to make each rose, so Sofia needs a total of 63 sheets of paper.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_18_A",
      "Gr5_36_1_18_B",
      "Gr5_36_1_18_C",
      "Gr5_36_1_18_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 7 equal sections, each labeled 'p' to represent the number of sheets of paper needed for each rose. The total length of the diagram is labeled '63' at the top, visually demonstrating that 7 groups of p sheets of paper equals 63 total sheets of paper, representing the equation 7p=63.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about roses.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 7 roses with p sheets of paper each.",
      "A bar diagram that fails to properly illustrate the relationship between 7 roses, p sheets of paper per rose, and 63 total sheets of paper."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about sheets of paper."
      ],
      [
        "2/6",
        "Sofia creates origami flowers for wedding decorations. He needs to make 7 roses for the Johnson wedding. It takes p sheets of paper to make each rose, so Sofia needs a total of 63 sheets of paper."
      ],
      [
        "3/6",
        "Sofia needs to make 7 roses. It takes p sheets of paper to make each rose. Sofia needs a total of 63 sheets of paper."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 7×p can also be written as 7p. So, the equation 7p=63 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_18_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 7 equal sections, each labeled 'p' to represent the number of sheets of paper needed for one rose. The total length is labeled '63' at the top, clearly demonstrating that 7 × p = 63 or 7p=63."
      ]
    ],
    "question_number": "1_18"
  },
  {
    "question_text": "Pasta Perfect is the most popular lunch spot in Little Italy. They have s spaghetti dishes and 7 penne dishes on today's menu. There are 30 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_19_A",
      "Gr5_36_1_19_B",
      "Gr5_36_1_19_C",
      "Gr5_36_1_19_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 's' representing spaghetti dishes, and the right section is labeled '7' representing penne dishes. The total length of the rectangle is labeled '30' at the top, showing that s+7=30.",
      "A bar diagram showing a rectangle with the total labeled '30' at the top. Inside, the left section shows 's' and the right section shows '7', visually representing the equation s+7=30 where spaghetti dishes plus penne dishes equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about spaghetti dishes and penne dishes totaling 30."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Pasta Perfect is the most popular lunch spot in Little Italy. They have s spaghetti dishes and 7 penne dishes on today's menu. There are 30 items on their menu in total."
      ],
      [
        "3/6",
        "There are s spaghetti dishes and 7 penne dishes. There are 30 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation s+7=30 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_19_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 's' (representing spaghetti dishes) and the right section labeled '7' (representing penne dishes). The total length is labeled '30' at the top, clearly demonstrating that s+7=30."
      ]
    ],
    "question_number": "1_19"
  },
  {
    "question_text": "Caleb assembles camping gear sets for scout troop. He needs to make 13 sets for the wilderness camping trip. It takes t tent stakes to make each set, so Caleb needs a total of 52 tent stakes.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_20_A",
      "Gr5_36_1_20_B",
      "Gr5_36_1_20_C",
      "Gr5_36_1_20_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 't' to represent the number of tent stakes needed for each set. The total length of the diagram is labeled '52' at the top, visually demonstrating that 13 groups of t tent stakes equals 52 total tent stakes, representing the equation 13t=52.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about sets.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 sets with t tent stakes each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 sets, t tent stakes per set, and 52 total tent stakes."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about tent stakes."
      ],
      [
        "2/6",
        "Caleb assembles camping gear sets for scout troop. He needs to make 13 sets for the wilderness camping trip. It takes t tent stakes to make each set, so Caleb needs a total of 52 tent stakes."
      ],
      [
        "3/6",
        "Caleb needs to make 13 sets. It takes t tent stakes to make each set. Caleb needs a total of 52 tent stakes."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×t can also be written as 13t. So, the equation 13t=52 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_20_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 't' to represent the number of tent stakes needed for one set. The total length is labeled '52' at the top, clearly demonstrating that 13 × t = 52 or 13t=52."
      ]
    ],
    "question_number": "1_20"
  },
  {
    "question_text": "Flower Power Shop is the most popular lunch spot on Rose Avenue. They have r roses and 4 tulips on today's menu. There are 36 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_21_A",
      "Gr5_36_1_21_B",
      "Gr5_36_1_21_C",
      "Gr5_36_1_21_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'r' representing roses, and the right section is labeled '4' representing tulips. The total length of the rectangle is labeled '36' at the top, showing that r+4=36.",
      "A bar diagram showing a rectangle with the total labeled '36' at the top. Inside, the left section shows 'r' and the right section shows '4', visually representing the equation r+4=36 where roses plus tulips equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about roses and tulips totaling 36."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Flower Power Shop is the most popular lunch spot on Rose Avenue. They have r roses and 4 tulips on today's menu. There are 36 items on their menu in total."
      ],
      [
        "3/6",
        "There are r roses and 4 tulips. There are 36 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation r+4=36 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_21_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'r' (representing roses) and the right section labeled '4' (representing tulips). The total length is labeled '36' at the top, clearly demonstrating that r+4=36."
      ]
    ],
    "question_number": "1_21"
  },
  {
    "question_text": "Sophia prepares study guides for the tutoring center. He needs to make 14 guides for final exams. It takes p practice problems to make each guide, so Sophia needs a total of 126 practice problems.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_22_A",
      "Gr5_36_1_22_B",
      "Gr5_36_1_22_C",
      "Gr5_36_1_22_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 14 equal sections, each labeled 'p' to represent the number of practice problems needed for each guide. The total length of the diagram is labeled '126' at the top, visually demonstrating that 14 groups of p practice problems equals 126 total practice problems, representing the equation 14p=126.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about guides.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 14 guides with p practice problems each.",
      "A bar diagram that fails to properly illustrate the relationship between 14 guides, p practice problems per guide, and 126 total practice problems."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about practice problems."
      ],
      [
        "2/6",
        "Sophia prepares study guides for the tutoring center. He needs to make 14 guides for final exams. It takes p practice problems to make each guide, so Sophia needs a total of 126 practice problems."
      ],
      [
        "3/6",
        "Sophia needs to make 14 guides. It takes p practice problems to make each guide. Sophia needs a total of 126 practice problems."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 14×p can also be written as 14p. So, the equation 14p=126 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_22_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 14 equal sections, each labeled 'p' to represent the number of practice problems needed for one guide. The total length is labeled '126' at the top, clearly demonstrating that 14 × p = 126 or 14p=126."
      ]
    ],
    "question_number": "1_22"
  },
  {
    "question_text": "The Sweet Spot bakery is the most popular lunch spot on Main Street. They have x chocolate cupcakes and 20 vanilla cupcakes on today's menu. There are 49 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_23_A",
      "Gr5_36_1_23_B",
      "Gr5_36_1_23_C",
      "Gr5_36_1_23_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'x' representing chocolate cupcakes, and the right section is labeled '20' representing vanilla cupcakes. The total length of the rectangle is labeled '49' at the top, showing that x+20=49.",
      "A bar diagram showing a rectangle with the total labeled '49' at the top. Inside, the left section shows 'x' and the right section shows '20', visually representing the equation x+20=49 where chocolate cupcakes plus vanilla cupcakes equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about chocolate cupcakes and vanilla cupcakes totaling 49."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "The Sweet Spot bakery is the most popular lunch spot on Main Street. They have x chocolate cupcakes and 20 vanilla cupcakes on today's menu. There are 49 items on their menu in total."
      ],
      [
        "3/6",
        "There are x chocolate cupcakes and 20 vanilla cupcakes. There are 49 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation x+20=49 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_23_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'x' (representing chocolate cupcakes) and the right section labeled '20' (representing vanilla cupcakes). The total length is labeled '49' at the top, clearly demonstrating that x+20=49."
      ]
    ],
    "question_number": "1_23"
  },
  {
    "question_text": "Maya bakes cookie boxes for the school fundraiser. He needs to make 9 boxes for the fundraising event. It takes c cookies to make each boxe, so Maya needs a total of 81 cookies.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_24_A",
      "Gr5_36_1_24_B",
      "Gr5_36_1_24_C",
      "Gr5_36_1_24_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 9 equal sections, each labeled 'c' to represent the number of cookies needed for each boxe. The total length of the diagram is labeled '81' at the top, visually demonstrating that 9 groups of c cookies equals 81 total cookies, representing the equation 9c=81.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about boxes.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 9 boxes with c cookies each.",
      "A bar diagram that fails to properly illustrate the relationship between 9 boxes, c cookies per boxe, and 81 total cookies."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about cookies."
      ],
      [
        "2/6",
        "Maya bakes cookie boxes for the school fundraiser. He needs to make 9 boxes for the fundraising event. It takes c cookies to make each boxe, so Maya needs a total of 81 cookies."
      ],
      [
        "3/6",
        "Maya needs to make 9 boxes. It takes c cookies to make each boxe. Maya needs a total of 81 cookies."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 9×c can also be written as 9c. So, the equation 9c=81 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_24_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 9 equal sections, each labeled 'c' to represent the number of cookies needed for one boxe. The total length is labeled '81' at the top, clearly demonstrating that 9 × c = 81 or 9c=81."
      ]
    ],
    "question_number": "1_24"
  },
  {
    "question_text": "Green Thumb Nursery is the most popular lunch spot on Garden Street. They have h herb plants and 8 flower plants on today's menu. There are 17 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_25_A",
      "Gr5_36_1_25_B",
      "Gr5_36_1_25_C",
      "Gr5_36_1_25_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'h' representing herb plants, and the right section is labeled '8' representing flower plants. The total length of the rectangle is labeled '17' at the top, showing that h+8=17.",
      "A bar diagram showing a rectangle with the total labeled '17' at the top. Inside, the left section shows 'h' and the right section shows '8', visually representing the equation h+8=17 where herb plants plus flower plants equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about herb plants and flower plants totaling 17."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Green Thumb Nursery is the most popular lunch spot on Garden Street. They have h herb plants and 8 flower plants on today's menu. There are 17 items on their menu in total."
      ],
      [
        "3/6",
        "There are h herb plants and 8 flower plants. There are 17 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation h+8=17 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_25_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'h' (representing herb plants) and the right section labeled '8' (representing flower plants). The total length is labeled '17' at the top, clearly demonstrating that h+8=17."
      ]
    ],
    "question_number": "1_25"
  },
  {
    "question_text": "Dean makes custom balloon animals for kids' birthday parties. He needs to make 11 unicorns for Saturday's party. It takes b balloons to make each unicorn, so Dean needs a total of 77 balloons.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_26_A",
      "Gr5_36_1_26_B",
      "Gr5_36_1_26_C",
      "Gr5_36_1_26_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 11 equal sections, each labeled 'b' to represent the number of balloons needed for each unicorn. The total length of the diagram is labeled '77' at the top, visually demonstrating that 11 groups of b balloons equals 77 total balloons, representing the equation 11b=77.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about unicorns.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 11 unicorns with b balloons each.",
      "A bar diagram that fails to properly illustrate the relationship between 11 unicorns, b balloons per unicorn, and 77 total balloons."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about balloons."
      ],
      [
        "2/6",
        "Dean makes custom balloon animals for kids' birthday parties. He needs to make 11 unicorns for Saturday's party. It takes b balloons to make each unicorn, so Dean needs a total of 77 balloons."
      ],
      [
        "3/6",
        "Dean needs to make 11 unicorns. It takes b balloons to make each unicorn. Dean needs a total of 77 balloons."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 11×b can also be written as 11b. So, the equation 11b=77 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_26_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 11 equal sections, each labeled 'b' to represent the number of balloons needed for one unicorn. The total length is labeled '77' at the top, clearly demonstrating that 11 × b = 77 or 11b=77."
      ]
    ],
    "question_number": "1_26"
  },
  {
    "question_text": "Book Corner Café is the most popular lunch spot near the university. They have f fiction books and 7 non-fiction books on today's menu. There are 41 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_27_A",
      "Gr5_36_1_27_B",
      "Gr5_36_1_27_C",
      "Gr5_36_1_27_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'f' representing fiction books, and the right section is labeled '7' representing non-fiction books. The total length of the rectangle is labeled '41' at the top, showing that f+7=41.",
      "A bar diagram showing a rectangle with the total labeled '41' at the top. Inside, the left section shows 'f' and the right section shows '7', visually representing the equation f+7=41 where fiction books plus non-fiction books equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about fiction books and non-fiction books totaling 41."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Book Corner Café is the most popular lunch spot near the university. They have f fiction books and 7 non-fiction books on today's menu. There are 41 items on their menu in total."
      ],
      [
        "3/6",
        "There are f fiction books and 7 non-fiction books. There are 41 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation f+7=41 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_27_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'f' (representing fiction books) and the right section labeled '7' (representing non-fiction books). The total length is labeled '41' at the top, clearly demonstrating that f+7=41."
      ]
    ],
    "question_number": "1_27"
  },
  {
    "question_text": "Logan builds display cases for the science museum. He needs to make 11 cases for the dinosaur exhibit. It takes g glass panels to make each case, so Logan needs a total of 88 glass panels.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_28_A",
      "Gr5_36_1_28_B",
      "Gr5_36_1_28_C",
      "Gr5_36_1_28_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 11 equal sections, each labeled 'g' to represent the number of glass panels needed for each case. The total length of the diagram is labeled '88' at the top, visually demonstrating that 11 groups of g glass panels equals 88 total glass panels, representing the equation 11g=88.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about cases.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 11 cases with g glass panels each.",
      "A bar diagram that fails to properly illustrate the relationship between 11 cases, g glass panels per case, and 88 total glass panels."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about glass panels."
      ],
      [
        "2/6",
        "Logan builds display cases for the science museum. He needs to make 11 cases for the dinosaur exhibit. It takes g glass panels to make each case, so Logan needs a total of 88 glass panels."
      ],
      [
        "3/6",
        "Logan needs to make 11 cases. It takes g glass panels to make each case. Logan needs a total of 88 glass panels."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 11×g can also be written as 11g. So, the equation 11g=88 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_28_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 11 equal sections, each labeled 'g' to represent the number of glass panels needed for one case. The total length is labeled '88' at the top, clearly demonstrating that 11 × g = 88 or 11g=88."
      ]
    ],
    "question_number": "1_28"
  },
  {
    "question_text": "Fabric World is the most popular lunch spot in the craft district. They have c cotton fabrics and 5 silk fabrics on today's menu. There are 17 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_29_A",
      "Gr5_36_1_29_B",
      "Gr5_36_1_29_C",
      "Gr5_36_1_29_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'c' representing cotton fabrics, and the right section is labeled '5' representing silk fabrics. The total length of the rectangle is labeled '17' at the top, showing that c+5=17.",
      "A bar diagram showing a rectangle with the total labeled '17' at the top. Inside, the left section shows 'c' and the right section shows '5', visually representing the equation c+5=17 where cotton fabrics plus silk fabrics equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about cotton fabrics and silk fabrics totaling 17."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Fabric World is the most popular lunch spot in the craft district. They have c cotton fabrics and 5 silk fabrics on today's menu. There are 17 items on their menu in total."
      ],
      [
        "3/6",
        "There are c cotton fabrics and 5 silk fabrics. There are 17 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation c+5=17 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_29_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'c' (representing cotton fabrics) and the right section labeled '5' (representing silk fabrics). The total length is labeled '17' at the top, clearly demonstrating that c+5=17."
      ]
    ],
    "question_number": "1_29"
  },
  {
    "question_text": "Jackson builds custom skateboards for local youth. He needs to make 13 skateboards for the skateboard workshop. It takes b bolts to make each skateboard, so Jackson needs a total of 91 bolts.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_30_A",
      "Gr5_36_1_30_B",
      "Gr5_36_1_30_C",
      "Gr5_36_1_30_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 'b' to represent the number of bolts needed for each skateboard. The total length of the diagram is labeled '91' at the top, visually demonstrating that 13 groups of b bolts equals 91 total bolts, representing the equation 13b=91.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about skateboards.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 skateboards with b bolts each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 skateboards, b bolts per skateboard, and 91 total bolts."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about bolts."
      ],
      [
        "2/6",
        "Jackson builds custom skateboards for local youth. He needs to make 13 skateboards for the skateboard workshop. It takes b bolts to make each skateboard, so Jackson needs a total of 91 bolts."
      ],
      [
        "3/6",
        "Jackson needs to make 13 skateboards. It takes b bolts to make each skateboard. Jackson needs a total of 91 bolts."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×b can also be written as 13b. So, the equation 13b=91 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_30_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 'b' to represent the number of bolts needed for one skateboard. The total length is labeled '91' at the top, clearly demonstrating that 13 × b = 91 or 13b=91."
      ]
    ],
    "question_number": "1_30"
  },
  {
    "question_text": "Ocean View Restaurant is the most popular lunch spot by the harbor. They have f fish tacos and 5 chicken tacos on today's menu. There are 10 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_31_A",
      "Gr5_36_1_31_B",
      "Gr5_36_1_31_C",
      "Gr5_36_1_31_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'f' representing fish tacos, and the right section is labeled '5' representing chicken tacos. The total length of the rectangle is labeled '10' at the top, showing that f+5=10.",
      "A bar diagram showing a rectangle with the total labeled '10' at the top. Inside, the left section shows 'f' and the right section shows '5', visually representing the equation f+5=10 where fish tacos plus chicken tacos equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about fish tacos and chicken tacos totaling 10."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Ocean View Restaurant is the most popular lunch spot by the harbor. They have f fish tacos and 5 chicken tacos on today's menu. There are 10 items on their menu in total."
      ],
      [
        "3/6",
        "There are f fish tacos and 5 chicken tacos. There are 10 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation f+5=10 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_31_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'f' (representing fish tacos) and the right section labeled '5' (representing chicken tacos). The total length is labeled '10' at the top, clearly demonstrating that f+5=10."
      ]
    ],
    "question_number": "1_31"
  },
  {
    "question_text": "Charlotte creates welcome baskets for new neighbors. He needs to make 11 baskets for the community welcome. It takes c local coupons to make each basket, so Charlotte needs a total of 121 local coupons.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_32_A",
      "Gr5_36_1_32_B",
      "Gr5_36_1_32_C",
      "Gr5_36_1_32_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 11 equal sections, each labeled 'c' to represent the number of local coupons needed for each basket. The total length of the diagram is labeled '121' at the top, visually demonstrating that 11 groups of c local coupons equals 121 total local coupons, representing the equation 11c=121.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about baskets.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 11 baskets with c local coupons each.",
      "A bar diagram that fails to properly illustrate the relationship between 11 baskets, c local coupons per basket, and 121 total local coupons."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about local coupons."
      ],
      [
        "2/6",
        "Charlotte creates welcome baskets for new neighbors. He needs to make 11 baskets for the community welcome. It takes c local coupons to make each basket, so Charlotte needs a total of 121 local coupons."
      ],
      [
        "3/6",
        "Charlotte needs to make 11 baskets. It takes c local coupons to make each basket. Charlotte needs a total of 121 local coupons."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 11×c can also be written as 11c. So, the equation 11c=121 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_32_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 11 equal sections, each labeled 'c' to represent the number of local coupons needed for one basket. The total length is labeled '121' at the top, clearly demonstrating that 11 × c = 121 or 11c=121."
      ]
    ],
    "question_number": "1_32"
  },
  {
    "question_text": "Fresh Fruit Market is the most popular lunch spot at the farmer's market. They have r red apples and 14 green apples on today's menu. There are 19 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_33_A",
      "Gr5_36_1_33_B",
      "Gr5_36_1_33_C",
      "Gr5_36_1_33_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'r' representing red apples, and the right section is labeled '14' representing green apples. The total length of the rectangle is labeled '19' at the top, showing that r+14=19.",
      "A bar diagram showing a rectangle with the total labeled '19' at the top. Inside, the left section shows 'r' and the right section shows '14', visually representing the equation r+14=19 where red apples plus green apples equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about red apples and green apples totaling 19."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Fresh Fruit Market is the most popular lunch spot at the farmer's market. They have r red apples and 14 green apples on today's menu. There are 19 items on their menu in total."
      ],
      [
        "3/6",
        "There are r red apples and 14 green apples. There are 19 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation r+14=19 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_33_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'r' (representing red apples) and the right section labeled '14' (representing green apples). The total length is labeled '19' at the top, clearly demonstrating that r+14=19."
      ]
    ],
    "question_number": "1_33"
  },
  {
    "question_text": "Amelia prepares flower arrangements for the wedding venue. He needs to make 7 arrangements for the Miller wedding. It takes r roses to make each arrangement, so Amelia needs a total of 28 roses.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_34_A",
      "Gr5_36_1_34_B",
      "Gr5_36_1_34_C",
      "Gr5_36_1_34_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 7 equal sections, each labeled 'r' to represent the number of roses needed for each arrangement. The total length of the diagram is labeled '28' at the top, visually demonstrating that 7 groups of r roses equals 28 total roses, representing the equation 7r=28.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about arrangements.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 7 arrangements with r roses each.",
      "A bar diagram that fails to properly illustrate the relationship between 7 arrangements, r roses per arrangement, and 28 total roses."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about roses."
      ],
      [
        "2/6",
        "Amelia prepares flower arrangements for the wedding venue. He needs to make 7 arrangements for the Miller wedding. It takes r roses to make each arrangement, so Amelia needs a total of 28 roses."
      ],
      [
        "3/6",
        "Amelia needs to make 7 arrangements. It takes r roses to make each arrangement. Amelia needs a total of 28 roses."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 7×r can also be written as 7r. So, the equation 7r=28 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_34_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 7 equal sections, each labeled 'r' to represent the number of roses needed for one arrangement. The total length is labeled '28' at the top, clearly demonstrating that 7 × r = 28 or 7r=28."
      ]
    ],
    "question_number": "1_34"
  },
  {
    "question_text": "Cosmic Bowling Alley is the most popular lunch spot on Neon Avenue. They have s standard lanes and 14 cosmic lanes on today's menu. There are 28 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_35_A",
      "Gr5_36_1_35_B",
      "Gr5_36_1_35_C",
      "Gr5_36_1_35_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 's' representing standard lanes, and the right section is labeled '14' representing cosmic lanes. The total length of the rectangle is labeled '28' at the top, showing that s+14=28.",
      "A bar diagram showing a rectangle with the total labeled '28' at the top. Inside, the left section shows 's' and the right section shows '14', visually representing the equation s+14=28 where standard lanes plus cosmic lanes equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about standard lanes and cosmic lanes totaling 28."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Cosmic Bowling Alley is the most popular lunch spot on Neon Avenue. They have s standard lanes and 14 cosmic lanes on today's menu. There are 28 items on their menu in total."
      ],
      [
        "3/6",
        "There are s standard lanes and 14 cosmic lanes. There are 28 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation s+14=28 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_35_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 's' (representing standard lanes) and the right section labeled '14' (representing cosmic lanes). The total length is labeled '28' at the top, clearly demonstrating that s+14=28."
      ]
    ],
    "question_number": "1_35"
  },
  {
    "question_text": "Emma knits scarves for the winter charity drive. He needs to make 5 scarves for the donation. It takes y yards of yarn to make each scarve, so Emma needs a total of 20 yards of yarn.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_36_A",
      "Gr5_36_1_36_B",
      "Gr5_36_1_36_C",
      "Gr5_36_1_36_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 5 equal sections, each labeled 'y' to represent the number of yards of yarn needed for each scarve. The total length of the diagram is labeled '20' at the top, visually demonstrating that 5 groups of y yards of yarn equals 20 total yards of yarn, representing the equation 5y=20.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about scarves.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 5 scarves with y yards of yarn each.",
      "A bar diagram that fails to properly illustrate the relationship between 5 scarves, y yards of yarn per scarve, and 20 total yards of yarn."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about yards of yarn."
      ],
      [
        "2/6",
        "Emma knits scarves for the winter charity drive. He needs to make 5 scarves for the donation. It takes y yards of yarn to make each scarve, so Emma needs a total of 20 yards of yarn."
      ],
      [
        "3/6",
        "Emma needs to make 5 scarves. It takes y yards of yarn to make each scarve. Emma needs a total of 20 yards of yarn."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 5×y can also be written as 5y. So, the equation 5y=20 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_36_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 5 equal sections, each labeled 'y' to represent the number of yards of yarn needed for one scarve. The total length is labeled '20' at the top, clearly demonstrating that 5 × y = 20 or 5y=20."
      ]
    ],
    "question_number": "1_36"
  },
  {
    "question_text": "Sunny's Smoothie Bar is the most popular lunch spot at the beach. They have b berry smoothies and 6 tropical smoothies on today's menu. There are 34 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_37_A",
      "Gr5_36_1_37_B",
      "Gr5_36_1_37_C",
      "Gr5_36_1_37_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'b' representing berry smoothies, and the right section is labeled '6' representing tropical smoothies. The total length of the rectangle is labeled '34' at the top, showing that b+6=34.",
      "A bar diagram showing a rectangle with the total labeled '34' at the top. Inside, the left section shows 'b' and the right section shows '6', visually representing the equation b+6=34 where berry smoothies plus tropical smoothies equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about berry smoothies and tropical smoothies totaling 34."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Sunny's Smoothie Bar is the most popular lunch spot at the beach. They have b berry smoothies and 6 tropical smoothies on today's menu. There are 34 items on their menu in total."
      ],
      [
        "3/6",
        "There are b berry smoothies and 6 tropical smoothies. There are 34 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation b+6=34 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_37_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'b' (representing berry smoothies) and the right section labeled '6' (representing tropical smoothies). The total length is labeled '34' at the top, clearly demonstrating that b+6=34."
      ]
    ],
    "question_number": "1_37"
  },
  {
    "question_text": "Tyler builds gaming computers for the esports tournament. He needs to make 13 computers for the regional championship. It takes c components to make each computer, so Tyler needs a total of 143 components.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_38_A",
      "Gr5_36_1_38_B",
      "Gr5_36_1_38_C",
      "Gr5_36_1_38_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 'c' to represent the number of components needed for each computer. The total length of the diagram is labeled '143' at the top, visually demonstrating that 13 groups of c components equals 143 total components, representing the equation 13c=143.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about computers.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 computers with c components each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 computers, c components per computer, and 143 total components."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about components."
      ],
      [
        "2/6",
        "Tyler builds gaming computers for the esports tournament. He needs to make 13 computers for the regional championship. It takes c components to make each computer, so Tyler needs a total of 143 components."
      ],
      [
        "3/6",
        "Tyler needs to make 13 computers. It takes c components to make each computer. Tyler needs a total of 143 components."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×c can also be written as 13c. So, the equation 13c=143 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_38_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 'c' to represent the number of components needed for one computer. The total length is labeled '143' at the top, clearly demonstrating that 13 × c = 143 or 13c=143."
      ]
    ],
    "question_number": "1_38"
  },
  {
    "question_text": "The Coffee Bean is the most popular lunch spot on campus. They have h hot coffees and 12 iced coffees on today's menu. There are 39 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_39_A",
      "Gr5_36_1_39_B",
      "Gr5_36_1_39_C",
      "Gr5_36_1_39_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'h' representing hot coffees, and the right section is labeled '12' representing iced coffees. The total length of the rectangle is labeled '39' at the top, showing that h+12=39.",
      "A bar diagram showing a rectangle with the total labeled '39' at the top. Inside, the left section shows 'h' and the right section shows '12', visually representing the equation h+12=39 where hot coffees plus iced coffees equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about hot coffees and iced coffees totaling 39."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "The Coffee Bean is the most popular lunch spot on campus. They have h hot coffees and 12 iced coffees on today's menu. There are 39 items on their menu in total."
      ],
      [
        "3/6",
        "There are h hot coffees and 12 iced coffees. There are 39 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation h+12=39 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_39_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'h' (representing hot coffees) and the right section labeled '12' (representing iced coffees). The total length is labeled '39' at the top, clearly demonstrating that h+12=39."
      ]
    ],
    "question_number": "1_39"
  },
  {
    "question_text": "Lucas assembles first aid stations for the marathon. He needs to make 7 stations for the city marathon. It takes w water bottles to make each station, so Lucas needs a total of 21 water bottles.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_40_A",
      "Gr5_36_1_40_B",
      "Gr5_36_1_40_C",
      "Gr5_36_1_40_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 7 equal sections, each labeled 'w' to represent the number of water bottles needed for each station. The total length of the diagram is labeled '21' at the top, visually demonstrating that 7 groups of w water bottles equals 21 total water bottles, representing the equation 7w=21.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about stations.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 7 stations with w water bottles each.",
      "A bar diagram that fails to properly illustrate the relationship between 7 stations, w water bottles per station, and 21 total water bottles."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about water bottles."
      ],
      [
        "2/6",
        "Lucas assembles first aid stations for the marathon. He needs to make 7 stations for the city marathon. It takes w water bottles to make each station, so Lucas needs a total of 21 water bottles."
      ],
      [
        "3/6",
        "Lucas needs to make 7 stations. It takes w water bottles to make each station. Lucas needs a total of 21 water bottles."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 7×w can also be written as 7w. So, the equation 7w=21 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_40_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 7 equal sections, each labeled 'w' to represent the number of water bottles needed for one station. The total length is labeled '21' at the top, clearly demonstrating that 7 × w = 21 or 7w=21."
      ]
    ],
    "question_number": "1_40"
  },
  {
    "question_text": "City Sports Center is the most popular lunch spot downtown. They have b basketball courts and 19 tennis courts on today's menu. There are 26 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_41_A",
      "Gr5_36_1_41_B",
      "Gr5_36_1_41_C",
      "Gr5_36_1_41_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'b' representing basketball courts, and the right section is labeled '19' representing tennis courts. The total length of the rectangle is labeled '26' at the top, showing that b+19=26.",
      "A bar diagram showing a rectangle with the total labeled '26' at the top. Inside, the left section shows 'b' and the right section shows '19', visually representing the equation b+19=26 where basketball courts plus tennis courts equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about basketball courts and tennis courts totaling 26."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "City Sports Center is the most popular lunch spot downtown. They have b basketball courts and 19 tennis courts on today's menu. There are 26 items on their menu in total."
      ],
      [
        "3/6",
        "There are b basketball courts and 19 tennis courts. There are 26 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation b+19=26 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_41_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'b' (representing basketball courts) and the right section labeled '19' (representing tennis courts). The total length is labeled '26' at the top, clearly demonstrating that b+19=26."
      ]
    ],
    "question_number": "1_41"
  },
  {
    "question_text": "Carlos assembles care packages for hurricane relief. He needs to make 7 packages for the relief effort. It takes w bottles of water to make each package, so Carlos needs a total of 49 bottles of water.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_42_A",
      "Gr5_36_1_42_B",
      "Gr5_36_1_42_C",
      "Gr5_36_1_42_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 7 equal sections, each labeled 'w' to represent the number of bottles of water needed for each package. The total length of the diagram is labeled '49' at the top, visually demonstrating that 7 groups of w bottles of water equals 49 total bottles of water, representing the equation 7w=49.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about packages.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 7 packages with w bottles of water each.",
      "A bar diagram that fails to properly illustrate the relationship between 7 packages, w bottles of water per package, and 49 total bottles of water."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about bottles of water."
      ],
      [
        "2/6",
        "Carlos assembles care packages for hurricane relief. He needs to make 7 packages for the relief effort. It takes w bottles of water to make each package, so Carlos needs a total of 49 bottles of water."
      ],
      [
        "3/6",
        "Carlos needs to make 7 packages. It takes w bottles of water to make each package. Carlos needs a total of 49 bottles of water."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 7×w can also be written as 7w. So, the equation 7w=49 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_42_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 7 equal sections, each labeled 'w' to represent the number of bottles of water needed for one package. The total length is labeled '49' at the top, clearly demonstrating that 7 × w = 49 or 7w=49."
      ]
    ],
    "question_number": "1_42"
  },
  {
    "question_text": "Art Supply Store is the most popular lunch spot in the arts district. They have w watercolor sets and 9 acrylic sets on today's menu. There are 25 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_43_A",
      "Gr5_36_1_43_B",
      "Gr5_36_1_43_C",
      "Gr5_36_1_43_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'w' representing watercolor sets, and the right section is labeled '9' representing acrylic sets. The total length of the rectangle is labeled '25' at the top, showing that w+9=25.",
      "A bar diagram showing a rectangle with the total labeled '25' at the top. Inside, the left section shows 'w' and the right section shows '9', visually representing the equation w+9=25 where watercolor sets plus acrylic sets equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about watercolor sets and acrylic sets totaling 25."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Art Supply Store is the most popular lunch spot in the arts district. They have w watercolor sets and 9 acrylic sets on today's menu. There are 25 items on their menu in total."
      ],
      [
        "3/6",
        "There are w watercolor sets and 9 acrylic sets. There are 25 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation w+9=25 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_43_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'w' (representing watercolor sets) and the right section labeled '9' (representing acrylic sets). The total length is labeled '25' at the top, clearly demonstrating that w+9=25."
      ]
    ],
    "question_number": "1_43"
  },
  {
    "question_text": "Zoe prepares gift baskets for the hospital volunteers. He needs to make 12 baskets for Volunteer Appreciation Day. It takes c chocolates to make each basket, so Zoe needs a total of 24 chocolates.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_44_A",
      "Gr5_36_1_44_B",
      "Gr5_36_1_44_C",
      "Gr5_36_1_44_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 12 equal sections, each labeled 'c' to represent the number of chocolates needed for each basket. The total length of the diagram is labeled '24' at the top, visually demonstrating that 12 groups of c chocolates equals 24 total chocolates, representing the equation 12c=24.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about baskets.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 12 baskets with c chocolates each.",
      "A bar diagram that fails to properly illustrate the relationship between 12 baskets, c chocolates per basket, and 24 total chocolates."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about chocolates."
      ],
      [
        "2/6",
        "Zoe prepares gift baskets for the hospital volunteers. He needs to make 12 baskets for Volunteer Appreciation Day. It takes c chocolates to make each basket, so Zoe needs a total of 24 chocolates."
      ],
      [
        "3/6",
        "Zoe needs to make 12 baskets. It takes c chocolates to make each basket. Zoe needs a total of 24 chocolates."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 12×c can also be written as 12c. So, the equation 12c=24 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_44_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 12 equal sections, each labeled 'c' to represent the number of chocolates needed for one basket. The total length is labeled '24' at the top, clearly demonstrating that 12 × c = 24 or 12c=24."
      ]
    ],
    "question_number": "1_44"
  },
  {
    "question_text": "The Wrap & Roll food truck is the most popular lunch spot in the city. They have v vegetarian wraps and 18 wraps containing meat on today's menu. There are 30 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_45_A",
      "Gr5_36_1_45_B",
      "Gr5_36_1_45_C",
      "Gr5_36_1_45_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'v' representing vegetarian wraps, and the right section is labeled '18' representing wraps containing meat. The total length of the rectangle is labeled '30' at the top, showing that v+18=30.",
      "A bar diagram showing a rectangle with the total labeled '30' at the top. Inside, the left section shows 'v' and the right section shows '18', visually representing the equation v+18=30 where vegetarian wraps plus wraps containing meat equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about vegetarian wraps and wraps containing meat totaling 30."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "The Wrap & Roll food truck is the most popular lunch spot in the city. They have v vegetarian wraps and 18 wraps containing meat on today's menu. There are 30 items on their menu in total."
      ],
      [
        "3/6",
        "There are v vegetarian wraps and 18 wraps containing meat. There are 30 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation v+18=30 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_45_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'v' (representing vegetarian wraps) and the right section labeled '18' (representing wraps containing meat). The total length is labeled '30' at the top, clearly demonstrating that v+18=30."
      ]
    ],
    "question_number": "1_45"
  },
  {
    "question_text": "Lily plants flower gardens for the neighborhood beautification project. He needs to make 13 gardens for the spring planting. It takes s seeds to make each garden, so Lily needs a total of 78 seeds.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_46_A",
      "Gr5_36_1_46_B",
      "Gr5_36_1_46_C",
      "Gr5_36_1_46_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 's' to represent the number of seeds needed for each garden. The total length of the diagram is labeled '78' at the top, visually demonstrating that 13 groups of s seeds equals 78 total seeds, representing the equation 13s=78.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about gardens.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 gardens with s seeds each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 gardens, s seeds per garden, and 78 total seeds."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about seeds."
      ],
      [
        "2/6",
        "Lily plants flower gardens for the neighborhood beautification project. He needs to make 13 gardens for the spring planting. It takes s seeds to make each garden, so Lily needs a total of 78 seeds."
      ],
      [
        "3/6",
        "Lily needs to make 13 gardens. It takes s seeds to make each garden. Lily needs a total of 78 seeds."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×s can also be written as 13s. So, the equation 13s=78 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_46_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 's' to represent the number of seeds needed for one garden. The total length is labeled '78' at the top, clearly demonstrating that 13 × s = 78 or 13s=78."
      ]
    ],
    "question_number": "1_46"
  },
  {
    "question_text": "Happy Tails Pet Store is the most popular lunch spot on Pet Lane. They have c cat toys and 22 dog toys on today's menu. There are 28 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_47_A",
      "Gr5_36_1_47_B",
      "Gr5_36_1_47_C",
      "Gr5_36_1_47_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'c' representing cat toys, and the right section is labeled '22' representing dog toys. The total length of the rectangle is labeled '28' at the top, showing that c+22=28.",
      "A bar diagram showing a rectangle with the total labeled '28' at the top. Inside, the left section shows 'c' and the right section shows '22', visually representing the equation c+22=28 where cat toys plus dog toys equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about cat toys and dog toys totaling 28."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Happy Tails Pet Store is the most popular lunch spot on Pet Lane. They have c cat toys and 22 dog toys on today's menu. There are 28 items on their menu in total."
      ],
      [
        "3/6",
        "There are c cat toys and 22 dog toys. There are 28 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation c+22=28 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_47_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'c' (representing cat toys) and the right section labeled '22' (representing dog toys). The total length is labeled '28' at the top, clearly demonstrating that c+22=28."
      ]
    ],
    "question_number": "1_47"
  },
  {
    "question_text": "Mia prepares instrument cases for the school band. He needs to make 14 cases for the spring concert. It takes f foam pieces to make each case, so Mia needs a total of 112 foam pieces.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_48_A",
      "Gr5_36_1_48_B",
      "Gr5_36_1_48_C",
      "Gr5_36_1_48_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 14 equal sections, each labeled 'f' to represent the number of foam pieces needed for each case. The total length of the diagram is labeled '112' at the top, visually demonstrating that 14 groups of f foam pieces equals 112 total foam pieces, representing the equation 14f=112.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about cases.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 14 cases with f foam pieces each.",
      "A bar diagram that fails to properly illustrate the relationship between 14 cases, f foam pieces per case, and 112 total foam pieces."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about foam pieces."
      ],
      [
        "2/6",
        "Mia prepares instrument cases for the school band. He needs to make 14 cases for the spring concert. It takes f foam pieces to make each case, so Mia needs a total of 112 foam pieces."
      ],
      [
        "3/6",
        "Mia needs to make 14 cases. It takes f foam pieces to make each case. Mia needs a total of 112 foam pieces."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 14×f can also be written as 14f. So, the equation 14f=112 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_48_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 14 equal sections, each labeled 'f' to represent the number of foam pieces needed for one case. The total length is labeled '112' at the top, clearly demonstrating that 14 × f = 112 or 14f=112."
      ]
    ],
    "question_number": "1_48"
  },
  {
    "question_text": "Game Zone Arcade is the most popular lunch spot in the mall. They have g racing games and 4 puzzle games on today's menu. There are 18 items on the menu in total.\n Which equation models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_49_A",
      "Gr5_36_1_49_B",
      "Gr5_36_1_49_C",
      "Gr5_36_1_49_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing a rectangle divided into two parts. The left section is labeled 'g' representing racing games, and the right section is labeled '4' representing puzzle games. The total length of the rectangle is labeled '18' at the top, showing that g+4=18.",
      "A bar diagram showing a rectangle with the total labeled '18' at the top. Inside, the left section shows 'g' and the right section shows '4', visually representing the equation g+4=18 where racing games plus puzzle games equals the total number of items.",
      "A bar diagram that does not correctly represent the given word problem, showing an incorrect relationship between the variables and totals.",
      "Another bar diagram that does not match the structure described in the word problem about racing games and puzzle games totaling 18."
    ],
    "correct_answers": [
      "A",
      "B"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about menu items."
      ],
      [
        "2/6",
        "Game Zone Arcade is the most popular lunch spot in the mall. They have g racing games and 4 puzzle games on today's menu. There are 18 items on their menu in total."
      ],
      [
        "3/6",
        "There are g racing games and 4 puzzle games. There are 18 items on the menu in total."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by an addition equation."
      ],
      [
        "6/6",
        "The equation g+4=18 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/1",
        "Gr5_36_1_49_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into two sections: the left section labeled 'g' (representing racing games) and the right section labeled '4' (representing puzzle games). The total length is labeled '18' at the top, clearly demonstrating that g+4=18."
      ]
    ],
    "question_number": "1_49"
  },
  {
    "question_text": "Isabella creates care packages for nursing home residents. He needs to make 4 packages for Grandparents Day. It takes g greeting cards to make each package, so Isabella needs a total of 40 greeting cards.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_50_A",
      "Gr5_36_1_50_B",
      "Gr5_36_1_50_C",
      "Gr5_36_1_50_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 4 equal sections, each labeled 'g' to represent the number of greeting cards needed for each package. The total length of the diagram is labeled '40' at the top, visually demonstrating that 4 groups of g greeting cards equals 40 total greeting cards, representing the equation 4g=40.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about packages.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 4 packages with g greeting cards each.",
      "A bar diagram that fails to properly illustrate the relationship between 4 packages, g greeting cards per package, and 40 total greeting cards."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about greeting cards."
      ],
      [
        "2/6",
        "Isabella creates care packages for nursing home residents. He needs to make 4 packages for Grandparents Day. It takes g greeting cards to make each package, so Isabella needs a total of 40 greeting cards."
      ],
      [
        "3/6",
        "Isabella needs to make 4 packages. It takes g greeting cards to make each package. Isabella needs a total of 40 greeting cards."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 4×g can also be written as 4g. So, the equation 4g=40 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_50_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 4 equal sections, each labeled 'g' to represent the number of greeting cards needed for one package. The total length is labeled '40' at the top, clearly demonstrating that 4 × g = 40 or 4g=40."
      ]
    ],
    "question_number": "1_50"
  },
  {
    "question_text": "Aiden constructs wooden birdhouses for the nature center. He needs to make 13 birdhouses for the wildlife exhibit. It takes n nails to make each birdhouse, so Aiden needs a total of 26 nails.\nWhich diagram models the story?",
    "skills": "write-a-one-step-equation-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr5_36_E1",
    "image_choice_tags": [
      "Gr5_36_1_51_A",
      "Gr5_36_1_51_B",
      "Gr5_36_1_51_C",
      "Gr5_36_1_51_D"
    ],
    "image_choice_tags_backend_description": [
      "A bar diagram showing 13 equal sections, each labeled 'n' to represent the number of nails needed for each birdhouse. The total length of the diagram is labeled '26' at the top, visually demonstrating that 13 groups of n nails equals 26 total nails, representing the equation 13n=26.",
      "A bar diagram that does not correctly represent the multiplication relationship described in the word problem about birdhouses.",
      "Another bar diagram showing an incorrect model that doesn't match the story about making 13 birdhouses with n nails each.",
      "A bar diagram that fails to properly illustrate the relationship between 13 birdhouses, n nails per birdhouse, and 26 total nails."
    ],
    "correct_answers": [
      "A",
      "C"
    ],
    "solution": [
      [
        "1/6",
        "First, look for numbers and words in the story that talk about nails."
      ],
      [
        "2/6",
        "Aiden constructs wooden birdhouses for the nature center. He needs to make 13 birdhouses for the wildlife exhibit. It takes n nails to make each birdhouse, so Aiden needs a total of 26 nails."
      ],
      [
        "3/6",
        "Aiden needs to make 13 birdhouses. It takes n nails to make each birdhouse. Aiden needs a total of 26 nails."
      ],
      [
        "4/6",
        "This diagram models the story."
      ],
      [
        "5/6",
        "The story can be represented by a multiplication equation."
      ],
      [
        "6/6",
        "The product 13×n can also be written as 13n. So, the equation 13n=26 models the story."
      ]
    ],
    "solution_image_tag": [
      [
        "1/6",
        "Gr5_36_1_51_step_1",
        "A bar diagram showing the correct model for the story. The rectangle is divided into 13 equal sections, each labeled 'n' to represent the number of nails needed for one birdhouse. The total length is labeled '26' at the top, clearly demonstrating that 13 × n = 26 or 13n=26."
      ]
    ],
    "question_number": "1_51"
  }
]