[
  {
    "question_text": "Which type of graph would best show the number of Pokemon cards in each student's collection, if cards come in booster packs of 11?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Pokemon cards in each student's collection, if cards come in booster packs of 11 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in booster packs of 11."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_1_step_1",
        "Diagram showing why a pictograph is ideal for displaying Pokemon cards data when items come in booster packs of 11, with comparison to other graph types."
      ]
    ],
    "question_number": "3_1"
  },
  {
    "question_text": "Which type of graph would best show the number of anime stickers on each classroom wall, if stickers come in sheets of 20?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of anime stickers on each classroom wall, if stickers come in sheets of 20 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in sheets of 20."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_2_step_1",
        "Diagram showing why a pictograph is ideal for displaying anime stickers data when items come in sheets of 20, with comparison to other graph types."
      ]
    ],
    "question_number": "3_2"
  },
  {
    "question_text": "Which type of graph would best show the number of Marvel superhero figures in each toy store, if figures are sold in sets of 6?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Marvel superhero figures in each toy store, if figures are sold in sets of 6 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in sets of 6."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_3_step_1",
        "Diagram showing why a pictograph is ideal for displaying Marvel superhero figures data when items come in sets of 6, with comparison to other graph types."
      ]
    ],
    "question_number": "3_3"
  },
  {
    "question_text": "Which type of graph would best show the number of K-pop albums bought by each fan, if albums are packaged in bundles of 3?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of K-pop albums bought by each fan, if albums are packaged in bundles of 3 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in bundles of 3."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_4_step_1",
        "Diagram showing why a pictograph is ideal for displaying K-pop albums data when items come in bundles of 3, with comparison to other graph types."
      ]
    ],
    "question_number": "3_4"
  },
  {
    "question_text": "Which type of graph would best show the number of Fortnite V-bucks earned by each player, if V-bucks come in packs of 1000?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Fortnite V-bucks earned by each player, if V-bucks come in packs of 1000 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in packs of 1000."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_5_step_1",
        "Diagram showing why a pictograph is ideal for displaying Fortnite V-bucks data when items come in packs of 1000, with comparison to other graph types."
      ]
    ],
    "question_number": "3_5"
  },
  {
    "question_text": "Which type of graph would best show the number of TikTok followers gained by each influencer, if followers are counted in thousands?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of TikTok followers gained by each influencer, if followers are counted in thousands is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in thousands of 1000."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_6_step_1",
        "Diagram showing why a pictograph is ideal for displaying TikTok followers data when items come in thousands of 1000, with comparison to other graph types."
      ]
    ],
    "question_number": "3_6"
  },
  {
    "question_text": "Which type of graph would best show the number of Minecraft blocks used in each build, if blocks are placed in stacks of 64?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Minecraft blocks used in each build, if blocks are placed in stacks of 64 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in stacks of 64."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_7_step_1",
        "Diagram showing why a pictograph is ideal for displaying Minecraft blocks data when items come in stacks of 64, with comparison to other graph types."
      ]
    ],
    "question_number": "3_7"
  },
  {
    "question_text": "Which type of graph would best show the number of YouTube subscribers each creator has, if subscribers are counted in groups of 100?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of YouTube subscribers each creator has, if subscribers are counted in groups of 100 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in groups of 100."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_8_step_1",
        "Diagram showing why a pictograph is ideal for displaying YouTube subscribers data when items come in groups of 100, with comparison to other graph types."
      ]
    ],
    "question_number": "3_8"
  },
  {
    "question_text": "Which type of graph would best show the number of Roblox Robux spent by each player, if Robux come in packages of 400?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Roblox Robux spent by each player, if Robux come in packages of 400 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in packages of 400."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_9_step_1",
        "Diagram showing why a pictograph is ideal for displaying Roblox Robux data when items come in packages of 400, with comparison to other graph types."
      ]
    ],
    "question_number": "3_9"
  },
  {
    "question_text": "Which type of graph would best show the number of Among Us games played by each friend group, if games are played in sessions of 5?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Among Us games played by each friend group, if games are played in sessions of 5 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in sessions of 5."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_10_step_1",
        "Diagram showing why a pictograph is ideal for displaying Among Us games data when items come in sessions of 5, with comparison to other graph types."
      ]
    ],
    "question_number": "3_10"
  },
  {
    "question_text": "Which type of graph would best show the number of Discord messages sent in each server, if messages are counted in batches of 50?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Discord messages sent in each server, if messages are counted in batches of 50 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in batches of 50."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_11_step_1",
        "Diagram showing why a pictograph is ideal for displaying Discord messages data when items come in batches of 50, with comparison to other graph types."
      ]
    ],
    "question_number": "3_11"
  },
  {
    "question_text": "Which type of graph would best show the number of Netflix episodes watched by each family, if episodes are released in seasons of 10?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Netflix episodes watched by each family, if episodes are released in seasons of 10 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in seasons of 10."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_12_step_1",
        "Diagram showing why a pictograph is ideal for displaying Netflix episodes data when items come in seasons of 10, with comparison to other graph types."
      ]
    ],
    "question_number": "3_12"
  },
  {
    "question_text": "Which type of graph would best show the number of Spotify songs in each playlist, if songs are added in sets of 25?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Spotify songs in each playlist, if songs are added in sets of 25 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in sets of 25."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_13_step_1",
        "Diagram showing why a pictograph is ideal for displaying Spotify songs data when items come in sets of 25, with comparison to other graph types."
      ]
    ],
    "question_number": "3_13"
  },
  {
    "question_text": "Which type of graph would best show the number of Instagram photos posted by each teenager, if photos are uploaded in groups of 9?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Instagram photos posted by each teenager, if photos are uploaded in groups of 9 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in groups of 9."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_14_step_1",
        "Diagram showing why a pictograph is ideal for displaying Instagram photos data when items come in groups of 9, with comparison to other graph types."
      ]
    ],
    "question_number": "3_14"
  },
  {
    "question_text": "Which type of graph would best show the number of Snapchat streaks maintained by each user, if streaks are counted in weeks of 7 days?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Snapchat streaks maintained by each user, if streaks are counted in weeks of 7 days is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in weeks of 7."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_15_step_1",
        "Diagram showing why a pictograph is ideal for displaying Snapchat streaks data when items come in weeks of 7, with comparison to other graph types."
      ]
    ],
    "question_number": "3_15"
  },
  {
    "question_text": "Which type of graph would best show the number of Apple AirPods sold at each store, if AirPods come in pairs of 2?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Apple AirPods sold at each store, if AirPods come in pairs of 2 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in pairs of 2."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_16_step_1",
        "Diagram showing why a pictograph is ideal for displaying Apple AirPods data when items come in pairs of 2, with comparison to other graph types."
      ]
    ],
    "question_number": "3_16"
  },
  {
    "question_text": "Which type of graph would best show the number of Tesla charging stations at each location, if stations are installed in clusters of 4?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "pictograph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Tesla charging stations at each location, if stations are installed in clusters of 4 is a pictograph. It compares two or more values that are multiples of a number, making it perfect when data comes in clusters of 4."
      ],
      [
        "2/2",
        "A bar graph compares different categories without regard to groupings. A line graph shows changes over time, which isn't relevant here."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_17_step_1",
        "Diagram showing why a pictograph is ideal for displaying Tesla charging stations data when items come in clusters of 4, with comparison to other graph types."
      ]
    ],
    "question_number": "3_17"
  },
  {
    "question_text": "Which is the best type of graph to show the temperature in your bedroom each hour during a summer night?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the temperature in your bedroom each hour during a summer night is a line graph. It shows temperature changes over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_18_step_1",
        "Diagram showing a line graph tracking temperature changes over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_18"
  },
  {
    "question_text": "Which is the best type of graph to show the number of TikTok views your video gets each day for two weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of TikTok views your video gets each day for two weeks is a line graph. It shows social media growth over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_19_step_1",
        "Diagram showing a line graph tracking social media growth over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_19"
  },
  {
    "question_text": "Which is the best type of graph to show your phone battery percentage each hour during a school day?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your phone battery percentage each hour during a school day is a line graph. It shows battery drain over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_20_step_1",
        "Diagram showing a line graph tracking battery drain over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_20"
  },
  {
    "question_text": "Which is the best type of graph to show the number of Pokemon GO steps recorded each day for a month?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Pokemon GO steps recorded each day for a month is a line graph. It shows daily activity over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_21_step_1",
        "Diagram showing a line graph tracking daily activity over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_21"
  },
  {
    "question_text": "Which is the best type of graph to show your Spotify listening hours each week during the school year?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your Spotify listening hours each week during the school year is a line graph. It shows music consumption over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_22_step_1",
        "Diagram showing a line graph tracking music consumption over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_22"
  },
  {
    "question_text": "Which is the best type of graph to show the number of Instagram likes your posts receive each day for 10 days?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Instagram likes your posts receive each day for 10 days is a line graph. It shows social engagement over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_23_step_1",
        "Diagram showing a line graph tracking social engagement over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_23"
  },
  {
    "question_text": "Which is the best type of graph to show your Fortnite win rate percentage each week for two months?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your Fortnite win rate percentage each week for two months is a line graph. It shows gaming performance over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_24_step_1",
        "Diagram showing a line graph tracking gaming performance over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_24"
  },
  {
    "question_text": "Which is the best type of graph to show the amount of time you spend on homework each night for three weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the amount of time you spend on homework each night for three weeks is a line graph. It shows study habits over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_25_step_1",
        "Diagram showing a line graph tracking study habits over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_25"
  },
  {
    "question_text": "Which is the best type of graph to show your Snapchat score increase each day during summer vacation?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your Snapchat score increase each day during summer vacation is a line graph. It shows social activity over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_26_step_1",
        "Diagram showing a line graph tracking social activity over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_26"
  },
  {
    "question_text": "Which is the best type of graph to show the number of YouTube videos you watch each weekend for 8 weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of YouTube videos you watch each weekend for 8 weeks is a line graph. It shows entertainment patterns over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_27_step_1",
        "Diagram showing a line graph tracking entertainment patterns over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_27"
  },
  {
    "question_text": "Which is the best type of graph to show your daily screen time minutes recorded by your phone for one month?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your daily screen time minutes recorded by your phone for one month is a line graph. It shows device usage over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_28_step_1",
        "Diagram showing a line graph tracking device usage over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_28"
  },
  {
    "question_text": "Which is the best type of graph to show the number of Discord messages you send each day for two weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of Discord messages you send each day for two weeks is a line graph. It shows communication frequency over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_29_step_1",
        "Diagram showing a line graph tracking communication frequency over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_29"
  },
  {
    "question_text": "Which is the best type of graph to show your daily step count recorded by your fitness tracker for 21 days?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your daily step count recorded by your fitness tracker for 21 days is a line graph. It shows fitness progress over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_30_step_1",
        "Diagram showing a line graph tracking fitness progress over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_30"
  },
  {
    "question_text": "Which is the best type of graph to show the amount of money in your allowance savings each week for 12 weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the amount of money in your allowance savings each week for 12 weeks is a line graph. It shows financial growth over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_31_step_1",
        "Diagram showing a line graph tracking financial growth over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_31"
  },
  {
    "question_text": "Which is the best type of graph to show your reading progress measured in pages per day for one month?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your reading progress measured in pages per day for one month is a line graph. It shows academic progress over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_32_step_1",
        "Diagram showing a line graph tracking academic progress over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_32"
  },
  {
    "question_text": "Which is the best type of graph to show the number of memes you save to your phone each day for 15 days?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show the number of memes you save to your phone each day for 15 days is a line graph. It shows content collection over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_33_step_1",
        "Diagram showing a line graph tracking content collection over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_33"
  },
  {
    "question_text": "Which is the best type of graph to show your average sleep hours each night recorded for four weeks?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "line graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to show your average sleep hours each night recorded for four weeks is a line graph. It shows sleep pattern over time, making it perfect for tracking changes and trends."
      ],
      [
        "2/2",
        "A bar graph compares different categories, not changes over time. A pictograph is used for data with natural groupings, not time-based data."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_34_step_1",
        "Diagram showing a line graph tracking sleep pattern over time, demonstrating why it's the best choice for time-based data."
      ]
    ],
    "question_number": "3_34"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite anime genres among students in different grade levels?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite anime genres among students in different grade levels is a bar graph. It is perfect for comparing preferences across different groups and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_35_step_1",
        "Diagram showing a bar graph comparing preferences across different groups, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_35"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different gaming platforms owned by students in various schools?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different gaming platforms owned by students in various schools is a bar graph. It is perfect for comparing ownership across different locations and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_36_step_1",
        "Diagram showing a bar graph comparing ownership across different locations, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_36"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the most popular social media apps used by teenagers in different cities?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the most popular social media apps used by teenagers in different cities is a bar graph. It is perfect for comparing app usage across different regions and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_37_step_1",
        "Diagram showing a bar graph comparing app usage across different regions, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_37"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite K-pop groups listened to by fans in different countries?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite K-pop groups listened to by fans in different countries is a bar graph. It is perfect for comparing music preferences across different nations and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_38_step_1",
        "Diagram showing a bar graph comparing music preferences across different nations, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_38"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different Marvel movies watched by families in various neighborhoods?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different Marvel movies watched by families in various neighborhoods is a bar graph. It is perfect for comparing viewing habits across different areas and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_39_step_1",
        "Diagram showing a bar graph comparing viewing habits across different areas, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_39"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the most preferred streaming services used by households in different states?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the most preferred streaming services used by households in different states is a bar graph. It is perfect for comparing service preferences across different regions and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_40_step_1",
        "Diagram showing a bar graph comparing service preferences across different regions, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_40"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite types of YouTube content watched by students in different classes?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite types of YouTube content watched by students in different classes is a bar graph. It is perfect for comparing viewing preferences across different groups and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_41_step_1",
        "Diagram showing a bar graph comparing viewing preferences across different groups, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_41"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different video games played by gamers in various age groups?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "line graph",
      "pictograph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different video games played by gamers in various age groups is a bar graph. It is perfect for comparing gaming diversity across different demographics and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_42_step_1",
        "Diagram showing a bar graph comparing gaming diversity across different demographics, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_42"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the most popular meme formats shared by users on different social platforms?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "bar graph",
      "pictograph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the most popular meme formats shared by users on different social platforms is a bar graph. It is perfect for comparing content preferences across different platforms and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_43_step_1",
        "Diagram showing a bar graph comparing content preferences across different platforms, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_43"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite pizza toppings chosen by students in different cafeterias?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite pizza toppings chosen by students in different cafeterias is a bar graph. It is perfect for comparing food preferences across different locations and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_44_step_1",
        "Diagram showing a bar graph comparing food preferences across different locations, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_44"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different sports played by athletes in various high schools?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different sports played by athletes in various high schools is a bar graph. It is perfect for comparing athletic diversity across different institutions and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_45_step_1",
        "Diagram showing a bar graph comparing athletic diversity across different institutions, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_45"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the most preferred study subjects among students in different educational systems?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "bar graph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the most preferred study subjects among students in different educational systems is a bar graph. It is perfect for comparing academic interests across different systems and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_46_step_1",
        "Diagram showing a bar graph comparing academic interests across different systems, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_46"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite fashion brands worn by teenagers in different shopping malls?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "line graph",
      "pictograph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite fashion brands worn by teenagers in different shopping malls is a bar graph. It is perfect for comparing fashion preferences across different venues and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_47_step_1",
        "Diagram showing a bar graph comparing fashion preferences across different venues, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_47"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different musical instruments played by students in various orchestras?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different musical instruments played by students in various orchestras is a bar graph. It is perfect for comparing musical diversity across different ensembles and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_48_step_1",
        "Diagram showing a bar graph comparing musical diversity across different ensembles, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_48"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the most popular book genres read by students in different libraries?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the most popular book genres read by students in different libraries is a bar graph. It is perfect for comparing reading preferences across different facilities and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_49_step_1",
        "Diagram showing a bar graph comparing reading preferences across different facilities, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_49"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the favorite types of art created by students in different art classes?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "bar graph",
      "pictograph",
      "line graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the favorite types of art created by students in different art classes is a bar graph. It is perfect for comparing artistic preferences across different courses and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_50_step_1",
        "Diagram showing a bar graph comparing artistic preferences across different courses, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_50"
  },
  {
    "question_text": "Which type of graph would be most appropriate to display the number of different languages studied by students in various international schools?",
    "skills": "choose-the-best-type-of-graph",
    "question_type": "Multiple Choice Question with Single Answer",
    "tag": "Gr5_37_E3",
    "choices": [
      "pictograph",
      "line graph",
      "bar graph"
    ],
    "correct_answers": [
      "bar graph"
    ],
    "solution": [
      [
        "1/2",
        "The best type of graph to display the number of different languages studied by students in various international schools is a bar graph. It is perfect for comparing linguistic learning across different institutions and making easy comparisons."
      ],
      [
        "2/2",
        "A pictograph works best when data comes in natural groupings. A line graph shows changes over time, which doesn't apply to comparing different categories."
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr5_37_3_51_step_1",
        "Diagram showing a bar graph comparing linguistic learning across different institutions, illustrating why it's ideal for categorical comparisons."
      ]
    ],
    "question_number": "3_51"
  }
]