[
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Riverside to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Riverside, Georgetown, and Greenwood. Riverside is connected to Georgetown by a longer pink line labeled 8.4 km, and Georgetown is connected to Greenwood by a shorter pink line labeled 4.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Riverside to Greenwood via Georgetown.",
    "question_number": "1_1",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "13.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Greenwood: 8.4 km"
      ],
      [
        "3/5",
        "Greenwood to Greenwood: 4.7 km"
      ],
      [
        "4/5",
        "8.4 km + 4.7 km = 13.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Greenwood is 13.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Oakville, and Lakewood. Georgetown is connected to Oakville by a longer pink line labeled 8.8 km, and Oakville is connected to Lakewood by a shorter pink line labeled 4.1 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Lakewood via Oakville.",
    "question_number": "1_2",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Oakville: 8.8 km"
      ],
      [
        "3/5",
        "Oakville to Lakewood: 4.1 km"
      ],
      [
        "4/5",
        "8.8 km + 4.1 km = 12.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Lakewood is 12.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Vindale to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Vindale, Oakville, and Lakewood. Vindale is connected to Oakville by a longer pink line labeled 5.4 km, and Oakville is connected to Lakewood by a shorter pink line labeled 5.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Vindale to Lakewood via Oakville.",
    "question_number": "1_3",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "10.7"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Oakville to Oakville: 5.4 km"
      ],
      [
        "3/5",
        "Oakville to Lakewood: 5.3 km"
      ],
      [
        "4/5",
        "5.4 km + 5.3 km = 10.7 km"
      ],
      [
        "5/5",
        "So, the total distance from Oakville to Lakewood is 10.7 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Riverside to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Riverside, Hillside, and Lakewood. Riverside is connected to Hillside by a longer pink line labeled 7.1 km, and Hillside is connected to Lakewood by a shorter pink line labeled 2.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Riverside to Lakewood via Hillside.",
    "question_number": "1_4",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "9.5"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Hillside: 7.1 km"
      ],
      [
        "3/5",
        "Hillside to Lakewood: 2.4 km"
      ],
      [
        "4/5",
        "7.1 km + 2.4 km = 9.5 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Lakewood is 9.5 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Hillside to Riverside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Hillside, Lakewood, and Riverside. Hillside is connected to Lakewood by a longer pink line labeled 4.5 km, and Lakewood is connected to Riverside by a shorter pink line labeled 2.9 km. Each location is marked with a small blue dot, and the points form an open, angled path from Hillside to Riverside via Lakewood.",
    "question_number": "1_5",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "7.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Hillside to Lakewood: 4.5 km"
      ],
      [
        "3/5",
        "Lakewood to Riverside: 2.9 km"
      ],
      [
        "4/5",
        "4.5 km + 2.9 km = 7.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Hillside to Riverside is 7.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Hillside to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Hillside, Riverside, and Lakewood. Hillside is connected to Riverside by a longer pink line labeled 3.3 km, and Riverside is connected to Lakewood by a shorter pink line labeled 3.1 km. Each location is marked with a small blue dot, and the points form an open, angled path from Hillside to Lakewood via Riverside.",
    "question_number": "1_6",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "6.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Hillside to Riverside: 3.3 km"
      ],
      [
        "3/5",
        "Riverside to Lakewood: 3.1 km"
      ],
      [
        "4/5",
        "3.3 km + 3.1 km = 6.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Hillside to Lakewood is 6.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Georgetown?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Springdale, and Georgetown. Lakewood is connected to Springdale by a longer pink line labeled 9.9 km, and Springdale is connected to Georgetown by a shorter pink line labeled 9.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Georgetown via Springdale.",
    "question_number": "1_7",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "19.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Springdale: 9.9 km"
      ],
      [
        "3/5",
        "Springdale to Georgetown: 9.3 km"
      ],
      [
        "4/5",
        "9.9 km + 9.3 km = 19.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Georgetown is 19.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Oakville to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Oakville, Greenwood, and Lakewood. Oakville is connected to Greenwood by a shorter pink line labeled 4.5 km, and Greenwood is connected to Lakewood by a longer pink line labeled 4.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Oakville to Lakewood via Greenwood.",
    "question_number": "1_8",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "9.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Oakville to Greenwood: 4.5 km"
      ],
      [
        "3/5",
        "Greenwood to Lakewood: 4.7 km"
      ],
      [
        "4/5",
        "4.5 km + 4.7 km = 9.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Oakville to Lakewood is 9.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Vindale to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Vindale, Springdale, and Lakewood. Vindale is connected to Springdale by a shorter pink line labeled 1.6 km, and Springdale is connected to Lakewood by a longer pink line labeled 2.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Vindale to Lakewood via Springdale.",
    "question_number": "1_9",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "3.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Springdale to Springdale: 1.6 km"
      ],
      [
        "3/5",
        "Springdale to Lakewood: 2.3 km"
      ],
      [
        "4/5",
        "1.6 km + 2.3 km = 3.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Springdale to Lakewood is 3.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Meadowbrook to Riverside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Meadowbrook, Oakville, and Riverside. Meadowbrook is connected to Oakville by a shorter pink line labeled 4.6 km, and Oakville is connected to Riverside by a longer pink line labeled 7.8 km. Each location is marked with a small blue dot, and the points form an open, angled path from Meadowbrook to Riverside via Oakville.",
    "question_number": "1_10",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Meadowbrook to Oakville: 4.6 km"
      ],
      [
        "3/5",
        "Oakville to Riverside: 7.8 km"
      ],
      [
        "4/5",
        "4.6 km + 7.8 km = 12.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Meadowbrook to Riverside is 12.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Hillside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Riverside, and Hillside. Lakewood is connected to Riverside by a shorter pink line labeled 3.0 km, and Riverside is connected to Hillside by a longer pink line labeled 7.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Hillside via Riverside.",
    "question_number": "1_11",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "10.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Riverside: 3.0 km"
      ],
      [
        "3/5",
        "Riverside to Hillside: 7.4 km"
      ],
      [
        "4/5",
        "3.0 km + 7.4 km = 10.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Hillside is 10.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Meadowbrook to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Meadowbrook, Vindale, and Springdale. Meadowbrook is connected to Vindale by a longer pink line labeled 6.9 km, and Vindale is connected to Springdale by a shorter pink line labeled 6.5 km. Each location is marked with a small blue dot, and the points form an open, angled path from Meadowbrook to Springdale via Vindale.",
    "question_number": "1_12",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "13.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Meadowbrook to Vindale: 6.9 km"
      ],
      [
        "3/5",
        "Vindale to Springdale: 6.5 km"
      ],
      [
        "4/5",
        "6.9 km + 6.5 km = 13.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Meadowbrook to Springdale is 13.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Riverside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Fairview, and Riverside. Georgetown is connected to Fairview by a shorter pink line labeled 6.0 km, and Fairview is connected to Riverside by a longer pink line labeled 9.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Riverside via Fairview.",
    "question_number": "1_13",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "15.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Fairview: 6.0 km"
      ],
      [
        "3/5",
        "Fairview to Riverside: 9.4 km"
      ],
      [
        "4/5",
        "6.0 km + 9.4 km = 15.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Riverside is 15.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Meadowbrook, and Greenwood. Georgetown is connected to Meadowbrook by a shorter pink line labeled 7.5 km, and Meadowbrook is connected to Greenwood by a longer pink line labeled 9.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Greenwood via Meadowbrook.",
    "question_number": "1_14",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "17.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Meadowbrook: 7.5 km"
      ],
      [
        "3/5",
        "Meadowbrook to Greenwood: 9.7 km"
      ],
      [
        "4/5",
        "7.5 km + 9.7 km = 17.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Greenwood is 17.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Hillside to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Hillside, Springdale, and Greenwood. Hillside is connected to Springdale by a longer pink line labeled 7.6 km, and Springdale is connected to Greenwood by a shorter pink line labeled 5.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Hillside to Greenwood via Springdale.",
    "question_number": "1_15",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Hillside to Springdale: 7.6 km"
      ],
      [
        "3/5",
        "Springdale to Greenwood: 5.3 km"
      ],
      [
        "4/5",
        "7.6 km + 5.3 km = 12.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Hillside to Greenwood is 12.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Springdale to Oakville?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Springdale, Meadowbrook, and Oakville. Springdale is connected to Meadowbrook by a longer pink line labeled 9.6 km, and Meadowbrook is connected to Oakville by a shorter pink line labeled 5.1 km. Each location is marked with a small blue dot, and the points form an open, angled path from Springdale to Oakville via Meadowbrook.",
    "question_number": "1_16",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "14.7"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Springdale to Meadowbrook: 9.6 km"
      ],
      [
        "3/5",
        "Meadowbrook to Oakville: 5.1 km"
      ],
      [
        "4/5",
        "9.6 km + 5.1 km = 14.7 km"
      ],
      [
        "5/5",
        "So, the total distance from Springdale to Oakville is 14.7 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Oakville?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Meadowbrook, and Oakville. Georgetown is connected to Meadowbrook by a longer pink line labeled 8.9 km, and Meadowbrook is connected to Oakville by a shorter pink line labeled 2.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Oakville via Meadowbrook.",
    "question_number": "1_17",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "11.6"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Oakville to Meadowbrook: 8.9 km"
      ],
      [
        "3/5",
        "Meadowbrook to Oakville: 2.7 km"
      ],
      [
        "4/5",
        "8.9 km + 2.7 km = 11.6 km"
      ],
      [
        "5/5",
        "So, the total distance from Oakville to Oakville is 11.6 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Greenwood to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Greenwood, Georgetown, and Springdale. Greenwood is connected to Georgetown by a shorter pink line labeled 4.2 km, and Georgetown is connected to Springdale by a longer pink line labeled 5.9 km. Each location is marked with a small blue dot, and the points form an open, angled path from Greenwood to Springdale via Georgetown.",
    "question_number": "1_18",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "10.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Springdale: 4.2 km"
      ],
      [
        "3/5",
        "Springdale to Springdale: 5.9 km"
      ],
      [
        "4/5",
        "4.2 km + 5.9 km = 10.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Springdale is 10.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Greenwood to Riverside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Greenwood, Georgetown, and Riverside. Greenwood is connected to Georgetown by a longer pink line labeled 7.6 km, and Georgetown is connected to Riverside by a shorter pink line labeled 4.5 km. Each location is marked with a small blue dot, and the points form an open, angled path from Greenwood to Riverside via Georgetown.",
    "question_number": "1_19",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Riverside: 7.6 km"
      ],
      [
        "3/5",
        "Riverside to Riverside: 4.5 km"
      ],
      [
        "4/5",
        "7.6 km + 4.5 km = 12.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Riverside is 12.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Riverside to Hillside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Riverside, Springdale, and Hillside. Riverside is connected to Springdale by a longer pink line labeled 9.3 km, and Springdale is connected to Hillside by a shorter pink line labeled 5.8 km. Each location is marked with a small blue dot, and the points form an open, angled path from Riverside to Hillside via Springdale.",
    "question_number": "1_20",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "15.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Springdale: 9.3 km"
      ],
      [
        "3/5",
        "Springdale to Hillside: 5.8 km"
      ],
      [
        "4/5",
        "9.3 km + 5.8 km = 15.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Hillside is 15.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Meadowbrook, and Springdale. Lakewood is connected to Meadowbrook by a shorter pink line labeled 2.2 km, and Meadowbrook is connected to Springdale by a longer pink line labeled 7.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Springdale via Meadowbrook.",
    "question_number": "1_21",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "9.5"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Meadowbrook: 2.2 km"
      ],
      [
        "3/5",
        "Meadowbrook to Springdale: 7.3 km"
      ],
      [
        "4/5",
        "2.2 km + 7.3 km = 9.5 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Springdale is 9.5 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Georgetown?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Meadowbrook, and Georgetown. Lakewood is connected to Meadowbrook by a shorter pink line labeled 8.7 km, and Meadowbrook is connected to Georgetown by a longer pink line labeled 9.2 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Georgetown via Meadowbrook.",
    "question_number": "1_22",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "17.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Meadowbrook: 8.7 km"
      ],
      [
        "3/5",
        "Meadowbrook to Georgetown: 9.2 km"
      ],
      [
        "4/5",
        "8.7 km + 9.2 km = 17.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Georgetown is 17.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Meadowbrook to Hillside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Meadowbrook, Vindale, and Hillside. Meadowbrook is connected to Vindale by a longer pink line labeled 6.5 km, and Vindale is connected to Hillside by a shorter pink line labeled 3.8 km. Each location is marked with a small blue dot, and the points form an open, angled path from Meadowbrook to Hillside via Vindale.",
    "question_number": "1_23",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "10.3"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Meadowbrook to Vindale: 6.5 km"
      ],
      [
        "3/5",
        "Vindale to Hillside: 3.8 km"
      ],
      [
        "4/5",
        "6.5 km + 3.8 km = 10.3 km"
      ],
      [
        "5/5",
        "So, the total distance from Meadowbrook to Hillside is 10.3 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Oakville, and Springdale. Georgetown is connected to Oakville by a longer pink line labeled 3.7 km, and Oakville is connected to Springdale by a shorter pink line labeled 3.0 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Springdale via Oakville.",
    "question_number": "1_24",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "6.7"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Springdale to Oakville: 3.7 km"
      ],
      [
        "3/5",
        "Oakville to Springdale: 3.0 km"
      ],
      [
        "4/5",
        "3.7 km + 3.0 km = 6.7 km"
      ],
      [
        "5/5",
        "So, the total distance from Springdale to Springdale is 6.7 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Fairview to Meadowbrook?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Fairview, Springdale, and Meadowbrook. Fairview is connected to Springdale by a longer pink line labeled 9.5 km, and Springdale is connected to Meadowbrook by a shorter pink line labeled 7.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Fairview to Meadowbrook via Springdale.",
    "question_number": "1_25",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "16.8"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Fairview to Springdale: 9.5 km"
      ],
      [
        "3/5",
        "Springdale to Meadowbrook: 7.3 km"
      ],
      [
        "4/5",
        "9.5 km + 7.3 km = 16.8 km"
      ],
      [
        "5/5",
        "So, the total distance from Fairview to Meadowbrook is 16.8 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Meadowbrook?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Georgetown, and Meadowbrook. Lakewood is connected to Georgetown by a shorter pink line labeled 3.4 km, and Georgetown is connected to Meadowbrook by a longer pink line labeled 3.9 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Meadowbrook via Georgetown.",
    "question_number": "1_26",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "7.3"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Meadowbrook: 3.4 km"
      ],
      [
        "3/5",
        "Meadowbrook to Meadowbrook: 3.9 km"
      ],
      [
        "4/5",
        "3.4 km + 3.9 km = 7.3 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Meadowbrook is 7.3 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Fairview to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Fairview, Greenwood, and Springdale. Fairview is connected to Greenwood by a longer pink line labeled 8.3 km, and Greenwood is connected to Springdale by a shorter pink line labeled 4.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Fairview to Springdale via Greenwood.",
    "question_number": "1_27",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.7"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Fairview to Greenwood: 8.3 km"
      ],
      [
        "3/5",
        "Greenwood to Springdale: 4.4 km"
      ],
      [
        "4/5",
        "8.3 km + 4.4 km = 12.7 km"
      ],
      [
        "5/5",
        "So, the total distance from Fairview to Springdale is 12.7 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Riverside to Vindale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Riverside, Meadowbrook, and Vindale. Riverside is connected to Meadowbrook by a longer pink line labeled 6.5 km, and Meadowbrook is connected to Vindale by a shorter pink line labeled 5.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Riverside to Vindale via Meadowbrook.",
    "question_number": "1_28",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "11.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Meadowbrook: 6.5 km"
      ],
      [
        "3/5",
        "Meadowbrook to Vindale: 5.4 km"
      ],
      [
        "4/5",
        "6.5 km + 5.4 km = 11.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Vindale is 11.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Greenwood to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Greenwood, Fairview, and Lakewood. Greenwood is connected to Fairview by a longer pink line labeled 6.1 km, and Fairview is connected to Lakewood by a shorter pink line labeled 3.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Greenwood to Lakewood via Fairview.",
    "question_number": "1_29",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "9.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Fairview: 6.1 km"
      ],
      [
        "3/5",
        "Fairview to Lakewood: 3.3 km"
      ],
      [
        "4/5",
        "6.1 km + 3.3 km = 9.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Lakewood is 9.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Vindale to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Vindale, Greenwood, and Springdale. Vindale is connected to Greenwood by a shorter pink line labeled 2.7 km, and Greenwood is connected to Springdale by a longer pink line labeled 3.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Vindale to Springdale via Greenwood.",
    "question_number": "1_30",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "6.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Greenwood: 2.7 km"
      ],
      [
        "3/5",
        "Greenwood to Springdale: 3.4 km"
      ],
      [
        "4/5",
        "2.7 km + 3.4 km = 6.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Springdale is 6.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Meadowbrook?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Springdale, and Meadowbrook. Georgetown is connected to Springdale by a shorter pink line labeled 4.1 km, and Springdale is connected to Meadowbrook by a longer pink line labeled 7.8 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Meadowbrook via Springdale.",
    "question_number": "1_31",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "11.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Meadowbrook to Springdale: 4.1 km"
      ],
      [
        "3/5",
        "Springdale to Meadowbrook: 7.8 km"
      ],
      [
        "4/5",
        "4.1 km + 7.8 km = 11.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Meadowbrook to Meadowbrook is 11.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Riverside to Vindale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Riverside, Fairview, and Vindale. Riverside is connected to Fairview by a shorter pink line labeled 2.9 km, and Fairview is connected to Vindale by a longer pink line labeled 5.9 km. Each location is marked with a small blue dot, and the points form an open, angled path from Riverside to Vindale via Fairview.",
    "question_number": "1_32",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "8.8"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Fairview: 2.9 km"
      ],
      [
        "3/5",
        "Fairview to Vindale: 5.9 km"
      ],
      [
        "4/5",
        "2.9 km + 5.9 km = 8.8 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Vindale is 8.8 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Oakville to Georgetown?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Oakville, Greenwood, and Georgetown. Oakville is connected to Greenwood by a shorter pink line labeled 2.6 km, and Greenwood is connected to Georgetown by a longer pink line labeled 7.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Oakville to Georgetown via Greenwood.",
    "question_number": "1_33",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "10.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Oakville to Greenwood: 2.6 km"
      ],
      [
        "3/5",
        "Greenwood to Georgetown: 7.6 km"
      ],
      [
        "4/5",
        "2.6 km + 7.6 km = 10.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Oakville to Georgetown is 10.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Georgetown?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Oakville, and Georgetown. Lakewood is connected to Oakville by a shorter pink line labeled 6.5 km, and Oakville is connected to Georgetown by a longer pink line labeled 8.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Georgetown via Oakville.",
    "question_number": "1_34",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "15.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Oakville: 6.5 km"
      ],
      [
        "3/5",
        "Oakville to Georgetown: 8.7 km"
      ],
      [
        "4/5",
        "6.5 km + 8.7 km = 15.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Georgetown is 15.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Hillside to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Hillside, Lakewood, and Greenwood. Hillside is connected to Lakewood by a shorter pink line labeled 1.9 km, and Lakewood is connected to Greenwood by a longer pink line labeled 9.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Hillside to Greenwood via Lakewood.",
    "question_number": "1_35",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "11.5"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Hillside to Lakewood: 1.9 km"
      ],
      [
        "3/5",
        "Lakewood to Greenwood: 9.6 km"
      ],
      [
        "4/5",
        "1.9 km + 9.6 km = 11.5 km"
      ],
      [
        "5/5",
        "So, the total distance from Hillside to Greenwood is 11.5 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Oakville?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Greenwood, and Oakville. Lakewood is connected to Greenwood by a shorter pink line labeled 4.2 km, and Greenwood is connected to Oakville by a longer pink line labeled 7.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Oakville via Greenwood.",
    "question_number": "1_36",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "11.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Greenwood: 4.2 km"
      ],
      [
        "3/5",
        "Greenwood to Oakville: 7.7 km"
      ],
      [
        "4/5",
        "4.2 km + 7.7 km = 11.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Oakville is 11.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Fairview to Meadowbrook?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Fairview, Hillside, and Meadowbrook. Fairview is connected to Hillside by a shorter pink line labeled 8.4 km, and Hillside is connected to Meadowbrook by a longer pink line labeled 9.2 km. Each location is marked with a small blue dot, and the points form an open, angled path from Fairview to Meadowbrook via Hillside.",
    "question_number": "1_37",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "17.6"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Fairview to Hillside: 8.4 km"
      ],
      [
        "3/5",
        "Hillside to Meadowbrook: 9.2 km"
      ],
      [
        "4/5",
        "8.4 km + 9.2 km = 17.6 km"
      ],
      [
        "5/5",
        "So, the total distance from Fairview to Meadowbrook is 17.6 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Meadowbrook to Georgetown?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Meadowbrook, Hillside, and Georgetown. Meadowbrook is connected to Hillside by a pink line labeled 8.7 km, and Hillside is connected to Georgetown by a pink line labeled 8.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Meadowbrook to Georgetown via Hillside.",
    "question_number": "1_38",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "17.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Meadowbrook to Hillside: 8.7 km"
      ],
      [
        "3/5",
        "Hillside to Georgetown: 8.7 km"
      ],
      [
        "4/5",
        "8.7 km + 8.7 km = 17.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Meadowbrook to Georgetown is 17.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Springdale to Lakewood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Springdale, Fairview, and Lakewood. Springdale is connected to Fairview by a shorter pink line labeled 6.1 km, and Fairview is connected to Lakewood by a longer pink line labeled 9.2 km. Each location is marked with a small blue dot, and the points form an open, angled path from Springdale to Lakewood via Fairview.",
    "question_number": "1_39",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "15.3"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Springdale to Fairview: 6.1 km"
      ],
      [
        "3/5",
        "Fairview to Lakewood: 9.2 km"
      ],
      [
        "4/5",
        "6.1 km + 9.2 km = 15.3 km"
      ],
      [
        "5/5",
        "So, the total distance from Springdale to Lakewood is 15.3 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Oakville to Vindale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Oakville, Riverside, and Vindale. Oakville is connected to Riverside by a shorter pink line labeled 3.1 km, and Riverside is connected to Vindale by a longer pink line labeled 9.3 km. Each location is marked with a small blue dot, and the points form an open, angled path from Oakville to Vindale via Riverside.",
    "question_number": "1_40",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Oakville to Riverside: 3.1 km"
      ],
      [
        "3/5",
        "Riverside to Vindale: 9.3 km"
      ],
      [
        "4/5",
        "3.1 km + 9.3 km = 12.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Oakville to Vindale is 12.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Hillside, and Greenwood. Lakewood is connected to Hillside by a shorter pink line labeled 8.8 km, and Hillside is connected to Greenwood by a longer pink line labeled 9.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Greenwood via Hillside.",
    "question_number": "1_41",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "18.4"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Hillside: 8.8 km"
      ],
      [
        "3/5",
        "Hillside to Greenwood: 9.6 km"
      ],
      [
        "4/5",
        "8.8 km + 9.6 km = 18.4 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Greenwood is 18.4 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Springdale to Fairview?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Springdale, Hillside, and Fairview. Springdale is connected to Hillside by a shorter pink line labeled 5.5 km, and Hillside is connected to Fairview by a longer pink line labeled 7.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Springdale to Fairview via Hillside.",
    "question_number": "1_42",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "13.1"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Springdale to Hillside: 5.5 km"
      ],
      [
        "3/5",
        "Hillside to Fairview: 7.6 km"
      ],
      [
        "4/5",
        "5.5 km + 7.6 km = 13.1 km"
      ],
      [
        "5/5",
        "So, the total distance from Springdale to Fairview is 13.1 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Vindale to Fairview?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Vindale, Lakewood, and Fairview. Vindale is connected to Lakewood by a shorter pink line labeled 6.6 km, and Lakewood is connected to Fairview by a longer pink line labeled 9.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Vindale to Fairview via Lakewood.",
    "question_number": "1_43",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "16.3"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Lakewood: 6.6 km"
      ],
      [
        "3/5",
        "Lakewood to Fairview: 9.7 km"
      ],
      [
        "4/5",
        "6.6 km + 9.7 km = 16.3 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Fairview is 16.3 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Springdale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Vindale, and Springdale. Lakewood is connected to Vindale by a shorter pink line labeled 5.9 km, and Vindale is connected to Springdale by a longer pink line labeled 8.8 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Springdale via Vindale.",
    "question_number": "1_44",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "14.7"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Vindale: 5.9 km"
      ],
      [
        "3/5",
        "Vindale to Springdale: 8.8 km"
      ],
      [
        "4/5",
        "5.9 km + 8.8 km = 14.7 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Springdale is 14.7 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Fairview to Vindale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Fairview, Georgetown, and Vindale. Fairview is connected to Georgetown by a longer pink line labeled 7.9 km, and Georgetown is connected to Vindale by a shorter pink line labeled 5.0 km. Each location is marked with a small blue dot, and the points form an open, angled path from Fairview to Vindale via Georgetown.",
    "question_number": "1_45",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12.9"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Fairview to Vindale: 7.9 km"
      ],
      [
        "3/5",
        "Vindale to Vindale: 5.0 km"
      ],
      [
        "4/5",
        "7.9 km + 5.0 km = 12.9 km"
      ],
      [
        "5/5",
        "So, the total distance from Fairview to Vindale is 12.9 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Hillside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Fairview, and Hillside. Georgetown is connected to Fairview by a longer pink line labeled 9.6 km, and Fairview is connected to Hillside by a shorter pink line labeled 8.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Hillside via Fairview.",
    "question_number": "1_46",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "18.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Hillside to Fairview: 9.6 km"
      ],
      [
        "3/5",
        "Fairview to Hillside: 8.6 km"
      ],
      [
        "4/5",
        "9.6 km + 8.6 km = 18.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Hillside to Hillside is 18.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Riverside?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Hillside, and Riverside. Georgetown is connected to Hillside by a shorter pink line labeled 3.8 km, and Hillside is connected to Riverside by a longer pink line labeled 4.4 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Riverside via Hillside.",
    "question_number": "1_47",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "8.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Riverside to Hillside: 3.8 km"
      ],
      [
        "3/5",
        "Hillside to Riverside: 4.4 km"
      ],
      [
        "4/5",
        "3.8 km + 4.4 km = 8.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Riverside to Riverside is 8.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Georgetown to Greenwood?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Georgetown, Lakewood, and Greenwood. Georgetown is connected to Lakewood by a shorter pink line labeled 3.5 km, and Lakewood is connected to Greenwood by a longer pink line labeled 3.7 km. Each location is marked with a small blue dot, and the points form an open, angled path from Georgetown to Greenwood via Lakewood.",
    "question_number": "1_48",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "7.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Greenwood to Lakewood: 3.5 km"
      ],
      [
        "3/5",
        "Lakewood to Greenwood: 3.7 km"
      ],
      [
        "4/5",
        "3.5 km + 3.7 km = 7.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Greenwood to Greenwood is 7.2 kilometres."
      ]
    ]
  },
  {
    "skills": "maps-with-decimal-distances",
    "question_text": "Using the paths shown, how far is it from Lakewood to Vindale?\n___ km ",
    "tag": "Gr6_15_E5",
    "image_tag": "Gr6_15_5_2",
    "backend_description": "This image shows a map connecting three locations: Lakewood, Greenwood, and Vindale. Lakewood is connected to Greenwood by a shorter pink line labeled 1.6 km, and Greenwood is connected to Vindale by a longer pink line labeled 6.6 km. Each location is marked with a small blue dot, and the points form an open, angled path from Lakewood to Vindale via Greenwood.",
    "question_number": "1_49",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "8.2"
    ],
    "solution": [
      [
        "1/5",
        "To find the total distance, add up the paths:"
      ],
      [
        "2/5",
        "Lakewood to Greenwood: 1.6 km"
      ],
      [
        "3/5",
        "Greenwood to Vindale: 6.6 km"
      ],
      [
        "4/5",
        "1.6 km + 6.6 km = 8.2 km"
      ],
      [
        "5/5",
        "So, the total distance from Lakewood to Vindale is 8.2 kilometres."
      ]
    ]
  }
]