[
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$125 \\times 45$",
    "tag": "Gr6_8_E1",
    "question_number": "8_1",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "5625"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_1_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 125 is highlighted in blue, along with the 5 multiplier. The product 5×5=25 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_1_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 125 is highlighted in blue, along with the 5 multiplier. The product 2×5=10, plus the carried 2, equals 12. The digit 2 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_1_step_3",
        "The image shows step 3 of vertical multiplication. The digit 1 in the hundreds place of 125 is highlighted in blue, along with the 5 multiplier. The product 1×5=5, plus the carried 1, equals 6. The digit 6 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_1_step_4",
        "The image shows step 4 of vertical multiplication. The digit 4 in the tens place of 45 is highlighted in blue, along with each digit of 125 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×4=20, 2×4=8, 1×4=4. The second partial product, 5000, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_1_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 625 and 5000 are stacked and highlighted. The addition is performed column by column, resulting in the final product 5625, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $125 \\times 45$."
      ],
      [
        "2/3",
        "Multiply $125 \\times 45$."
      ],
      [
        "3/3",
        "The product is 5,625."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$27 \\times 854$",
    "tag": "Gr6_8_E1",
    "question_number": "8_2",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "23058"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_2_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 27 is highlighted in blue, along with the 4 multiplier. The product 7×4=28 is written below the line: the digit 8 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_2_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 27 is highlighted in blue, along with the 4 multiplier. The product 2×4=8, plus the carried 2, equals 10. The digit 0 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_2_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 108 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_2_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 854 is highlighted in blue, along with each digit of 27 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×5=35, 2×5=10. The second partial product, 1350, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_2_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 108 and 1350 are stacked and highlighted. The addition is performed column by column, resulting in the final product 23058, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $27 \\times 854$."
      ],
      [
        "2/3",
        "Multiply $27 \\times 854$."
      ],
      [
        "3/3",
        "The product is 23,058."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$21 \\times 85$",
    "tag": "Gr6_8_E1",
    "question_number": "8_3",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "1785"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_3_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 21 is highlighted in blue, along with the 5 multiplier. The product 1×5=5 is written below the line: the digit 5 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_3_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 21 is highlighted in blue, along with the 5 multiplier. The product 2×5=10. The digit 0 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_3_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 105 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_3_step_4",
        "The image shows step 4 of vertical multiplication. The digit 8 in the tens place of 85 is highlighted in blue, along with each digit of 21 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×8=8, 2×8=16. The second partial product, 1680, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_3_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 105 and 1680 are stacked and highlighted. The addition is performed column by column, resulting in the final product 1785, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $21 \\times 85$."
      ],
      [
        "2/3",
        "Multiply $21 \\times 85$."
      ],
      [
        "3/3",
        "The product is 1,785."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$130 \\times 21$",
    "tag": "Gr6_8_E1",
    "question_number": "8_4",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "2730"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_4_step_1",
        "The image shows step 1 of vertical multiplication. The digit 0 in the ones place of 130 is highlighted in blue, along with the 1 multiplier. The product 0×1=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_4_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 130 is highlighted in blue, along with the 1 multiplier. The product 3×1=3. The digit 3 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_4_step_3",
        "The image shows step 3 of vertical multiplication. The digit 1 in the hundreds place of 130 is highlighted in blue, along with the 1 multiplier. The product 1×1=1. The digit 1 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_4_step_4",
        "The image shows step 4 of vertical multiplication. The digit 2 in the tens place of 21 is highlighted in blue, along with each digit of 130 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 0×2=0, 3×2=6, 1×2=2. The second partial product, 2600, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_4_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 130 and 2600 are stacked and highlighted. The addition is performed column by column, resulting in the final product 2730, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $130 \\times 21$."
      ],
      [
        "2/3",
        "Multiply $130 \\times 21$."
      ],
      [
        "3/3",
        "The product is 2,730."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$74 \\times 716$",
    "tag": "Gr6_8_E1",
    "question_number": "8_5",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "52984"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_5_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 74 is highlighted in blue, along with the 6 multiplier. The product 4×6=24 is written below the line: the digit 4 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_5_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 74 is highlighted in blue, along with the 6 multiplier. The product 7×6=42, plus the carried 2, equals 44. The digit 4 is placed in the tens column in blue, and the carry 4 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_5_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 444 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_5_step_4",
        "The image shows step 4 of vertical multiplication. The digit 1 in the tens place of 716 is highlighted in blue, along with each digit of 74 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×1=4, 7×1=7. The second partial product, 740, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_5_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 444 and 740 are stacked and highlighted. The addition is performed column by column, resulting in the final product 52984, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $74 \\times 716$."
      ],
      [
        "2/3",
        "Multiply $74 \\times 716$."
      ],
      [
        "3/3",
        "The product is 52,984."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$35 \\times 93$",
    "tag": "Gr6_8_E1",
    "question_number": "8_6",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "3255"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_6_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 35 is highlighted in blue, along with the 3 multiplier. The product 5×3=15 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_6_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 35 is highlighted in blue, along with the 3 multiplier. The product 3×3=9, plus the carried 1, equals 10. The digit 0 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_6_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 105 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_6_step_4",
        "The image shows step 4 of vertical multiplication. The digit 9 in the tens place of 93 is highlighted in blue, along with each digit of 35 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×9=45, 3×9=27. The second partial product, 3150, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_6_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 105 and 3150 are stacked and highlighted. The addition is performed column by column, resulting in the final product 3255, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $35 \\times 93$."
      ],
      [
        "2/3",
        "Multiply $35 \\times 93$."
      ],
      [
        "3/3",
        "The product is 3,255."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$325 \\times 559$",
    "tag": "Gr6_8_E1",
    "question_number": "8_7",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "181675"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_7_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 325 is highlighted in blue, along with the 9 multiplier. The product 5×9=45 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 4 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_7_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 325 is highlighted in blue, along with the 9 multiplier. The product 2×9=18, plus the carried 4, equals 22. The digit 2 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_7_step_3",
        "The image shows step 3 of vertical multiplication. The digit 3 in the hundreds place of 325 is highlighted in blue, along with the 9 multiplier. The product 3×9=27, plus the carried 2, equals 29. The digit 9 is placed in the hundreds column in blue, and the carry 2 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_7_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 559 is highlighted in blue, along with each digit of 325 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×5=25, 2×5=10, 3×5=15. The second partial product, 16250, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_7_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 2925 and 16250 are stacked and highlighted. The addition is performed column by column, resulting in the final product 181675, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $325 \\times 559$."
      ],
      [
        "2/3",
        "Multiply $325 \\times 559$."
      ],
      [
        "3/3",
        "The product is 181,675."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$1106 \\times 4$",
    "tag": "Gr6_8_E1",
    "question_number": "8_8",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "4424"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_8_step_1",
        "The image shows step 1 of vertical multiplication. The digit 6 in the ones place of 1106 is highlighted in blue, along with the 4 multiplier. The product 6×4=24 is written below the line: the digit 4 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_8_step_2",
        "The image shows step 2 of vertical multiplication. The digit 0 in the tens place of 1106 is highlighted in blue, along with the 4 multiplier. The product 0×4=0, plus the carried 2, equals 2. The digit 2 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_8_step_3",
        "The image shows step 3 of vertical multiplication. The digit 1 in the hundreds place of 1106 is highlighted in blue, along with the 4 multiplier. The product 1×4=4. The digit 4 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_8_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 4 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_8_step_5",
        "The image shows step 5 of vertical multiplication. The final product 4424 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $6 \\times 4$. \n$6 \\times 4 = 24$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $0 \\times 4$. \n$0 \\times 4 = 0$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $1 \\times 4$. \n$1 \\times 4 = 4$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $1 \\times 4$. \n$1 \\times 4 = 4$"
      ],
      [
        "5/5",
        "The product is 4,424."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$5552 \\times 4$",
    "tag": "Gr6_8_E1",
    "question_number": "8_9",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "22208"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_9_step_1",
        "The image shows step 1 of vertical multiplication. The digit 2 in the ones place of 5552 is highlighted in blue, along with the 4 multiplier. The product 2×4=8 is written below the line: the digit 8 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_9_step_2",
        "The image shows step 2 of vertical multiplication. The digit 5 in the tens place of 5552 is highlighted in blue, along with the 4 multiplier. The product 5×4=20. The digit 0 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_9_step_3",
        "The image shows step 3 of vertical multiplication. The digit 5 in the hundreds place of 5552 is highlighted in blue, along with the 4 multiplier. The product 5×4=20, plus the carried 2, equals 22. The digit 2 is placed in the hundreds column in blue, and the carry 2 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_9_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 4 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_9_step_5",
        "The image shows step 5 of vertical multiplication. The final product 22208 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $2 \\times 4$. \n$2 \\times 4 = 8$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $5 \\times 4$. \n$5 \\times 4 = 20$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $5 \\times 4$. \n$5 \\times 4 = 20$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $5 \\times 4$. \n$5 \\times 4 = 20$"
      ],
      [
        "5/5",
        "The product is 22,208."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$2674 \\times 3$",
    "tag": "Gr6_8_E1",
    "question_number": "8_10",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "8022"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_10_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 2674 is highlighted in blue, along with the 3 multiplier. The product 4×3=12 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_10_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 2674 is highlighted in blue, along with the 3 multiplier. The product 7×3=21, plus the carried 1, equals 22. The digit 2 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_10_step_3",
        "The image shows step 3 of vertical multiplication. The digit 6 in the hundreds place of 2674 is highlighted in blue, along with the 3 multiplier. The product 6×3=18, plus the carried 2, equals 20. The digit 0 is placed in the hundreds column in blue, and the carry 2 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_10_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 3 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_10_step_5",
        "The image shows step 5 of vertical multiplication. The final product 8022 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $4 \\times 3$. \n$4 \\times 3 = 12$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $7 \\times 3$. \n$7 \\times 3 = 21$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $6 \\times 3$. \n$6 \\times 3 = 18$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $2 \\times 3$. \n$2 \\times 3 = 6$"
      ],
      [
        "5/5",
        "The product is 8,022."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$467 \\times 54$",
    "tag": "Gr6_8_E1",
    "question_number": "8_11",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "25218"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_11_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 467 is highlighted in blue, along with the 4 multiplier. The product 7×4=28 is written below the line: the digit 8 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_11_step_2",
        "The image shows step 2 of vertical multiplication. The digit 6 in the tens place of 467 is highlighted in blue, along with the 4 multiplier. The product 6×4=24, plus the carried 2, equals 26. The digit 6 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_11_step_3",
        "The image shows step 3 of vertical multiplication. The digit 4 in the hundreds place of 467 is highlighted in blue, along with the 4 multiplier. The product 4×4=16, plus the carried 2, equals 18. The digit 8 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_11_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 54 is highlighted in blue, along with each digit of 467 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×5=35, 6×5=30, 4×5=20. The second partial product, 23350, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_11_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 1868 and 23350 are stacked and highlighted. The addition is performed column by column, resulting in the final product 25218, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $467 \\times 54$."
      ],
      [
        "2/3",
        "Multiply $467 \\times 54$."
      ],
      [
        "3/3",
        "The product is 25,218."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$1711 \\times 9$",
    "tag": "Gr6_8_E1",
    "question_number": "8_12",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "15399"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_12_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 1711 is highlighted in blue, along with the 9 multiplier. The product 1×9=9 is written below the line: the digit 9 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_12_step_2",
        "The image shows step 2 of vertical multiplication. The digit 1 in the tens place of 1711 is highlighted in blue, along with the 9 multiplier. The product 1×9=9. The digit 9 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_12_step_3",
        "The image shows step 3 of vertical multiplication. The digit 7 in the hundreds place of 1711 is highlighted in blue, along with the 9 multiplier. The product 7×9=63. The digit 3 is placed in the hundreds column in blue, and the carry 6 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_12_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 9 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_12_step_5",
        "The image shows step 5 of vertical multiplication. The final product 15399 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $1 \\times 9$. \n$1 \\times 9 = 9$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $1 \\times 9$. \n$1 \\times 9 = 9$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $7 \\times 9$. \n$7 \\times 9 = 63$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $1 \\times 9$. \n$1 \\times 9 = 9$"
      ],
      [
        "5/5",
        "The product is 15,399."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$487 \\times 20$",
    "tag": "Gr6_8_E1",
    "question_number": "8_13",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "9740"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_13_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 487 is highlighted in blue, along with the 0 multiplier. The product 7×0=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_13_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 487 is highlighted in blue, along with the 0 multiplier. The product 8×0=0. The digit 0 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_13_step_3",
        "The image shows step 3 of vertical multiplication. The digit 4 in the hundreds place of 487 is highlighted in blue, along with the 0 multiplier. The product 4×0=0. The digit 0 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_13_step_4",
        "The image shows step 4 of vertical multiplication. The digit 2 in the tens place of 20 is highlighted in blue, along with each digit of 487 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×2=14, 8×2=16, 4×2=8. The second partial product, 9740, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_13_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 0 and 9740 are stacked and highlighted. The addition is performed column by column, resulting in the final product 9740, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $487 \\times 20$."
      ],
      [
        "2/3",
        "Multiply $487 \\times 20$."
      ],
      [
        "3/3",
        "The product is 9,740."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$6925 \\times 5$",
    "tag": "Gr6_8_E1",
    "question_number": "8_14",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "34625"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_14_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 6925 is highlighted in blue, along with the 5 multiplier. The product 5×5=25 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_14_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 6925 is highlighted in blue, along with the 5 multiplier. The product 2×5=10, plus the carried 2, equals 12. The digit 2 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_14_step_3",
        "The image shows step 3 of vertical multiplication. The digit 9 in the hundreds place of 6925 is highlighted in blue, along with the 5 multiplier. The product 9×5=45, plus the carried 1, equals 46. The digit 6 is placed in the hundreds column in blue, and the carry 4 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_14_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 5 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_14_step_5",
        "The image shows step 5 of vertical multiplication. The final product 34625 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $5 \\times 5$. \n$5 \\times 5 = 25$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $2 \\times 5$. \n$2 \\times 5 = 10$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $9 \\times 5$. \n$9 \\times 5 = 45$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $6 \\times 5$. \n$6 \\times 5 = 30$"
      ],
      [
        "5/5",
        "The product is 34,625."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$777 \\times 39$",
    "tag": "Gr6_8_E1",
    "question_number": "8_15",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "30303"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_15_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 777 is highlighted in blue, along with the 9 multiplier. The product 7×9=63 is written below the line: the digit 3 is placed in the ones column in blue, and the carry 6 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_15_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 777 is highlighted in blue, along with the 9 multiplier. The product 7×9=63, plus the carried 6, equals 69. The digit 9 is placed in the tens column in blue, and the carry 6 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_15_step_3",
        "The image shows step 3 of vertical multiplication. The digit 7 in the hundreds place of 777 is highlighted in blue, along with the 9 multiplier. The product 7×9=63, plus the carried 6, equals 69. The digit 9 is placed in the hundreds column in blue, and the carry 6 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_15_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 39 is highlighted in blue, along with each digit of 777 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×3=21, 7×3=21, 7×3=21. The second partial product, 23310, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_15_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 6993 and 23310 are stacked and highlighted. The addition is performed column by column, resulting in the final product 30303, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $777 \\times 39$."
      ],
      [
        "2/3",
        "Multiply $777 \\times 39$."
      ],
      [
        "3/3",
        "The product is 30,303."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$975 \\times 39$",
    "tag": "Gr6_8_E1",
    "question_number": "8_16",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "38025"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_16_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 975 is highlighted in blue, along with the 9 multiplier. The product 5×9=45 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 4 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_16_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 975 is highlighted in blue, along with the 9 multiplier. The product 7×9=63, plus the carried 4, equals 67. The digit 7 is placed in the tens column in blue, and the carry 6 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_16_step_3",
        "The image shows step 3 of vertical multiplication. The digit 9 in the hundreds place of 975 is highlighted in blue, along with the 9 multiplier. The product 9×9=81, plus the carried 6, equals 87. The digit 7 is placed in the hundreds column in blue, and the carry 8 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_16_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 39 is highlighted in blue, along with each digit of 975 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×3=15, 7×3=21, 9×3=27. The second partial product, 29250, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_16_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 8775 and 29250 are stacked and highlighted. The addition is performed column by column, resulting in the final product 38025, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $975 \\times 39$."
      ],
      [
        "2/3",
        "Multiply $975 \\times 39$."
      ],
      [
        "3/3",
        "The product is 38,025."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$384 \\times 564$",
    "tag": "Gr6_8_E1",
    "question_number": "8_17",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "216576"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_17_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 384 is highlighted in blue, along with the 4 multiplier. The product 4×4=16 is written below the line: the digit 6 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_17_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 384 is highlighted in blue, along with the 4 multiplier. The product 8×4=32, plus the carried 1, equals 33. The digit 3 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_17_step_3",
        "The image shows step 3 of vertical multiplication. The digit 3 in the hundreds place of 384 is highlighted in blue, along with the 4 multiplier. The product 3×4=12, plus the carried 3, equals 15. The digit 5 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_17_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 564 is highlighted in blue, along with each digit of 384 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×6=24, 8×6=48, 3×6=18. The second partial product, 23040, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_17_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 1536 and 23040 are stacked and highlighted. The addition is performed column by column, resulting in the final product 216576, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $384 \\times 564$."
      ],
      [
        "2/3",
        "Multiply $384 \\times 564$."
      ],
      [
        "3/3",
        "The product is 216,576."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$57 \\times 463$",
    "tag": "Gr6_8_E1",
    "question_number": "8_18",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "26391"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_18_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 57 is highlighted in blue, along with the 3 multiplier. The product 7×3=21 is written below the line: the digit 1 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_18_step_2",
        "The image shows step 2 of vertical multiplication. The digit 5 in the tens place of 57 is highlighted in blue, along with the 3 multiplier. The product 5×3=15, plus the carried 2, equals 17. The digit 7 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_18_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 171 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_18_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 463 is highlighted in blue, along with each digit of 57 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×6=42, 5×6=30. The second partial product, 3420, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_18_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 171 and 3420 are stacked and highlighted. The addition is performed column by column, resulting in the final product 26391, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $57 \\times 463$."
      ],
      [
        "2/3",
        "Multiply $57 \\times 463$."
      ],
      [
        "3/3",
        "The product is 26,391."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$2169 \\times 4$",
    "tag": "Gr6_8_E1",
    "question_number": "8_19",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "8676"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_19_step_1",
        "The image shows step 1 of vertical multiplication. The digit 9 in the ones place of 2169 is highlighted in blue, along with the 4 multiplier. The product 9×4=36 is written below the line: the digit 6 is placed in the ones column in blue, and the carry 3 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_19_step_2",
        "The image shows step 2 of vertical multiplication. The digit 6 in the tens place of 2169 is highlighted in blue, along with the 4 multiplier. The product 6×4=24, plus the carried 3, equals 27. The digit 7 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_19_step_3",
        "The image shows step 3 of vertical multiplication. The digit 1 in the hundreds place of 2169 is highlighted in blue, along with the 4 multiplier. The product 1×4=4, plus the carried 2, equals 6. The digit 6 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_19_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 4 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_19_step_5",
        "The image shows step 5 of vertical multiplication. The final product 8676 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $9 \\times 4$. \n$9 \\times 4 = 36$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $6 \\times 4$. \n$6 \\times 4 = 24$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $1 \\times 4$. \n$1 \\times 4 = 4$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $2 \\times 4$. \n$2 \\times 4 = 8$"
      ],
      [
        "5/5",
        "The product is 8,676."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$30 \\times 573$",
    "tag": "Gr6_8_E1",
    "question_number": "8_20",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "17190"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_20_step_1",
        "The image shows step 1 of vertical multiplication. The digit 0 in the ones place of 30 is highlighted in blue, along with the 3 multiplier. The product 0×3=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_20_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 30 is highlighted in blue, along with the 3 multiplier. The product 3×3=9. The digit 9 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_20_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 90 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_20_step_4",
        "The image shows step 4 of vertical multiplication. The digit 7 in the tens place of 573 is highlighted in blue, along with each digit of 30 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 0×7=0, 3×7=21. The second partial product, 2100, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_20_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 90 and 2100 are stacked and highlighted. The addition is performed column by column, resulting in the final product 17190, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $30 \\times 573$."
      ],
      [
        "2/3",
        "Multiply $30 \\times 573$."
      ],
      [
        "3/3",
        "The product is 17,190."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$4598 \\times 7$",
    "tag": "Gr6_8_E1",
    "question_number": "8_21",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "32186"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_21_step_1",
        "The image shows step 1 of vertical multiplication. The digit 8 in the ones place of 4598 is highlighted in blue, along with the 7 multiplier. The product 8×7=56 is written below the line: the digit 6 is placed in the ones column in blue, and the carry 5 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_21_step_2",
        "The image shows step 2 of vertical multiplication. The digit 9 in the tens place of 4598 is highlighted in blue, along with the 7 multiplier. The product 9×7=63, plus the carried 5, equals 68. The digit 8 is placed in the tens column in blue, and the carry 6 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_21_step_3",
        "The image shows step 3 of vertical multiplication. The digit 5 in the hundreds place of 4598 is highlighted in blue, along with the 7 multiplier. The product 5×7=35, plus the carried 6, equals 41. The digit 1 is placed in the hundreds column in blue, and the carry 4 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_21_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 7 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_21_step_5",
        "The image shows step 5 of vertical multiplication. The final product 32186 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $8 \\times 7$. \n$8 \\times 7 = 56$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $9 \\times 7$. \n$9 \\times 7 = 63$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $5 \\times 7$. \n$5 \\times 7 = 35$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $4 \\times 7$. \n$4 \\times 7 = 28$"
      ],
      [
        "5/5",
        "The product is 32,186."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$14 \\times 924$",
    "tag": "Gr6_8_E1",
    "question_number": "8_22",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "12936"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_22_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 14 is highlighted in blue, along with the 4 multiplier. The product 4×4=16 is written below the line: the digit 6 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_22_step_2",
        "The image shows step 2 of vertical multiplication. The digit 1 in the tens place of 14 is highlighted in blue, along with the 4 multiplier. The product 1×4=4, plus the carried 1, equals 5. The digit 5 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_22_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 56 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_22_step_4",
        "The image shows step 4 of vertical multiplication. The digit 2 in the tens place of 924 is highlighted in blue, along with each digit of 14 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×2=8, 1×2=2. The second partial product, 280, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_22_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 56 and 280 are stacked and highlighted. The addition is performed column by column, resulting in the final product 12936, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $14 \\times 924$."
      ],
      [
        "2/3",
        "Multiply $14 \\times 924$."
      ],
      [
        "3/3",
        "The product is 12,936."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$374 \\times 167$",
    "tag": "Gr6_8_E1",
    "question_number": "8_23",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "62458"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_23_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 374 is highlighted in blue, along with the 7 multiplier. The product 4×7=28 is written below the line: the digit 8 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_23_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 374 is highlighted in blue, along with the 7 multiplier. The product 7×7=49, plus the carried 2, equals 51. The digit 1 is placed in the tens column in blue, and the carry 5 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_23_step_3",
        "The image shows step 3 of vertical multiplication. The digit 3 in the hundreds place of 374 is highlighted in blue, along with the 7 multiplier. The product 3×7=21, plus the carried 5, equals 26. The digit 6 is placed in the hundreds column in blue, and the carry 2 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_23_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 167 is highlighted in blue, along with each digit of 374 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×6=24, 7×6=42, 3×6=18. The second partial product, 22440, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_23_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 2618 and 22440 are stacked and highlighted. The addition is performed column by column, resulting in the final product 62458, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $374 \\times 167$."
      ],
      [
        "2/3",
        "Multiply $374 \\times 167$."
      ],
      [
        "3/3",
        "The product is 62,458."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$50 \\times 37$",
    "tag": "Gr6_8_E1",
    "question_number": "8_24",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "1850"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_24_step_1",
        "The image shows step 1 of vertical multiplication. The digit 0 in the ones place of 50 is highlighted in blue, along with the 7 multiplier. The product 0×7=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_24_step_2",
        "The image shows step 2 of vertical multiplication. The digit 5 in the tens place of 50 is highlighted in blue, along with the 7 multiplier. The product 5×7=35. The digit 5 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_24_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 350 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_24_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 37 is highlighted in blue, along with each digit of 50 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 0×3=0, 5×3=15. The second partial product, 1500, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_24_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 350 and 1500 are stacked and highlighted. The addition is performed column by column, resulting in the final product 1850, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $50 \\times 37$."
      ],
      [
        "2/3",
        "Multiply $50 \\times 37$."
      ],
      [
        "3/3",
        "The product is 1,850."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$758 \\times 569$",
    "tag": "Gr6_8_E1",
    "question_number": "8_25",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "431302"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_25_step_1",
        "The image shows step 1 of vertical multiplication. The digit 8 in the ones place of 758 is highlighted in blue, along with the 9 multiplier. The product 8×9=72 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 7 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_25_step_2",
        "The image shows step 2 of vertical multiplication. The digit 5 in the tens place of 758 is highlighted in blue, along with the 9 multiplier. The product 5×9=45, plus the carried 7, equals 52. The digit 2 is placed in the tens column in blue, and the carry 5 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_25_step_3",
        "The image shows step 3 of vertical multiplication. The digit 7 in the hundreds place of 758 is highlighted in blue, along with the 9 multiplier. The product 7×9=63, plus the carried 5, equals 68. The digit 8 is placed in the hundreds column in blue, and the carry 6 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_25_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 569 is highlighted in blue, along with each digit of 758 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 8×6=48, 5×6=30, 7×6=42. The second partial product, 45480, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_25_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 6822 and 45480 are stacked and highlighted. The addition is performed column by column, resulting in the final product 431302, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $758 \\times 569$."
      ],
      [
        "2/3",
        "Multiply $758 \\times 569$."
      ],
      [
        "3/3",
        "The product is 431,302."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$3287 \\times 5$",
    "tag": "Gr6_8_E1",
    "question_number": "8_26",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "16435"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_26_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 3287 is highlighted in blue, along with the 5 multiplier. The product 7×5=35 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 3 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_26_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 3287 is highlighted in blue, along with the 5 multiplier. The product 8×5=40, plus the carried 3, equals 43. The digit 3 is placed in the tens column in blue, and the carry 4 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_26_step_3",
        "The image shows step 3 of vertical multiplication. The digit 2 in the hundreds place of 3287 is highlighted in blue, along with the 5 multiplier. The product 2×5=10, plus the carried 4, equals 14. The digit 4 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_26_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 5 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_26_step_5",
        "The image shows step 5 of vertical multiplication. The final product 16435 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $7 \\times 5$. \n$7 \\times 5 = 35$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $8 \\times 5$. \n$8 \\times 5 = 40$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $2 \\times 5$. \n$2 \\times 5 = 10$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $3 \\times 5$. \n$3 \\times 5 = 15$"
      ],
      [
        "5/5",
        "The product is 16,435."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$43 \\times 84$",
    "tag": "Gr6_8_E1",
    "question_number": "8_27",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "3612"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_27_step_1",
        "The image shows step 1 of vertical multiplication. The digit 3 in the ones place of 43 is highlighted in blue, along with the 4 multiplier. The product 3×4=12 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_27_step_2",
        "The image shows step 2 of vertical multiplication. The digit 4 in the tens place of 43 is highlighted in blue, along with the 4 multiplier. The product 4×4=16, plus the carried 1, equals 17. The digit 7 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_27_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 172 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_27_step_4",
        "The image shows step 4 of vertical multiplication. The digit 8 in the tens place of 84 is highlighted in blue, along with each digit of 43 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 3×8=24, 4×8=32. The second partial product, 3440, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_27_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 172 and 3440 are stacked and highlighted. The addition is performed column by column, resulting in the final product 3612, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $43 \\times 84$."
      ],
      [
        "2/3",
        "Multiply $43 \\times 84$."
      ],
      [
        "3/3",
        "The product is 3,612."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$61 \\times 56$",
    "tag": "Gr6_8_E1",
    "question_number": "8_28",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "3416"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_28_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 61 is highlighted in blue, along with the 6 multiplier. The product 1×6=6 is written below the line: the digit 6 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_28_step_2",
        "The image shows step 2 of vertical multiplication. The digit 6 in the tens place of 61 is highlighted in blue, along with the 6 multiplier. The product 6×6=36. The digit 6 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_28_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 366 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_28_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 56 is highlighted in blue, along with each digit of 61 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×5=5, 6×5=30. The second partial product, 3050, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_28_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 366 and 3050 are stacked and highlighted. The addition is performed column by column, resulting in the final product 3416, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $61 \\times 56$."
      ],
      [
        "2/3",
        "Multiply $61 \\times 56$."
      ],
      [
        "3/3",
        "The product is 3,416."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$75 \\times 605$",
    "tag": "Gr6_8_E1",
    "question_number": "8_29",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "45375"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_29_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 75 is highlighted in blue, along with the 5 multiplier. The product 5×5=25 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_29_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 75 is highlighted in blue, along with the 5 multiplier. The product 7×5=35, plus the carried 2, equals 37. The digit 7 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_29_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 375 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_29_step_4",
        "The image shows step 4 of vertical multiplication. The digit 0 in the tens place of 605 is highlighted in blue, along with each digit of 75 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×0=0, 7×0=0. The second partial product, 0, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_29_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 375 and 0 are stacked and highlighted. The addition is performed column by column, resulting in the final product 45375, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $75 \\times 605$."
      ],
      [
        "2/3",
        "Multiply $75 \\times 605$."
      ],
      [
        "3/3",
        "The product is 45,375."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$981 \\times 24$",
    "tag": "Gr6_8_E1",
    "question_number": "8_30",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "23544"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_30_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 981 is highlighted in blue, along with the 4 multiplier. The product 1×4=4 is written below the line: the digit 4 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_30_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 981 is highlighted in blue, along with the 4 multiplier. The product 8×4=32. The digit 2 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_30_step_3",
        "The image shows step 3 of vertical multiplication. The digit 9 in the hundreds place of 981 is highlighted in blue, along with the 4 multiplier. The product 9×4=36, plus the carried 3, equals 39. The digit 9 is placed in the hundreds column in blue, and the carry 3 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_30_step_4",
        "The image shows step 4 of vertical multiplication. The digit 2 in the tens place of 24 is highlighted in blue, along with each digit of 981 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×2=2, 8×2=16, 9×2=18. The second partial product, 19620, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_30_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 3924 and 19620 are stacked and highlighted. The addition is performed column by column, resulting in the final product 23544, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $981 \\times 24$."
      ],
      [
        "2/3",
        "Multiply $981 \\times 24$."
      ],
      [
        "3/3",
        "The product is 23,544."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$97 \\times 532$",
    "tag": "Gr6_8_E1",
    "question_number": "8_31",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "51604"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_31_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 97 is highlighted in blue, along with the 2 multiplier. The product 7×2=14 is written below the line: the digit 4 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_31_step_2",
        "The image shows step 2 of vertical multiplication. The digit 9 in the tens place of 97 is highlighted in blue, along with the 2 multiplier. The product 9×2=18, plus the carried 1, equals 19. The digit 9 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_31_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 194 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_31_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 532 is highlighted in blue, along with each digit of 97 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×3=21, 9×3=27. The second partial product, 2910, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_31_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 194 and 2910 are stacked and highlighted. The addition is performed column by column, resulting in the final product 51604, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $97 \\times 532$."
      ],
      [
        "2/3",
        "Multiply $97 \\times 532$."
      ],
      [
        "3/3",
        "The product is 51,604."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$494 \\times 58$",
    "tag": "Gr6_8_E1",
    "question_number": "8_32",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "28652"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_32_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 494 is highlighted in blue, along with the 8 multiplier. The product 4×8=32 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 3 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_32_step_2",
        "The image shows step 2 of vertical multiplication. The digit 9 in the tens place of 494 is highlighted in blue, along with the 8 multiplier. The product 9×8=72, plus the carried 3, equals 75. The digit 5 is placed in the tens column in blue, and the carry 7 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_32_step_3",
        "The image shows step 3 of vertical multiplication. The digit 4 in the hundreds place of 494 is highlighted in blue, along with the 8 multiplier. The product 4×8=32, plus the carried 7, equals 39. The digit 9 is placed in the hundreds column in blue, and the carry 3 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_32_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 58 is highlighted in blue, along with each digit of 494 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×5=20, 9×5=45, 4×5=20. The second partial product, 24700, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_32_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 3952 and 24700 are stacked and highlighted. The addition is performed column by column, resulting in the final product 28652, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $494 \\times 58$."
      ],
      [
        "2/3",
        "Multiply $494 \\times 58$."
      ],
      [
        "3/3",
        "The product is 28,652."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$641 \\times 357$",
    "tag": "Gr6_8_E1",
    "question_number": "8_33",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "228837"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_33_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 641 is highlighted in blue, along with the 7 multiplier. The product 1×7=7 is written below the line: the digit 7 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_33_step_2",
        "The image shows step 2 of vertical multiplication. The digit 4 in the tens place of 641 is highlighted in blue, along with the 7 multiplier. The product 4×7=28. The digit 8 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_33_step_3",
        "The image shows step 3 of vertical multiplication. The digit 6 in the hundreds place of 641 is highlighted in blue, along with the 7 multiplier. The product 6×7=42, plus the carried 2, equals 44. The digit 4 is placed in the hundreds column in blue, and the carry 4 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_33_step_4",
        "The image shows step 4 of vertical multiplication. The digit 5 in the tens place of 357 is highlighted in blue, along with each digit of 641 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×5=5, 4×5=20, 6×5=30. The second partial product, 32050, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_33_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 4487 and 32050 are stacked and highlighted. The addition is performed column by column, resulting in the final product 228837, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $641 \\times 357$."
      ],
      [
        "2/3",
        "Multiply $641 \\times 357$."
      ],
      [
        "3/3",
        "The product is 228,837."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$796 \\times 24$",
    "tag": "Gr6_8_E1",
    "question_number": "8_34",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "19104"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_34_step_1",
        "The image shows step 1 of vertical multiplication. The digit 6 in the ones place of 796 is highlighted in blue, along with the 4 multiplier. The product 6×4=24 is written below the line: the digit 4 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_34_step_2",
        "The image shows step 2 of vertical multiplication. The digit 9 in the tens place of 796 is highlighted in blue, along with the 4 multiplier. The product 9×4=36, plus the carried 2, equals 38. The digit 8 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_34_step_3",
        "The image shows step 3 of vertical multiplication. The digit 7 in the hundreds place of 796 is highlighted in blue, along with the 4 multiplier. The product 7×4=28, plus the carried 3, equals 31. The digit 1 is placed in the hundreds column in blue, and the carry 3 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_34_step_4",
        "The image shows step 4 of vertical multiplication. The digit 2 in the tens place of 24 is highlighted in blue, along with each digit of 796 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 6×2=12, 9×2=18, 7×2=14. The second partial product, 15920, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_34_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 3184 and 15920 are stacked and highlighted. The addition is performed column by column, resulting in the final product 19104, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $796 \\times 24$."
      ],
      [
        "2/3",
        "Multiply $796 \\times 24$."
      ],
      [
        "3/3",
        "The product is 19,104."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$6573 \\times 3$",
    "tag": "Gr6_8_E1",
    "question_number": "8_35",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "19719"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_35_step_1",
        "The image shows step 1 of vertical multiplication. The digit 3 in the ones place of 6573 is highlighted in blue, along with the 3 multiplier. The product 3×3=9 is written below the line: the digit 9 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_35_step_2",
        "The image shows step 2 of vertical multiplication. The digit 7 in the tens place of 6573 is highlighted in blue, along with the 3 multiplier. The product 7×3=21. The digit 1 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_35_step_3",
        "The image shows step 3 of vertical multiplication. The digit 5 in the hundreds place of 6573 is highlighted in blue, along with the 3 multiplier. The product 5×3=15, plus the carried 2, equals 17. The digit 7 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_35_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 3 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_35_step_5",
        "The image shows step 5 of vertical multiplication. The final product 19719 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $3 \\times 3$. \n$3 \\times 3 = 9$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $7 \\times 3$. \n$7 \\times 3 = 21$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $5 \\times 3$. \n$5 \\times 3 = 15$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $6 \\times 3$. \n$6 \\times 3 = 18$"
      ],
      [
        "5/5",
        "The product is 19,719."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$261 \\times 564$",
    "tag": "Gr6_8_E1",
    "question_number": "8_36",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "147204"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_36_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 261 is highlighted in blue, along with the 4 multiplier. The product 1×4=4 is written below the line: the digit 4 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_36_step_2",
        "The image shows step 2 of vertical multiplication. The digit 6 in the tens place of 261 is highlighted in blue, along with the 4 multiplier. The product 6×4=24. The digit 4 is placed in the tens column in blue, and the carry 2 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_36_step_3",
        "The image shows step 3 of vertical multiplication. The digit 2 in the hundreds place of 261 is highlighted in blue, along with the 4 multiplier. The product 2×4=8, plus the carried 2, equals 10. The digit 0 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_36_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 564 is highlighted in blue, along with each digit of 261 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×6=6, 6×6=36, 2×6=12. The second partial product, 15660, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_36_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 1044 and 15660 are stacked and highlighted. The addition is performed column by column, resulting in the final product 147204, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $261 \\times 564$."
      ],
      [
        "2/3",
        "Multiply $261 \\times 564$."
      ],
      [
        "3/3",
        "The product is 147,204."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$9201 \\times 4$",
    "tag": "Gr6_8_E1",
    "question_number": "8_37",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "36804"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_37_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 9201 is highlighted in blue, along with the 4 multiplier. The product 1×4=4 is written below the line: the digit 4 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_37_step_2",
        "The image shows step 2 of vertical multiplication. The digit 0 in the tens place of 9201 is highlighted in blue, along with the 4 multiplier. The product 0×4=0. The digit 0 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_37_step_3",
        "The image shows step 3 of vertical multiplication. The digit 2 in the hundreds place of 9201 is highlighted in blue, along with the 4 multiplier. The product 2×4=8. The digit 8 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_37_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 4 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_37_step_5",
        "The image shows step 5 of vertical multiplication. The final product 36804 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $1 \\times 4$. \n$1 \\times 4 = 4$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $0 \\times 4$. \n$0 \\times 4 = 0$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $2 \\times 4$. \n$2 \\times 4 = 8$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $9 \\times 4$. \n$9 \\times 4 = 36$"
      ],
      [
        "5/5",
        "The product is 36,804."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$991 \\times 90$",
    "tag": "Gr6_8_E1",
    "question_number": "8_38",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "89190"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_38_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 991 is highlighted in blue, along with the 0 multiplier. The product 1×0=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_38_step_2",
        "The image shows step 2 of vertical multiplication. The digit 9 in the tens place of 991 is highlighted in blue, along with the 0 multiplier. The product 9×0=0. The digit 0 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_38_step_3",
        "The image shows step 3 of vertical multiplication. The digit 9 in the hundreds place of 991 is highlighted in blue, along with the 0 multiplier. The product 9×0=0. The digit 0 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_38_step_4",
        "The image shows step 4 of vertical multiplication. The digit 9 in the tens place of 90 is highlighted in blue, along with each digit of 991 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×9=9, 9×9=81, 9×9=81. The second partial product, 89190, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_38_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 0 and 89190 are stacked and highlighted. The addition is performed column by column, resulting in the final product 89190, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $991 \\times 90$."
      ],
      [
        "2/3",
        "Multiply $991 \\times 90$."
      ],
      [
        "3/3",
        "The product is 89,190."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Find the product.\n$87 \\times 35$",
    "tag": "Gr6_8_E1",
    "question_number": "8_39",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "3045"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_39_step_1",
        "The image shows step 1 of vertical multiplication. The digit 7 in the ones place of 87 is highlighted in blue, along with the 5 multiplier. The product 7×5=35 is written below the line: the digit 5 is placed in the ones column in blue, and the carry 3 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_39_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 87 is highlighted in blue, along with the 5 multiplier. The product 8×5=40, plus the carried 3, equals 43. The digit 3 is placed in the tens column in blue, and the carry 4 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_39_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 435 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_39_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 35 is highlighted in blue, along with each digit of 87 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 7×3=21, 8×3=24. The second partial product, 2610, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_39_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 435 and 2610 are stacked and highlighted. The addition is performed column by column, resulting in the final product 3045, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $87 \\times 35$."
      ],
      [
        "2/3",
        "Multiply $87 \\times 35$."
      ],
      [
        "3/3",
        "The product is 3,045."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$3646 \\times 2$",
    "tag": "Gr6_8_E1",
    "question_number": "8_40",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "7292"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_40_step_1",
        "The image shows step 1 of vertical multiplication. The digit 6 in the ones place of 3646 is highlighted in blue, along with the 2 multiplier. The product 6×2=12 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_40_step_2",
        "The image shows step 2 of vertical multiplication. The digit 4 in the tens place of 3646 is highlighted in blue, along with the 2 multiplier. The product 4×2=8, plus the carried 1, equals 9. The digit 9 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_40_step_3",
        "The image shows step 3 of vertical multiplication. The digit 6 in the hundreds place of 3646 is highlighted in blue, along with the 2 multiplier. The product 6×2=12. The digit 2 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_40_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 2 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_40_step_5",
        "The image shows step 5 of vertical multiplication. The final product 7292 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $6 \\times 2$. \n$6 \\times 2 = 12$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $4 \\times 2$. \n$4 \\times 2 = 8$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $6 \\times 2$. \n$6 \\times 2 = 12$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $3 \\times 2$. \n$3 \\times 2 = 6$"
      ],
      [
        "5/5",
        "The product is 7,292."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$9005 \\times 2$",
    "tag": "Gr6_8_E1",
    "question_number": "8_41",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "18010"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_41_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 9005 is highlighted in blue, along with the 2 multiplier. The product 5×2=10 is written below the line: the digit 0 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_41_step_2",
        "The image shows step 2 of vertical multiplication. The digit 0 in the tens place of 9005 is highlighted in blue, along with the 2 multiplier. The product 0×2=0, plus the carried 1, equals 1. The digit 1 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_41_step_3",
        "The image shows step 3 of vertical multiplication. The digit 0 in the hundreds place of 9005 is highlighted in blue, along with the 2 multiplier. The product 0×2=0. The digit 0 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_41_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 2 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_41_step_5",
        "The image shows step 5 of vertical multiplication. The final product 18010 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $5 \\times 2$. \n$5 \\times 2 = 10$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $0 \\times 2$. \n$0 \\times 2 = 0$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $0 \\times 2$. \n$0 \\times 2 = 0$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $9 \\times 2$. \n$9 \\times 2 = 18$"
      ],
      [
        "5/5",
        "The product is 18,010."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$6038 \\times 5$",
    "tag": "Gr6_8_E1",
    "question_number": "8_42",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "30190"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_42_step_1",
        "The image shows step 1 of vertical multiplication. The digit 8 in the ones place of 6038 is highlighted in blue, along with the 5 multiplier. The product 8×5=40 is written below the line: the digit 0 is placed in the ones column in blue, and the carry 4 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_42_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 6038 is highlighted in blue, along with the 5 multiplier. The product 3×5=15, plus the carried 4, equals 19. The digit 9 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_42_step_3",
        "The image shows step 3 of vertical multiplication. The digit 0 in the hundreds place of 6038 is highlighted in blue, along with the 5 multiplier. The product 0×5=0, plus the carried 1, equals 1. The digit 1 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_42_step_4",
        "The image shows step 4 of vertical multiplication. Since the multiplier 5 has only one digit, we proceed directly to the final result."
      ],
      [
        "5/5",
        "Gr6_8_1_42_step_5",
        "The image shows step 5 of vertical multiplication. The final product 30190 is written clearly at the bottom, completing the multiplication."
      ]
    ],
    "solution": [
      [
        "1/5",
        "Multiply the ones. Multiply $8 \\times 5$. \n$8 \\times 5 = 40$"
      ],
      [
        "2/5",
        "Multiply the tens. Multiply $3 \\times 5$. \n$3 \\times 5 = 15$"
      ],
      [
        "3/5",
        "Multiply the hundreds. Multiply $0 \\times 5$. \n$0 \\times 5 = 0$"
      ],
      [
        "4/5",
        "Multiply the thousands. Multiply $6 \\times 5$. \n$6 \\times 5 = 30$"
      ],
      [
        "5/5",
        "The product is 30,190."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$82 \\times 180$",
    "tag": "Gr6_8_E1",
    "question_number": "8_43",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "14760"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_43_step_1",
        "The image shows step 1 of vertical multiplication. The digit 2 in the ones place of 82 is highlighted in blue, along with the 0 multiplier. The product 2×0=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_43_step_2",
        "The image shows step 2 of vertical multiplication. The digit 8 in the tens place of 82 is highlighted in blue, along with the 0 multiplier. The product 8×0=0. The digit 0 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_43_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 0 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_43_step_4",
        "The image shows step 4 of vertical multiplication. The digit 8 in the tens place of 180 is highlighted in blue, along with each digit of 82 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 2×8=16, 8×8=64. The second partial product, 6560, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_43_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 0 and 6560 are stacked and highlighted. The addition is performed column by column, resulting in the final product 14760, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $82 \\times 180$."
      ],
      [
        "2/3",
        "Multiply $82 \\times 180$."
      ],
      [
        "3/3",
        "The product is 14,760."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$935 \\times 170$",
    "tag": "Gr6_8_E1",
    "question_number": "8_44",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "158950"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_44_step_1",
        "The image shows step 1 of vertical multiplication. The digit 5 in the ones place of 935 is highlighted in blue, along with the 0 multiplier. The product 5×0=0 is written below the line: the digit 0 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_44_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 935 is highlighted in blue, along with the 0 multiplier. The product 3×0=0. The digit 0 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_44_step_3",
        "The image shows step 3 of vertical multiplication. The digit 9 in the hundreds place of 935 is highlighted in blue, along with the 0 multiplier. The product 9×0=0. The digit 0 is placed in the hundreds column in blue. The first partial product is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_44_step_4",
        "The image shows step 4 of vertical multiplication. The digit 7 in the tens place of 170 is highlighted in blue, along with each digit of 935 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 5×7=35, 3×7=21, 9×7=63. The second partial product, 65450, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_44_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 0 and 65450 are stacked and highlighted. The addition is performed column by column, resulting in the final product 158950, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $935 \\times 170$."
      ],
      [
        "2/3",
        "Multiply $935 \\times 170$."
      ],
      [
        "3/3",
        "The product is 158,950."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Solve the multiplication problem.\n$26 \\times 775$",
    "tag": "Gr6_8_E1",
    "question_number": "8_45",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "20150"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_45_step_1",
        "The image shows step 1 of vertical multiplication. The digit 6 in the ones place of 26 is highlighted in blue, along with the 5 multiplier. The product 6×5=30 is written below the line: the digit 0 is placed in the ones column in blue, and the carry 3 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_45_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 26 is highlighted in blue, along with the 5 multiplier. The product 2×5=10, plus the carried 3, equals 13. The digit 3 is placed in the tens column in blue, and the carry 1 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_45_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 130 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_45_step_4",
        "The image shows step 4 of vertical multiplication. The digit 7 in the tens place of 775 is highlighted in blue, along with each digit of 26 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 6×7=42, 2×7=14. The second partial product, 1820, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_45_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 130 and 1820 are stacked and highlighted. The addition is performed column by column, resulting in the final product 20150, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $26 \\times 775$."
      ],
      [
        "2/3",
        "Multiply $26 \\times 775$."
      ],
      [
        "3/3",
        "The product is 20,150."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$31 \\times 43$",
    "tag": "Gr6_8_E1",
    "question_number": "8_46",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "1333"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_46_step_1",
        "The image shows step 1 of vertical multiplication. The digit 1 in the ones place of 31 is highlighted in blue, along with the 3 multiplier. The product 1×3=3 is written below the line: the digit 3 is placed in the ones column in blue."
      ],
      [
        "2/5",
        "Gr6_8_1_46_step_2",
        "The image shows step 2 of vertical multiplication. The digit 3 in the tens place of 31 is highlighted in blue, along with the 3 multiplier. The product 3×3=9. The digit 9 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_46_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 93 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_46_step_4",
        "The image shows step 4 of vertical multiplication. The digit 4 in the tens place of 43 is highlighted in blue, along with each digit of 31 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 1×4=4, 3×4=12. The second partial product, 1240, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_46_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 93 and 1240 are stacked and highlighted. The addition is performed column by column, resulting in the final product 1333, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $31 \\times 43$."
      ],
      [
        "2/3",
        "Multiply $31 \\times 43$."
      ],
      [
        "3/3",
        "The product is 1,333."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "What is the product?\n$64 \\times 37$",
    "tag": "Gr6_8_E1",
    "question_number": "8_47",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "2368"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_47_step_1",
        "The image shows step 1 of vertical multiplication. The digit 4 in the ones place of 64 is highlighted in blue, along with the 7 multiplier. The product 4×7=28 is written below the line: the digit 8 is placed in the ones column in blue, and the carry 2 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_47_step_2",
        "The image shows step 2 of vertical multiplication. The digit 6 in the tens place of 64 is highlighted in blue, along with the 7 multiplier. The product 6×7=42, plus the carried 2, equals 44. The digit 4 is placed in the tens column in blue, and the carry 4 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_47_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 448 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_47_step_4",
        "The image shows step 4 of vertical multiplication. The digit 3 in the tens place of 37 is highlighted in blue, along with each digit of 64 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 4×3=12, 6×3=18. The second partial product, 1920, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_47_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 448 and 1920 are stacked and highlighted. The addition is performed column by column, resulting in the final product 2368, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $64 \\times 37$."
      ],
      [
        "2/3",
        "Multiply $64 \\times 37$."
      ],
      [
        "3/3",
        "The product is 2,368."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Calculate the multiplication.\n$49 \\times 508$",
    "tag": "Gr6_8_E1",
    "question_number": "8_48",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "24892"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_48_step_1",
        "The image shows step 1 of vertical multiplication. The digit 9 in the ones place of 49 is highlighted in blue, along with the 8 multiplier. The product 9×8=72 is written below the line: the digit 2 is placed in the ones column in blue, and the carry 7 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_48_step_2",
        "The image shows step 2 of vertical multiplication. The digit 4 in the tens place of 49 is highlighted in blue, along with the 8 multiplier. The product 4×8=32, plus the carried 7, equals 39. The digit 9 is placed in the tens column in blue, and the carry 3 is shown as a superscript above the hundreds column."
      ],
      [
        "3/5",
        "Gr6_8_1_48_step_3",
        "The image shows step 3 of vertical multiplication. The first partial product 392 is now complete and visible below the line."
      ],
      [
        "4/5",
        "Gr6_8_1_48_step_4",
        "The image shows step 4 of vertical multiplication. The digit 0 in the tens place of 508 is highlighted in blue, along with each digit of 49 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 9×0=0, 4×0=0. The second partial product, 0, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_48_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 392 and 0 are stacked and highlighted. The addition is performed column by column, resulting in the final product 24892, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $49 \\times 508$."
      ],
      [
        "2/3",
        "Multiply $49 \\times 508$."
      ],
      [
        "3/3",
        "The product is 24,892."
      ]
    ]
  },
  {
    "skills": "add-subtract-multiply-or-divide-two-whole-numbers",
    "question_text": "Multiply.\n$629 \\times 562$",
    "tag": "Gr6_8_E1",
    "question_number": "8_49",
    "question_type": "Fill in the blank",
    "correct_answers": [
      "353498"
    ],
    "solution_image_tag": [
      [
        "1/5",
        "Gr6_8_1_49_step_1",
        "The image shows step 1 of vertical multiplication. The digit 9 in the ones place of 629 is highlighted in blue, along with the 2 multiplier. The product 9×2=18 is written below the line: the digit 8 is placed in the ones column in blue, and the carry 1 is shown as a superscript above the tens column."
      ],
      [
        "2/5",
        "Gr6_8_1_49_step_2",
        "The image shows step 2 of vertical multiplication. The digit 2 in the tens place of 629 is highlighted in blue, along with the 2 multiplier. The product 2×2=4, plus the carried 1, equals 5. The digit 5 is placed in the tens column in blue."
      ],
      [
        "3/5",
        "Gr6_8_1_49_step_3",
        "The image shows step 3 of vertical multiplication. The digit 6 in the hundreds place of 629 is highlighted in blue, along with the 2 multiplier. The product 6×2=12. The digit 2 is placed in the hundreds column in blue, and the carry 1 is shown as a superscript above the thousands column."
      ],
      [
        "4/5",
        "Gr6_8_1_49_step_4",
        "The image shows step 4 of vertical multiplication. The digit 6 in the tens place of 562 is highlighted in blue, along with each digit of 629 as they are multiplied. A zero placeholder is shown in the ones column. The products are written below: 9×6=54, 2×6=12, 6×6=36. The second partial product, 37740, is shown aligned one place left."
      ],
      [
        "5/5",
        "Gr6_8_1_49_step_5",
        "The image shows step 5 of vertical multiplication. Both partial products 1258 and 37740 are stacked and highlighted. The addition is performed column by column, resulting in the final product 353498, which is written clearly at the bottom."
      ]
    ],
    "solution": [
      [
        "1/3",
        "Set up the multiplication: $629 \\times 562$."
      ],
      [
        "2/3",
        "Multiply $629 \\times 562$."
      ],
      [
        "3/3",
        "The product is 353,498."
      ]
    ]
  }
]