[
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Naomi's budget for October.\n\nWhat could Naomi do to balance her budget?",
    "image_tag": "Gr7_49_1_1",
    "backend_description": "A budget table titled 'Naomi's October Budget' with two columns: Income (showing Mowing lawns: 35 dollars, Yard work: 20 dollars, Allowance: 25 dollars) and Expenses (showing School supplies: 20 dollars, Book fair: 45 dollars, Movies: 30 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 20 dollars at the movies",
      "Spend only 30 dollars at the book fair",
      "Increase income from yard work to 25 dollars",
      "Spend 10 dollars less on school supplies"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [
      [
        "2/7",
        "Gr7_49_1_1_step_2",
        "Shows the income calculation with upward arrows pointing to each income source: 35 dollars (Mowing lawns) + 20 dollars (Yard work) + 25 dollars (Allowance) = 80 dollars (Total income). The visual arrows help students understand that these amounts are being added together."
      ],
      [
        "3/7",
        "Gr7_49_1_1_step_3",
        "Shows the expense calculation with upward arrows pointing to each expense: 20 dollars (School supplies) + 45 dollars (Book fair) + 30 dollars (Movies) = 95 dollars (Total expenses). The parallel structure to the income calculation helps students organize budget information."
      ]
    ],
    "solution": [
      [
        "1/7",
        "Find how much money Naomi needs to balance her budget."
      ],
      [
        "2/7",
        "First, add Naomi's sources of income to find her total income."
      ],
      [
        "3/7",
        "Next, add Naomi's expenses to find her total expenses."
      ],
      [
        "4/7",
        "Naomi's expenses are more than her income. Subtract to find the difference: 95 - 80 = 15 dollars"
      ],
      [
        "5/7",
        "So, Naomi needs an extra 15 dollars to balance her budget. \nFind the answer choice that gives Naomi an extra 15 dollars."
      ],
      [
        "6/7",
        "Naomi is planning to spend 45 dollars at the book fair. \nSpending only 30 dollars will give her an extra 15 dollars."
      ],
      [
        "7/7",
        "So, Naomi can balance her budget by spending only 30 dollars at the book fair."
      ]
    ],
    "question_number": "1_1"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jordan's budget for December.\n\nWhat could Jordan do to balance the budget?",
    "image_tag": "Gr7_49_1_2",
    "backend_description": "A budget table titled 'Jordan's December Budget' with two columns: Income (showing Lemonade stand: 19 dollars, Helping neighbors: 38 dollars, Paper route: 36 dollars) and Expenses (showing Concert tickets: 33 dollars, Hobby supplies: 59 dollars, Magazine subscription: 28 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from helping neighbors to 56 dollars",
      "Spend only 39 dollars on hobby supplies",
      "Spend only 6 dollars on concert tickets",
      "Spend only 23 dollars on magazine subscription"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jordan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jordan's sources of income to find the total income.\n19 dollars (Lemonade stand) + 38 dollars (Helping neighbors) + 36 dollars (Paper route) = 93 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jordan's expenses to find the total expenses.\n33 dollars (Concert tickets) + 59 dollars (Hobby supplies) + 28 dollars (Magazine subscription) = 120 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jordan's expenses are more than the income. Subtract to find the difference: 120 - 93 = 27 dollars"
      ],
      [
        "5/7",
        "So, Jordan needs an extra 27 dollars to balance the budget. \nFind the answer choice that gives Jordan an extra 27 dollars."
      ],
      [
        "6/7",
        "Jordan is planning to spend 33 dollars on concert tickets. \nSpending only 6 dollars will give an extra 27 dollars."
      ],
      [
        "7/7",
        "So, Jordan can balance the budget by spending only 6 dollars on concert tickets."
      ]
    ],
    "question_number": "1_2"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Ash's budget for January.\n\nWhat could Ash do to balance the budget?",
    "image_tag": "Gr7_49_1_3",
    "backend_description": "A budget table titled 'Ash's January Budget' with two columns: Income (showing Leaf raking: 39 dollars, Recycling: 33 dollars, Lemonade stand: 32 dollars) and Expenses (showing Field trip: 40 dollars, School supplies: 20 dollars, Music lessons: 54 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from recycling to 38 dollars",
      "Spend only 15 dollars on school supplies",
      "Increase income from leaf raking to 44 dollars",
      "Spend only 30 dollars on field trip"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Ash needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Ash's sources of income to find the total income.\n39 dollars (Leaf raking) + 33 dollars (Recycling) + 32 dollars (Lemonade stand) = 104 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Ash's expenses to find the total expenses.\n40 dollars (Field trip) + 20 dollars (School supplies) + 54 dollars (Music lessons) = 114 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Ash's expenses are more than the income. Subtract to find the difference: 114 - 104 = 10 dollars"
      ],
      [
        "5/7",
        "So, Ash needs an extra 10 dollars to balance the budget. \nFind the answer choice that gives Ash an extra 10 dollars."
      ],
      [
        "6/7",
        "Ash is planning to spend 40 dollars on field trip. \nSpending only 30 dollars will give an extra 10 dollars."
      ],
      [
        "7/7",
        "So, Ash can balance the budget by spending only 30 dollars on field trip."
      ]
    ],
    "question_number": "1_3"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jordan's budget for August.\n\nWhat could Jordan do to balance the budget?",
    "image_tag": "Gr7_49_1_4",
    "backend_description": "A budget table titled 'Jordan's August Budget' with two columns: Income (showing Dog walking: 43 dollars, Lemonade stand: 19 dollars, Lawn mowing: 20 dollars) and Expenses (showing Bus fare: 29 dollars, Concert tickets: 37 dollars, Phone bill: 17 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from dog walking to 43 dollars",
      "Spend only 29 dollars on bus fare",
      "Spend only 17 dollars on phone bill",
      "Spend only 36 dollars on concert tickets"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jordan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jordan's sources of income to find the total income.\n43 dollars (Dog walking) + 19 dollars (Lemonade stand) + 20 dollars (Lawn mowing) = 82 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jordan's expenses to find the total expenses.\n29 dollars (Bus fare) + 37 dollars (Concert tickets) + 17 dollars (Phone bill) = 83 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jordan's expenses are more than the income. Subtract to find the difference: 83 - 82 = 1 dollars"
      ],
      [
        "5/7",
        "So, Jordan needs an extra 1 dollars to balance the budget. \nFind the answer choice that gives Jordan an extra 1 dollars."
      ],
      [
        "6/7",
        "Jordan is planning to spend 37 dollars on concert tickets. \nSpending only 36 dollars will give an extra 1 dollars."
      ],
      [
        "7/7",
        "So, Jordan can balance the budget by spending only 36 dollars on concert tickets."
      ]
    ],
    "question_number": "1_4"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Taylor's budget for April.\n\nWhat could Taylor do to balance the budget?",
    "image_tag": "Gr7_49_1_5",
    "backend_description": "A budget table titled 'Taylor's April Budget' with two columns: Income (showing Lemonade stand: 38 dollars, Paper route: 28 dollars, Garden work: 25 dollars) and Expenses (showing Bus fare: 44 dollars, Books: 41 dollars, Science fair: 36 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from garden work to 49 dollars",
      "Increase income from garden work to 41 dollars",
      "Spend only 14 dollars on bus fare",
      "Increase income from lemonade stand to 51 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Taylor needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Taylor's sources of income to find the total income.\n38 dollars (Lemonade stand) + 28 dollars (Paper route) + 25 dollars (Garden work) = 91 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Taylor's expenses to find the total expenses.\n44 dollars (Bus fare) + 41 dollars (Books) + 36 dollars (Science fair) = 121 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Taylor's expenses are more than the income. Subtract to find the difference: 121 - 91 = 30 dollars"
      ],
      [
        "5/7",
        "So, Taylor needs an extra 30 dollars to balance the budget. \nFind the answer choice that gives Taylor an extra 30 dollars."
      ],
      [
        "6/7",
        "Taylor is planning to spend 44 dollars on bus fare. \nSpending only 14 dollars will give an extra 30 dollars."
      ],
      [
        "7/7",
        "So, Taylor can balance the budget by spending only 14 dollars on bus fare."
      ]
    ],
    "question_number": "1_5"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Casey's budget for April.\n\nWhat could Casey do to balance the budget?",
    "image_tag": "Gr7_49_1_6",
    "backend_description": "A budget table titled 'Casey's April Budget' with two columns: Income (showing Babysitting: 18 dollars, Recycling: 50 dollars, Yard work: 33 dollars) and Expenses (showing Concert tickets: 62 dollars, Art supplies: 42 dollars, Streaming service: 16 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 6 dollars on streaming service",
      "Spend only 43 dollars on concert tickets",
      "Spend only 4 dollars on streaming service",
      "Increase income from yard work to 38 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Casey needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Casey's sources of income to find the total income.\n18 dollars (Babysitting) + 50 dollars (Recycling) + 33 dollars (Yard work) = 101 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Casey's expenses to find the total expenses.\n62 dollars (Concert tickets) + 42 dollars (Art supplies) + 16 dollars (Streaming service) = 120 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Casey's expenses are more than the income. Subtract to find the difference: 120 - 101 = 19 dollars"
      ],
      [
        "5/7",
        "So, Casey needs an extra 19 dollars to balance the budget. \nFind the answer choice that gives Casey an extra 19 dollars."
      ],
      [
        "6/7",
        "Casey is planning to spend 62 dollars on concert tickets. \nSpending only 43 dollars will give an extra 19 dollars."
      ],
      [
        "7/7",
        "So, Casey can balance the budget by spending only 43 dollars on concert tickets."
      ]
    ],
    "question_number": "1_6"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Nova's budget for September.\n\nWhat could Nova do to balance the budget?",
    "image_tag": "Gr7_49_1_7",
    "backend_description": "A budget table titled 'Nova's September Budget' with two columns: Income (showing Snow shoveling: 27 dollars, Lawn mowing: 17 dollars, Leaf raking: 38 dollars) and Expenses (showing Movies: 53 dollars, Concert tickets: 32 dollars, Art supplies: 56 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from lawn mowing to 22 dollars",
      "Spend only 32 dollars on art supplies",
      "Spend only 41 dollars on art supplies",
      "Increase income from snow shoveling to 86 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Nova needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Nova's sources of income to find the total income.\n27 dollars (Snow shoveling) + 17 dollars (Lawn mowing) + 38 dollars (Leaf raking) = 82 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Nova's expenses to find the total expenses.\n53 dollars (Movies) + 32 dollars (Concert tickets) + 56 dollars (Art supplies) = 141 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Nova's expenses are more than the income. Subtract to find the difference: 141 - 82 = 59 dollars"
      ],
      [
        "5/7",
        "So, Nova needs an extra 59 dollars to balance the budget. \nFind the answer choice that gives Nova an extra 59 dollars."
      ],
      [
        "6/7",
        "Nova is planning to spend 53 dollars on movies. \nSpending only -6 dollars will give an extra 59 dollars."
      ],
      [
        "7/7",
        "So, Nova can balance the budget by spending only -6 dollars on movies."
      ]
    ],
    "question_number": "1_7"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Phoenix's budget for January.\n\nWhat could Phoenix do to balance the budget?",
    "image_tag": "Gr7_49_1_8",
    "backend_description": "A budget table titled 'Phoenix's January Budget' with two columns: Income (showing Yard work: 49 dollars, Lemonade stand: 20 dollars, Car washing: 23 dollars) and Expenses (showing Birthday gifts: 25 dollars, Field trip: 52 dollars, Lunch money: 25 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 20 dollars on birthday gifts",
      "Increase income from yard work to 54 dollars",
      "Spend only 15 dollars on lunch money",
      "Increase income from car washing to 28 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Phoenix needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Phoenix's sources of income to find the total income.\n49 dollars (Yard work) + 20 dollars (Lemonade stand) + 23 dollars (Car washing) = 92 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Phoenix's expenses to find the total expenses.\n25 dollars (Birthday gifts) + 52 dollars (Field trip) + 25 dollars (Lunch money) = 102 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Phoenix's expenses are more than the income. Subtract to find the difference: 102 - 92 = 10 dollars"
      ],
      [
        "5/7",
        "So, Phoenix needs an extra 10 dollars to balance the budget. \nFind the answer choice that gives Phoenix an extra 10 dollars."
      ],
      [
        "6/7",
        "Phoenix is planning to spend 25 dollars on lunch money. \nSpending only 15 dollars will give an extra 10 dollars."
      ],
      [
        "7/7",
        "So, Phoenix can balance the budget by spending only 15 dollars on lunch money."
      ]
    ],
    "question_number": "1_8"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Harley's budget for July.\n\nWhat could Harley do to balance the budget?",
    "image_tag": "Gr7_49_1_9",
    "backend_description": "A budget table titled 'Harley's July Budget' with two columns: Income (showing Recycling: 46 dollars, Paper route: 19 dollars, Chores: 33 dollars) and Expenses (showing Games: 45 dollars, Snacks: 53 dollars, Sports equipment: 41 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 15 dollars on sports equipment",
      "Spend only 36 dollars on sports equipment",
      "Increase income from recycling to 75 dollars",
      "Spend only 4 dollars on games"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Harley needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Harley's sources of income to find the total income.\n46 dollars (Recycling) + 19 dollars (Paper route) + 33 dollars (Chores) = 98 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Harley's expenses to find the total expenses.\n45 dollars (Games) + 53 dollars (Snacks) + 41 dollars (Sports equipment) = 139 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Harley's expenses are more than the income. Subtract to find the difference: 139 - 98 = 41 dollars"
      ],
      [
        "5/7",
        "So, Harley needs an extra 41 dollars to balance the budget. \nFind the answer choice that gives Harley an extra 41 dollars."
      ],
      [
        "6/7",
        "Harley is planning to spend 45 dollars on games. \nSpending only 4 dollars will give an extra 41 dollars."
      ],
      [
        "7/7",
        "So, Harley can balance the budget by spending only 4 dollars on games."
      ]
    ],
    "question_number": "1_9"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Riley's budget for July.\n\nWhat could Riley do to balance the budget?",
    "image_tag": "Gr7_49_1_10",
    "backend_description": "A budget table titled 'Riley's July Budget' with two columns: Income (showing Recycling: 30 dollars, Helping neighbors: 25 dollars, Yard work: 40 dollars) and Expenses (showing Movies: 46 dollars, Bus fare: 47 dollars, Hobby supplies: 51 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 43 dollars on hobby supplies",
      "Spend only 36 dollars on bus fare",
      "Increase income from helping neighbors to 32 dollars",
      "Increase income from recycling to 79 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Riley needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Riley's sources of income to find the total income.\n30 dollars (Recycling) + 25 dollars (Helping neighbors) + 40 dollars (Yard work) = 95 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Riley's expenses to find the total expenses.\n46 dollars (Movies) + 47 dollars (Bus fare) + 51 dollars (Hobby supplies) = 144 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Riley's expenses are more than the income. Subtract to find the difference: 144 - 95 = 49 dollars"
      ],
      [
        "5/7",
        "So, Riley needs an extra 49 dollars to balance the budget. \nFind the answer choice that gives Riley an extra 49 dollars."
      ],
      [
        "6/7",
        "Riley is planning to spend 46 dollars on movies. \nSpending only -3 dollars will give an extra 49 dollars."
      ],
      [
        "7/7",
        "So, Riley can balance the budget by spending only -3 dollars on movies."
      ]
    ],
    "question_number": "1_10"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Atlas's budget for December.\n\nWhat could Atlas do to balance the budget?",
    "image_tag": "Gr7_49_1_11",
    "backend_description": "A budget table titled 'Atlas's December Budget' with two columns: Income (showing Lawn mowing: 23 dollars, Garden work: 17 dollars, Lemonade stand: 21 dollars) and Expenses (showing Snacks: 37 dollars, Birthday gifts: 25 dollars, Club dues: 22 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from garden work to 26 dollars",
      "Increase income from lawn mowing to 46 dollars",
      "Increase income from lemonade stand to 38 dollars",
      "Increase income from lawn mowing to 40 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Atlas needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Atlas's sources of income to find the total income.\n23 dollars (Lawn mowing) + 17 dollars (Garden work) + 21 dollars (Lemonade stand) = 61 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Atlas's expenses to find the total expenses.\n37 dollars (Snacks) + 25 dollars (Birthday gifts) + 22 dollars (Club dues) = 84 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Atlas's expenses are more than the income. Subtract to find the difference: 84 - 61 = 23 dollars"
      ],
      [
        "5/7",
        "So, Atlas needs an extra 23 dollars to balance the budget. \nFind the answer choice that gives Atlas an extra 23 dollars."
      ],
      [
        "6/7",
        "Atlas is planning to spend 22 dollars on club dues. \nSpending only -1 dollars will give an extra 23 dollars."
      ],
      [
        "7/7",
        "So, Atlas can balance the budget by spending only -1 dollars on club dues."
      ]
    ],
    "question_number": "1_11"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Avery's budget for August.\n\nWhat could Avery do to balance the budget?",
    "image_tag": "Gr7_49_1_12",
    "backend_description": "A budget table titled 'Avery's August Budget' with two columns: Income (showing Car washing: 24 dollars, Yard work: 50 dollars, Leaf raking: 29 dollars) and Expenses (showing Magazine subscription: 60 dollars, School supplies: 30 dollars, Snacks: 34 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from leaf raking to 34 dollars",
      "Increase income from car washing to 32 dollars",
      "Spend only 23 dollars on snacks",
      "Spend only 9 dollars on school supplies"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Avery needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Avery's sources of income to find the total income.\n24 dollars (Car washing) + 50 dollars (Yard work) + 29 dollars (Leaf raking) = 103 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Avery's expenses to find the total expenses.\n60 dollars (Magazine subscription) + 30 dollars (School supplies) + 34 dollars (Snacks) = 124 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Avery's expenses are more than the income. Subtract to find the difference: 124 - 103 = 21 dollars"
      ],
      [
        "5/7",
        "So, Avery needs an extra 21 dollars to balance the budget. \nFind the answer choice that gives Avery an extra 21 dollars."
      ],
      [
        "6/7",
        "Avery is planning to spend 30 dollars on school supplies. \nSpending only 9 dollars will give an extra 21 dollars."
      ],
      [
        "7/7",
        "So, Avery can balance the budget by spending only 9 dollars on school supplies."
      ]
    ],
    "question_number": "1_12"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Riley's budget for May.\n\nWhat could Riley do to balance the budget?",
    "image_tag": "Gr7_49_1_13",
    "backend_description": "A budget table titled 'Riley's May Budget' with two columns: Income (showing Helping neighbors: 35 dollars, Snow shoveling: 23 dollars, Lawn mowing: 47 dollars) and Expenses (showing Club dues: 37 dollars, Magazine subscription: 43 dollars, Concert tickets: 35 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from lawn mowing to 52 dollars",
      "Spend only 27 dollars on club dues",
      "Spend only 30 dollars on concert tickets",
      "Increase income from snow shoveling to 28 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Riley needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Riley's sources of income to find the total income.\n35 dollars (Helping neighbors) + 23 dollars (Snow shoveling) + 47 dollars (Lawn mowing) = 105 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Riley's expenses to find the total expenses.\n37 dollars (Club dues) + 43 dollars (Magazine subscription) + 35 dollars (Concert tickets) = 115 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Riley's expenses are more than the income. Subtract to find the difference: 115 - 105 = 10 dollars"
      ],
      [
        "5/7",
        "So, Riley needs an extra 10 dollars to balance the budget. \nFind the answer choice that gives Riley an extra 10 dollars."
      ],
      [
        "6/7",
        "Riley is planning to spend 37 dollars on club dues. \nSpending only 27 dollars will give an extra 10 dollars."
      ],
      [
        "7/7",
        "So, Riley can balance the budget by spending only 27 dollars on club dues."
      ]
    ],
    "question_number": "1_13"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jamie's budget for May.\n\nWhat could Jamie do to balance the budget?",
    "image_tag": "Gr7_49_1_14",
    "backend_description": "A budget table titled 'Jamie's May Budget' with two columns: Income (showing Yard work: 21 dollars, Garden work: 25 dollars, Pet sitting: 39 dollars) and Expenses (showing Charity donation: 54 dollars, Books: 15 dollars, Sports equipment: 51 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from yard work to 56 dollars",
      "Spend only 39 dollars on sports equipment",
      "Increase income from garden work to 54 dollars",
      "Increase income from garden work to 51 dollars"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jamie needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jamie's sources of income to find the total income.\n21 dollars (Yard work) + 25 dollars (Garden work) + 39 dollars (Pet sitting) = 85 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jamie's expenses to find the total expenses.\n54 dollars (Charity donation) + 15 dollars (Books) + 51 dollars (Sports equipment) = 120 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jamie's expenses are more than the income. Subtract to find the difference: 120 - 85 = 35 dollars"
      ],
      [
        "5/7",
        "So, Jamie needs an extra 35 dollars to balance the budget. \nFind the answer choice that gives Jamie an extra 35 dollars."
      ],
      [
        "6/7",
        "Jamie is planning to spend 15 dollars on books. \nSpending only -20 dollars will give an extra 35 dollars."
      ],
      [
        "7/7",
        "So, Jamie can balance the budget by spending only -20 dollars on books."
      ]
    ],
    "question_number": "1_14"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Atlas's budget for October.\n\nWhat could Atlas do to balance the budget?",
    "image_tag": "Gr7_49_1_15",
    "backend_description": "A budget table titled 'Atlas's October Budget' with two columns: Income (showing Tutoring: 49 dollars, Leaf raking: 30 dollars, Dog walking: 47 dollars) and Expenses (showing Movies: 57 dollars, Art supplies: 47 dollars, Phone bill: 41 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from dog walking to 59 dollars",
      "Increase income from leaf raking to 40 dollars",
      "Spend only 38 dollars on movies",
      "Increase income from dog walking to 61 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Atlas needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Atlas's sources of income to find the total income.\n49 dollars (Tutoring) + 30 dollars (Leaf raking) + 47 dollars (Dog walking) = 126 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Atlas's expenses to find the total expenses.\n57 dollars (Movies) + 47 dollars (Art supplies) + 41 dollars (Phone bill) = 145 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Atlas's expenses are more than the income. Subtract to find the difference: 145 - 126 = 19 dollars"
      ],
      [
        "5/7",
        "So, Atlas needs an extra 19 dollars to balance the budget. \nFind the answer choice that gives Atlas an extra 19 dollars."
      ],
      [
        "6/7",
        "Atlas is planning to spend 57 dollars on movies. \nSpending only 38 dollars will give an extra 19 dollars."
      ],
      [
        "7/7",
        "So, Atlas can balance the budget by spending only 38 dollars on movies."
      ]
    ],
    "question_number": "1_15"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Eden's budget for January.\n\nWhat could Eden do to balance the budget?",
    "image_tag": "Gr7_49_1_16",
    "backend_description": "A budget table titled 'Eden's January Budget' with two columns: Income (showing Lawn mowing: 24 dollars, Babysitting: 16 dollars, Paper route: 15 dollars) and Expenses (showing Magazine subscription: 51 dollars, Streaming service: 40 dollars, Music lessons: 22 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 39 dollars on magazine subscription",
      "Spend only 44 dollars on magazine subscription",
      "Spend only 3 dollars on magazine subscription",
      "Increase income from lawn mowing to 82 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Eden needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Eden's sources of income to find the total income.\n24 dollars (Lawn mowing) + 16 dollars (Babysitting) + 15 dollars (Paper route) = 55 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Eden's expenses to find the total expenses.\n51 dollars (Magazine subscription) + 40 dollars (Streaming service) + 22 dollars (Music lessons) = 113 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Eden's expenses are more than the income. Subtract to find the difference: 113 - 55 = 58 dollars"
      ],
      [
        "5/7",
        "So, Eden needs an extra 58 dollars to balance the budget. \nFind the answer choice that gives Eden an extra 58 dollars."
      ],
      [
        "6/7",
        "Eden is planning to spend 40 dollars on streaming service. \nSpending only -18 dollars will give an extra 58 dollars."
      ],
      [
        "7/7",
        "So, Eden can balance the budget by spending only -18 dollars on streaming service."
      ]
    ],
    "question_number": "1_16"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Sage's budget for March.\n\nWhat could Sage do to balance the budget?",
    "image_tag": "Gr7_49_1_17",
    "backend_description": "A budget table titled 'Sage's March Budget' with two columns: Income (showing Recycling: 45 dollars, Chores: 35 dollars, Paper route: 50 dollars) and Expenses (showing Birthday gifts: 69 dollars, Art supplies: 30 dollars, Science fair: 44 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from recycling to 52 dollars",
      "Increase income from recycling to 50 dollars",
      "Spend only 56 dollars on birthday gifts",
      "Increase income from chores to 42 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Sage needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Sage's sources of income to find the total income.\n45 dollars (Recycling) + 35 dollars (Chores) + 50 dollars (Paper route) = 130 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Sage's expenses to find the total expenses.\n69 dollars (Birthday gifts) + 30 dollars (Art supplies) + 44 dollars (Science fair) = 143 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Sage's expenses are more than the income. Subtract to find the difference: 143 - 130 = 13 dollars"
      ],
      [
        "5/7",
        "So, Sage needs an extra 13 dollars to balance the budget. \nFind the answer choice that gives Sage an extra 13 dollars."
      ],
      [
        "6/7",
        "Sage is planning to spend 69 dollars on birthday gifts. \nSpending only 56 dollars will give an extra 13 dollars."
      ],
      [
        "7/7",
        "So, Sage can balance the budget by spending only 56 dollars on birthday gifts."
      ]
    ],
    "question_number": "1_17"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Blake's budget for July.\n\nWhat could Blake do to balance the budget?",
    "image_tag": "Gr7_49_1_18",
    "backend_description": "A budget table titled 'Blake's July Budget' with two columns: Income (showing Leaf raking: 30 dollars, Dog walking: 49 dollars, Recycling: 48 dollars) and Expenses (showing Sports equipment: 43 dollars, Charity donation: 30 dollars, Streaming service: 56 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 41 dollars on sports equipment",
      "Spend only 29 dollars on charity donation",
      "Spend only 29 dollars on charity donation",
      "Spend only 55 dollars on streaming service"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Blake needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Blake's sources of income to find the total income.\n30 dollars (Leaf raking) + 49 dollars (Dog walking) + 48 dollars (Recycling) = 127 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Blake's expenses to find the total expenses.\n43 dollars (Sports equipment) + 30 dollars (Charity donation) + 56 dollars (Streaming service) = 129 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Blake's expenses are more than the income. Subtract to find the difference: 129 - 127 = 2 dollars"
      ],
      [
        "5/7",
        "So, Blake needs an extra 2 dollars to balance the budget. \nFind the answer choice that gives Blake an extra 2 dollars."
      ],
      [
        "6/7",
        "Blake is planning to spend 43 dollars on sports equipment. \nSpending only 41 dollars will give an extra 2 dollars."
      ],
      [
        "7/7",
        "So, Blake can balance the budget by spending only 41 dollars on sports equipment."
      ]
    ],
    "question_number": "1_18"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Morgan's budget for March.\n\nWhat could Morgan do to balance the budget?",
    "image_tag": "Gr7_49_1_19",
    "backend_description": "A budget table titled 'Morgan's March Budget' with two columns: Income (showing Dog walking: 36 dollars, Lemonade stand: 50 dollars, Recycling: 49 dollars) and Expenses (showing Field trip: 82 dollars, Books: 47 dollars, Snacks: 29 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 24 dollars on books",
      "Increase income from lemonade stand to 63 dollars",
      "Increase income from dog walking to 50 dollars",
      "Spend only 23 dollars on snacks"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Morgan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Morgan's sources of income to find the total income.\n36 dollars (Dog walking) + 50 dollars (Lemonade stand) + 49 dollars (Recycling) = 135 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Morgan's expenses to find the total expenses.\n82 dollars (Field trip) + 47 dollars (Books) + 29 dollars (Snacks) = 158 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Morgan's expenses are more than the income. Subtract to find the difference: 158 - 135 = 23 dollars"
      ],
      [
        "5/7",
        "So, Morgan needs an extra 23 dollars to balance the budget. \nFind the answer choice that gives Morgan an extra 23 dollars."
      ],
      [
        "6/7",
        "Morgan is planning to spend 47 dollars on books. \nSpending only 24 dollars will give an extra 23 dollars."
      ],
      [
        "7/7",
        "So, Morgan can balance the budget by spending only 24 dollars on books."
      ]
    ],
    "question_number": "1_19"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Atlas's budget for December.\n\nWhat could Atlas do to balance the budget?",
    "image_tag": "Gr7_49_1_20",
    "backend_description": "A budget table titled 'Atlas's December Budget' with two columns: Income (showing Babysitting: 47 dollars, Car washing: 43 dollars, Dog walking: 34 dollars) and Expenses (showing Streaming service: 50 dollars, Lunch money: 60 dollars, Games: 37 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from car washing to 57 dollars",
      "Spend only 37 dollars on lunch money",
      "Increase income from babysitting to 64 dollars",
      "Spend only 35 dollars on streaming service"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Atlas needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Atlas's sources of income to find the total income.\n47 dollars (Babysitting) + 43 dollars (Car washing) + 34 dollars (Dog walking) = 124 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Atlas's expenses to find the total expenses.\n50 dollars (Streaming service) + 60 dollars (Lunch money) + 37 dollars (Games) = 147 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Atlas's expenses are more than the income. Subtract to find the difference: 147 - 124 = 23 dollars"
      ],
      [
        "5/7",
        "So, Atlas needs an extra 23 dollars to balance the budget. \nFind the answer choice that gives Atlas an extra 23 dollars."
      ],
      [
        "6/7",
        "Atlas is planning to spend 60 dollars on lunch money. \nSpending only 37 dollars will give an extra 23 dollars."
      ],
      [
        "7/7",
        "So, Atlas can balance the budget by spending only 37 dollars on lunch money."
      ]
    ],
    "question_number": "1_20"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Reese's budget for March.\n\nWhat could Reese do to balance the budget?",
    "image_tag": "Gr7_49_1_21",
    "backend_description": "A budget table titled 'Reese's March Budget' with two columns: Income (showing Car washing: 34 dollars, Dog walking: 39 dollars, Babysitting: 27 dollars) and Expenses (showing Movies: 51 dollars, Hobby supplies: 16 dollars, Art supplies: 44 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 46 dollars on movies",
      "Spend only 33 dollars on art supplies",
      "Spend only 11 dollars on hobby supplies",
      "Increase income from dog walking to 44 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Reese needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Reese's sources of income to find the total income.\n34 dollars (Car washing) + 39 dollars (Dog walking) + 27 dollars (Babysitting) = 100 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Reese's expenses to find the total expenses.\n51 dollars (Movies) + 16 dollars (Hobby supplies) + 44 dollars (Art supplies) = 111 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Reese's expenses are more than the income. Subtract to find the difference: 111 - 100 = 11 dollars"
      ],
      [
        "5/7",
        "So, Reese needs an extra 11 dollars to balance the budget. \nFind the answer choice that gives Reese an extra 11 dollars."
      ],
      [
        "6/7",
        "Reese is planning to spend 44 dollars on art supplies. \nSpending only 33 dollars will give an extra 11 dollars."
      ],
      [
        "7/7",
        "So, Reese can balance the budget by spending only 33 dollars on art supplies."
      ]
    ],
    "question_number": "1_21"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jamie's budget for February.\n\nWhat could Jamie do to balance the budget?",
    "image_tag": "Gr7_49_1_22",
    "backend_description": "A budget table titled 'Jamie's February Budget' with two columns: Income (showing Snow shoveling: 43 dollars, Paper route: 26 dollars, Lawn mowing: 37 dollars) and Expenses (showing Magazine subscription: 53 dollars, Streaming service: 27 dollars, Club dues: 44 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 41 dollars on magazine subscription",
      "Spend only 45 dollars on magazine subscription",
      "Increase income from paper route to 31 dollars",
      "Spend only 26 dollars on club dues"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jamie needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jamie's sources of income to find the total income.\n43 dollars (Snow shoveling) + 26 dollars (Paper route) + 37 dollars (Lawn mowing) = 106 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jamie's expenses to find the total expenses.\n53 dollars (Magazine subscription) + 27 dollars (Streaming service) + 44 dollars (Club dues) = 124 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jamie's expenses are more than the income. Subtract to find the difference: 124 - 106 = 18 dollars"
      ],
      [
        "5/7",
        "So, Jamie needs an extra 18 dollars to balance the budget. \nFind the answer choice that gives Jamie an extra 18 dollars."
      ],
      [
        "6/7",
        "Jamie is planning to spend 44 dollars on club dues. \nSpending only 26 dollars will give an extra 18 dollars."
      ],
      [
        "7/7",
        "So, Jamie can balance the budget by spending only 26 dollars on club dues."
      ]
    ],
    "question_number": "1_22"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Avery's budget for November.\n\nWhat could Avery do to balance the budget?",
    "image_tag": "Gr7_49_1_23",
    "backend_description": "A budget table titled 'Avery's November Budget' with two columns: Income (showing Tutoring: 35 dollars, Chores: 49 dollars, Car washing: 29 dollars) and Expenses (showing Science fair: 38 dollars, Magazine subscription: 50 dollars, Snacks: 29 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 48 dollars on magazine subscription",
      "Spend only 48 dollars on magazine subscription",
      "Spend only 25 dollars on snacks",
      "Spend only 36 dollars on science fair"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Avery needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Avery's sources of income to find the total income.\n35 dollars (Tutoring) + 49 dollars (Chores) + 29 dollars (Car washing) = 113 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Avery's expenses to find the total expenses.\n38 dollars (Science fair) + 50 dollars (Magazine subscription) + 29 dollars (Snacks) = 117 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Avery's expenses are more than the income. Subtract to find the difference: 117 - 113 = 4 dollars"
      ],
      [
        "5/7",
        "So, Avery needs an extra 4 dollars to balance the budget. \nFind the answer choice that gives Avery an extra 4 dollars."
      ],
      [
        "6/7",
        "Avery is planning to spend 29 dollars on snacks. \nSpending only 25 dollars will give an extra 4 dollars."
      ],
      [
        "7/7",
        "So, Avery can balance the budget by spending only 25 dollars on snacks."
      ]
    ],
    "question_number": "1_23"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Phoenix's budget for December.\n\nWhat could Phoenix do to balance the budget?",
    "image_tag": "Gr7_49_1_24",
    "backend_description": "A budget table titled 'Phoenix's December Budget' with two columns: Income (showing Paper route: 36 dollars, Babysitting: 42 dollars, Recycling: 40 dollars) and Expenses (showing Magazine subscription: 57 dollars, Field trip: 37 dollars, Birthday gifts: 40 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from babysitting to 49 dollars",
      "Increase income from paper route to 41 dollars",
      "Spend only 21 dollars on field trip",
      "Spend only 29 dollars on birthday gifts"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Phoenix needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Phoenix's sources of income to find the total income.\n36 dollars (Paper route) + 42 dollars (Babysitting) + 40 dollars (Recycling) = 118 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Phoenix's expenses to find the total expenses.\n57 dollars (Magazine subscription) + 37 dollars (Field trip) + 40 dollars (Birthday gifts) = 134 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Phoenix's expenses are more than the income. Subtract to find the difference: 134 - 118 = 16 dollars"
      ],
      [
        "5/7",
        "So, Phoenix needs an extra 16 dollars to balance the budget. \nFind the answer choice that gives Phoenix an extra 16 dollars."
      ],
      [
        "6/7",
        "Phoenix is planning to spend 37 dollars on field trip. \nSpending only 21 dollars will give an extra 16 dollars."
      ],
      [
        "7/7",
        "So, Phoenix can balance the budget by spending only 21 dollars on field trip."
      ]
    ],
    "question_number": "1_24"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Sam's budget for September.\n\nWhat could Sam do to balance the budget?",
    "image_tag": "Gr7_49_1_25",
    "backend_description": "A budget table titled 'Sam's September Budget' with two columns: Income (showing Car washing: 39 dollars, Chores: 32 dollars, Lawn mowing: 35 dollars) and Expenses (showing Science fair: 36 dollars, Sports equipment: 28 dollars, Books: 51 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 27 dollars on science fair",
      "Increase income from car washing to 43 dollars",
      "Spend only 24 dollars on sports equipment",
      "Increase income from chores to 36 dollars"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Sam needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Sam's sources of income to find the total income.\n39 dollars (Car washing) + 32 dollars (Chores) + 35 dollars (Lawn mowing) = 106 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Sam's expenses to find the total expenses.\n36 dollars (Science fair) + 28 dollars (Sports equipment) + 51 dollars (Books) = 115 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Sam's expenses are more than the income. Subtract to find the difference: 115 - 106 = 9 dollars"
      ],
      [
        "5/7",
        "So, Sam needs an extra 9 dollars to balance the budget. \nFind the answer choice that gives Sam an extra 9 dollars."
      ],
      [
        "6/7",
        "Sam is planning to spend 36 dollars on science fair. \nSpending only 27 dollars will give an extra 9 dollars."
      ],
      [
        "7/7",
        "So, Sam can balance the budget by spending only 27 dollars on science fair."
      ]
    ],
    "question_number": "1_25"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jamie's budget for February.\n\nWhat could Jamie do to balance the budget?",
    "image_tag": "Gr7_49_1_26",
    "backend_description": "A budget table titled 'Jamie's February Budget' with two columns: Income (showing Paper route: 19 dollars, Pet sitting: 42 dollars, Lemonade stand: 28 dollars) and Expenses (showing Music lessons: 49 dollars, Magazine subscription: 49 dollars, Lunch money: 46 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 19 dollars on music lessons",
      "Increase income from paper route to 65 dollars",
      "Increase income from paper route to 74 dollars",
      "Spend only 34 dollars on magazine subscription"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jamie needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jamie's sources of income to find the total income.\n19 dollars (Paper route) + 42 dollars (Pet sitting) + 28 dollars (Lemonade stand) = 89 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jamie's expenses to find the total expenses.\n49 dollars (Music lessons) + 49 dollars (Magazine subscription) + 46 dollars (Lunch money) = 144 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jamie's expenses are more than the income. Subtract to find the difference: 144 - 89 = 55 dollars"
      ],
      [
        "5/7",
        "So, Jamie needs an extra 55 dollars to balance the budget. \nFind the answer choice that gives Jamie an extra 55 dollars."
      ],
      [
        "6/7",
        "Jamie is planning to spend 46 dollars on lunch money. \nSpending only -9 dollars will give an extra 55 dollars."
      ],
      [
        "7/7",
        "So, Jamie can balance the budget by spending only -9 dollars on lunch money."
      ]
    ],
    "question_number": "1_26"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Sam's budget for September.\n\nWhat could Sam do to balance the budget?",
    "image_tag": "Gr7_49_1_27",
    "backend_description": "A budget table titled 'Sam's September Budget' with two columns: Income (showing Lemonade stand: 32 dollars, Leaf raking: 23 dollars, Garden work: 45 dollars) and Expenses (showing Art supplies: 34 dollars, Magazine subscription: 59 dollars, Hobby supplies: 39 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 21 dollars on art supplies",
      "Increase income from garden work to 63 dollars",
      "Spend only 7 dollars on hobby supplies",
      "Increase income from garden work to 60 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Sam needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Sam's sources of income to find the total income.\n32 dollars (Lemonade stand) + 23 dollars (Leaf raking) + 45 dollars (Garden work) = 100 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Sam's expenses to find the total expenses.\n34 dollars (Art supplies) + 59 dollars (Magazine subscription) + 39 dollars (Hobby supplies) = 132 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Sam's expenses are more than the income. Subtract to find the difference: 132 - 100 = 32 dollars"
      ],
      [
        "5/7",
        "So, Sam needs an extra 32 dollars to balance the budget. \nFind the answer choice that gives Sam an extra 32 dollars."
      ],
      [
        "6/7",
        "Sam is planning to spend 39 dollars on hobby supplies. \nSpending only 7 dollars will give an extra 32 dollars."
      ],
      [
        "7/7",
        "So, Sam can balance the budget by spending only 7 dollars on hobby supplies."
      ]
    ],
    "question_number": "1_27"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Zion's budget for May.\n\nWhat could Zion do to balance the budget?",
    "image_tag": "Gr7_49_1_28",
    "backend_description": "A budget table titled 'Zion's May Budget' with two columns: Income (showing Babysitting: 31 dollars, Lemonade stand: 18 dollars, Recycling: 35 dollars) and Expenses (showing Music lessons: 41 dollars, Snacks: 16 dollars, Phone bill: 40 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from recycling to 42 dollars",
      "Increase income from lemonade stand to 24 dollars",
      "Increase income from recycling to 41 dollars",
      "Spend only 3 dollars on snacks"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Zion needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Zion's sources of income to find the total income.\n31 dollars (Babysitting) + 18 dollars (Lemonade stand) + 35 dollars (Recycling) = 84 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Zion's expenses to find the total expenses.\n41 dollars (Music lessons) + 16 dollars (Snacks) + 40 dollars (Phone bill) = 97 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Zion's expenses are more than the income. Subtract to find the difference: 97 - 84 = 13 dollars"
      ],
      [
        "5/7",
        "So, Zion needs an extra 13 dollars to balance the budget. \nFind the answer choice that gives Zion an extra 13 dollars."
      ],
      [
        "6/7",
        "Zion is planning to spend 16 dollars on snacks. \nSpending only 3 dollars will give an extra 13 dollars."
      ],
      [
        "7/7",
        "So, Zion can balance the budget by spending only 3 dollars on snacks."
      ]
    ],
    "question_number": "1_28"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Zion's budget for August.\n\nWhat could Zion do to balance the budget?",
    "image_tag": "Gr7_49_1_29",
    "backend_description": "A budget table titled 'Zion's August Budget' with two columns: Income (showing Lemonade stand: 26 dollars, Garden work: 27 dollars, Pet sitting: 23 dollars) and Expenses (showing Birthday gifts: 55 dollars, Concert tickets: 39 dollars, Movies: 59 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 5 dollars on birthday gifts",
      "Spend only 12 dollars on concert tickets",
      "Spend only -12 dollars on birthday gifts",
      "Increase income from lemonade stand to 103 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Zion needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Zion's sources of income to find the total income.\n26 dollars (Lemonade stand) + 27 dollars (Garden work) + 23 dollars (Pet sitting) = 76 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Zion's expenses to find the total expenses.\n55 dollars (Birthday gifts) + 39 dollars (Concert tickets) + 59 dollars (Movies) = 153 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Zion's expenses are more than the income. Subtract to find the difference: 153 - 76 = 77 dollars"
      ],
      [
        "5/7",
        "So, Zion needs an extra 77 dollars to balance the budget. \nFind the answer choice that gives Zion an extra 77 dollars."
      ],
      [
        "6/7",
        "Zion is planning to spend 59 dollars on movies. \nSpending only -18 dollars will give an extra 77 dollars."
      ],
      [
        "7/7",
        "So, Zion can balance the budget by spending only -18 dollars on movies."
      ]
    ],
    "question_number": "1_29"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Reese's budget for December.\n\nWhat could Reese do to balance the budget?",
    "image_tag": "Gr7_49_1_30",
    "backend_description": "A budget table titled 'Reese's December Budget' with two columns: Income (showing Garden work: 45 dollars, Babysitting: 42 dollars, Car washing: 17 dollars) and Expenses (showing Sports equipment: 51 dollars, Hobby supplies: 44 dollars, Snacks: 28 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 30 dollars on hobby supplies",
      "Increase income from babysitting to 55 dollars",
      "Spend only 32 dollars on sports equipment",
      "Spend only 31 dollars on hobby supplies"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Reese needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Reese's sources of income to find the total income.\n45 dollars (Garden work) + 42 dollars (Babysitting) + 17 dollars (Car washing) = 104 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Reese's expenses to find the total expenses.\n51 dollars (Sports equipment) + 44 dollars (Hobby supplies) + 28 dollars (Snacks) = 123 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Reese's expenses are more than the income. Subtract to find the difference: 123 - 104 = 19 dollars"
      ],
      [
        "5/7",
        "So, Reese needs an extra 19 dollars to balance the budget. \nFind the answer choice that gives Reese an extra 19 dollars."
      ],
      [
        "6/7",
        "Reese is planning to spend 51 dollars on sports equipment. \nSpending only 32 dollars will give an extra 19 dollars."
      ],
      [
        "7/7",
        "So, Reese can balance the budget by spending only 32 dollars on sports equipment."
      ]
    ],
    "question_number": "1_30"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Cameron's budget for May.\n\nWhat could Cameron do to balance the budget?",
    "image_tag": "Gr7_49_1_31",
    "backend_description": "A budget table titled 'Cameron's May Budget' with two columns: Income (showing Yard work: 47 dollars, Paper route: 46 dollars, Babysitting: 28 dollars) and Expenses (showing Movies: 56 dollars, Books: 21 dollars, Snacks: 58 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 7 dollars on books",
      "Spend only 52 dollars on snacks",
      "Increase income from babysitting to 34 dollars",
      "Increase income from babysitting to 36 dollars"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Cameron needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Cameron's sources of income to find the total income.\n47 dollars (Yard work) + 46 dollars (Paper route) + 28 dollars (Babysitting) = 121 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Cameron's expenses to find the total expenses.\n56 dollars (Movies) + 21 dollars (Books) + 58 dollars (Snacks) = 135 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Cameron's expenses are more than the income. Subtract to find the difference: 135 - 121 = 14 dollars"
      ],
      [
        "5/7",
        "So, Cameron needs an extra 14 dollars to balance the budget. \nFind the answer choice that gives Cameron an extra 14 dollars."
      ],
      [
        "6/7",
        "Cameron is planning to spend 21 dollars on books. \nSpending only 7 dollars will give an extra 14 dollars."
      ],
      [
        "7/7",
        "So, Cameron can balance the budget by spending only 7 dollars on books."
      ]
    ],
    "question_number": "1_31"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Zion's budget for June.\n\nWhat could Zion do to balance the budget?",
    "image_tag": "Gr7_49_1_32",
    "backend_description": "A budget table titled 'Zion's June Budget' with two columns: Income (showing Yard work: 45 dollars, Recycling: 37 dollars, Pet sitting: 26 dollars) and Expenses (showing Snacks: 64 dollars, Science fair: 22 dollars, Sports equipment: 42 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 2 dollars on science fair",
      "Increase income from recycling to 48 dollars",
      "Spend only 31 dollars on sports equipment",
      "Increase income from recycling to 51 dollars"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Zion needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Zion's sources of income to find the total income.\n45 dollars (Yard work) + 37 dollars (Recycling) + 26 dollars (Pet sitting) = 108 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Zion's expenses to find the total expenses.\n64 dollars (Snacks) + 22 dollars (Science fair) + 42 dollars (Sports equipment) = 128 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Zion's expenses are more than the income. Subtract to find the difference: 128 - 108 = 20 dollars"
      ],
      [
        "5/7",
        "So, Zion needs an extra 20 dollars to balance the budget. \nFind the answer choice that gives Zion an extra 20 dollars."
      ],
      [
        "6/7",
        "Zion is planning to spend 22 dollars on science fair. \nSpending only 2 dollars will give an extra 20 dollars."
      ],
      [
        "7/7",
        "So, Zion can balance the budget by spending only 2 dollars on science fair."
      ]
    ],
    "question_number": "1_32"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Drew's budget for June.\n\nWhat could Drew do to balance the budget?",
    "image_tag": "Gr7_49_1_33",
    "backend_description": "A budget table titled 'Drew's June Budget' with two columns: Income (showing Paper route: 21 dollars, Garden work: 42 dollars, Pet sitting: 30 dollars) and Expenses (showing Lunch money: 56 dollars, Games: 22 dollars, Streaming service: 29 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from garden work to 49 dollars",
      "Increase income from garden work to 49 dollars",
      "Spend only 8 dollars on games",
      "Spend only 23 dollars on streaming service"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Drew needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Drew's sources of income to find the total income.\n21 dollars (Paper route) + 42 dollars (Garden work) + 30 dollars (Pet sitting) = 93 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Drew's expenses to find the total expenses.\n56 dollars (Lunch money) + 22 dollars (Games) + 29 dollars (Streaming service) = 107 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Drew's expenses are more than the income. Subtract to find the difference: 107 - 93 = 14 dollars"
      ],
      [
        "5/7",
        "So, Drew needs an extra 14 dollars to balance the budget. \nFind the answer choice that gives Drew an extra 14 dollars."
      ],
      [
        "6/7",
        "Drew is planning to spend 22 dollars on games. \nSpending only 8 dollars will give an extra 14 dollars."
      ],
      [
        "7/7",
        "So, Drew can balance the budget by spending only 8 dollars on games."
      ]
    ],
    "question_number": "1_33"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Eden's budget for November.\n\nWhat could Eden do to balance the budget?",
    "image_tag": "Gr7_49_1_34",
    "backend_description": "A budget table titled 'Eden's November Budget' with two columns: Income (showing Helping neighbors: 16 dollars, Babysitting: 19 dollars, Paper route: 29 dollars) and Expenses (showing Concert tickets: 28 dollars, Books: 23 dollars, Lunch money: 18 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from babysitting to 21 dollars",
      "Spend only 13 dollars on lunch money",
      "Increase income from helping neighbors to 18 dollars",
      "Spend only 26 dollars on concert tickets"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Eden needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Eden's sources of income to find the total income.\n16 dollars (Helping neighbors) + 19 dollars (Babysitting) + 29 dollars (Paper route) = 64 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Eden's expenses to find the total expenses.\n28 dollars (Concert tickets) + 23 dollars (Books) + 18 dollars (Lunch money) = 69 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Eden's expenses are more than the income. Subtract to find the difference: 69 - 64 = 5 dollars"
      ],
      [
        "5/7",
        "So, Eden needs an extra 5 dollars to balance the budget. \nFind the answer choice that gives Eden an extra 5 dollars."
      ],
      [
        "6/7",
        "Eden is planning to spend 18 dollars on lunch money. \nSpending only 13 dollars will give an extra 5 dollars."
      ],
      [
        "7/7",
        "So, Eden can balance the budget by spending only 13 dollars on lunch money."
      ]
    ],
    "question_number": "1_34"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows River's budget for June.\n\nWhat could River do to balance the budget?",
    "image_tag": "Gr7_49_1_35",
    "backend_description": "A budget table titled 'River's June Budget' with two columns: Income (showing Dog walking: 28 dollars, Pet sitting: 30 dollars, Car washing: 25 dollars) and Expenses (showing School supplies: 33 dollars, Lunch money: 37 dollars, Science fair: 41 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 28 dollars on school supplies",
      "Spend only 9 dollars on lunch money",
      "Increase income from dog walking to 43 dollars",
      "Increase income from dog walking to 50 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money River needs to balance the budget."
      ],
      [
        "2/7",
        "First, add River's sources of income to find the total income.\n28 dollars (Dog walking) + 30 dollars (Pet sitting) + 25 dollars (Car washing) = 83 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add River's expenses to find the total expenses.\n33 dollars (School supplies) + 37 dollars (Lunch money) + 41 dollars (Science fair) = 111 dollars (Total expenses)"
      ],
      [
        "4/7",
        "River's expenses are more than the income. Subtract to find the difference: 111 - 83 = 28 dollars"
      ],
      [
        "5/7",
        "So, River needs an extra 28 dollars to balance the budget. \nFind the answer choice that gives River an extra 28 dollars."
      ],
      [
        "6/7",
        "River is planning to spend 37 dollars on lunch money. \nSpending only 9 dollars will give an extra 28 dollars."
      ],
      [
        "7/7",
        "So, River can balance the budget by spending only 9 dollars on lunch money."
      ]
    ],
    "question_number": "1_35"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Jamie's budget for April.\n\nWhat could Jamie do to balance the budget?",
    "image_tag": "Gr7_49_1_36",
    "backend_description": "A budget table titled 'Jamie's April Budget' with two columns: Income (showing Lemonade stand: 21 dollars, Pet sitting: 42 dollars, Babysitting: 36 dollars) and Expenses (showing Music lessons: 57 dollars, Games: 51 dollars, Movies: 55 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 1 dollars on movies",
      "Increase income from babysitting to 90 dollars",
      "Spend only 10 dollars on movies",
      "Increase income from lemonade stand to 85 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Jamie needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Jamie's sources of income to find the total income.\n21 dollars (Lemonade stand) + 42 dollars (Pet sitting) + 36 dollars (Babysitting) = 99 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Jamie's expenses to find the total expenses.\n57 dollars (Music lessons) + 51 dollars (Games) + 55 dollars (Movies) = 163 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Jamie's expenses are more than the income. Subtract to find the difference: 163 - 99 = 64 dollars"
      ],
      [
        "5/7",
        "So, Jamie needs an extra 64 dollars to balance the budget. \nFind the answer choice that gives Jamie an extra 64 dollars."
      ],
      [
        "6/7",
        "Jamie is planning to spend 57 dollars on music lessons. \nSpending only -7 dollars will give an extra 64 dollars."
      ],
      [
        "7/7",
        "So, Jamie can balance the budget by spending only -7 dollars on music lessons."
      ]
    ],
    "question_number": "1_36"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Cameron's budget for January.\n\nWhat could Cameron do to balance the budget?",
    "image_tag": "Gr7_49_1_37",
    "backend_description": "A budget table titled 'Cameron's January Budget' with two columns: Income (showing Yard work: 36 dollars, Dog walking: 34 dollars, Snow shoveling: 26 dollars) and Expenses (showing Birthday gifts: 46 dollars, Club dues: 23 dollars, Music lessons: 53 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 40 dollars on music lessons",
      "Increase income from yard work to 46 dollars",
      "Spend only 38 dollars on music lessons",
      "Spend only 20 dollars on birthday gifts"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Cameron needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Cameron's sources of income to find the total income.\n36 dollars (Yard work) + 34 dollars (Dog walking) + 26 dollars (Snow shoveling) = 96 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Cameron's expenses to find the total expenses.\n46 dollars (Birthday gifts) + 23 dollars (Club dues) + 53 dollars (Music lessons) = 122 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Cameron's expenses are more than the income. Subtract to find the difference: 122 - 96 = 26 dollars"
      ],
      [
        "5/7",
        "So, Cameron needs an extra 26 dollars to balance the budget. \nFind the answer choice that gives Cameron an extra 26 dollars."
      ],
      [
        "6/7",
        "Cameron is planning to spend 46 dollars on birthday gifts. \nSpending only 20 dollars will give an extra 26 dollars."
      ],
      [
        "7/7",
        "So, Cameron can balance the budget by spending only 20 dollars on birthday gifts."
      ]
    ],
    "question_number": "1_37"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Zion's budget for August.\n\nWhat could Zion do to balance the budget?",
    "image_tag": "Gr7_49_1_38",
    "backend_description": "A budget table titled 'Zion's August Budget' with two columns: Income (showing Yard work: 26 dollars, Babysitting: 20 dollars, Helping neighbors: 33 dollars) and Expenses (showing Books: 29 dollars, Phone bill: 56 dollars, Movies: 52 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from helping neighbors to 64 dollars",
      "Increase income from yard work to 37 dollars",
      "Spend only 26 dollars on movies",
      "Increase income from yard work to 84 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Zion needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Zion's sources of income to find the total income.\n26 dollars (Yard work) + 20 dollars (Babysitting) + 33 dollars (Helping neighbors) = 79 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Zion's expenses to find the total expenses.\n29 dollars (Books) + 56 dollars (Phone bill) + 52 dollars (Movies) = 137 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Zion's expenses are more than the income. Subtract to find the difference: 137 - 79 = 58 dollars"
      ],
      [
        "5/7",
        "So, Zion needs an extra 58 dollars to balance the budget. \nFind the answer choice that gives Zion an extra 58 dollars."
      ],
      [
        "6/7",
        "Zion is planning to spend 29 dollars on books. \nSpending only -29 dollars will give an extra 58 dollars."
      ],
      [
        "7/7",
        "So, Zion can balance the budget by spending only -29 dollars on books."
      ]
    ],
    "question_number": "1_38"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows River's budget for December.\n\nWhat could River do to balance the budget?",
    "image_tag": "Gr7_49_1_39",
    "backend_description": "A budget table titled 'River's December Budget' with two columns: Income (showing Helping neighbors: 20 dollars, Recycling: 17 dollars, Lawn mowing: 40 dollars) and Expenses (showing Lunch money: 46 dollars, Streaming service: 15 dollars, Concert tickets: 60 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only -23 dollars on streaming service",
      "Increase income from lawn mowing to 70 dollars",
      "Spend only 2 dollars on lunch money",
      "Increase income from helping neighbors to 30 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money River needs to balance the budget."
      ],
      [
        "2/7",
        "First, add River's sources of income to find the total income.\n20 dollars (Helping neighbors) + 17 dollars (Recycling) + 40 dollars (Lawn mowing) = 77 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add River's expenses to find the total expenses.\n46 dollars (Lunch money) + 15 dollars (Streaming service) + 60 dollars (Concert tickets) = 121 dollars (Total expenses)"
      ],
      [
        "4/7",
        "River's expenses are more than the income. Subtract to find the difference: 121 - 77 = 44 dollars"
      ],
      [
        "5/7",
        "So, River needs an extra 44 dollars to balance the budget. \nFind the answer choice that gives River an extra 44 dollars."
      ],
      [
        "6/7",
        "River is planning to spend 46 dollars on lunch money. \nSpending only 2 dollars will give an extra 44 dollars."
      ],
      [
        "7/7",
        "So, River can balance the budget by spending only 2 dollars on lunch money."
      ]
    ],
    "question_number": "1_39"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Sage's budget for January.\n\nWhat could Sage do to balance the budget?",
    "image_tag": "Gr7_49_1_40",
    "backend_description": "A budget table titled 'Sage's January Budget' with two columns: Income (showing Paper route: 34 dollars, Snow shoveling: 18 dollars, Recycling: 46 dollars) and Expenses (showing Books: 55 dollars, Magazine subscription: 49 dollars, Streaming service: 20 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 10 dollars on streaming service",
      "Increase income from recycling to 64 dollars",
      "Increase income from snow shoveling to 29 dollars",
      "Spend only 23 dollars on magazine subscription"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Sage needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Sage's sources of income to find the total income.\n34 dollars (Paper route) + 18 dollars (Snow shoveling) + 46 dollars (Recycling) = 98 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Sage's expenses to find the total expenses.\n55 dollars (Books) + 49 dollars (Magazine subscription) + 20 dollars (Streaming service) = 124 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Sage's expenses are more than the income. Subtract to find the difference: 124 - 98 = 26 dollars"
      ],
      [
        "5/7",
        "So, Sage needs an extra 26 dollars to balance the budget. \nFind the answer choice that gives Sage an extra 26 dollars."
      ],
      [
        "6/7",
        "Sage is planning to spend 49 dollars on magazine subscription. \nSpending only 23 dollars will give an extra 26 dollars."
      ],
      [
        "7/7",
        "So, Sage can balance the budget by spending only 23 dollars on magazine subscription."
      ]
    ],
    "question_number": "1_40"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Harley's budget for April.\n\nWhat could Harley do to balance the budget?",
    "image_tag": "Gr7_49_1_41",
    "backend_description": "A budget table titled 'Harley's April Budget' with two columns: Income (showing Recycling: 22 dollars, Car washing: 47 dollars, Lemonade stand: 36 dollars) and Expenses (showing Field trip: 86 dollars, Club dues: 15 dollars, Bus fare: 25 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 0 dollars on club dues",
      "Spend only 65 dollars on field trip",
      "Spend only 5 dollars on club dues",
      "Increase income from recycling to 31 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Harley needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Harley's sources of income to find the total income.\n22 dollars (Recycling) + 47 dollars (Car washing) + 36 dollars (Lemonade stand) = 105 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Harley's expenses to find the total expenses.\n86 dollars (Field trip) + 15 dollars (Club dues) + 25 dollars (Bus fare) = 126 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Harley's expenses are more than the income. Subtract to find the difference: 126 - 105 = 21 dollars"
      ],
      [
        "5/7",
        "So, Harley needs an extra 21 dollars to balance the budget. \nFind the answer choice that gives Harley an extra 21 dollars."
      ],
      [
        "6/7",
        "Harley is planning to spend 86 dollars on field trip. \nSpending only 65 dollars will give an extra 21 dollars."
      ],
      [
        "7/7",
        "So, Harley can balance the budget by spending only 65 dollars on field trip."
      ]
    ],
    "question_number": "1_41"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Rowan's budget for September.\n\nWhat could Rowan do to balance the budget?",
    "image_tag": "Gr7_49_1_42",
    "backend_description": "A budget table titled 'Rowan's September Budget' with two columns: Income (showing Paper route: 46 dollars, Snow shoveling: 16 dollars, Car washing: 21 dollars) and Expenses (showing Field trip: 39 dollars, Streaming service: 20 dollars, Club dues: 55 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 11 dollars on streaming service",
      "Spend only 24 dollars on club dues",
      "Spend only 21 dollars on field trip",
      "Increase income from snow shoveling to 42 dollars"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Rowan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Rowan's sources of income to find the total income.\n46 dollars (Paper route) + 16 dollars (Snow shoveling) + 21 dollars (Car washing) = 83 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Rowan's expenses to find the total expenses.\n39 dollars (Field trip) + 20 dollars (Streaming service) + 55 dollars (Club dues) = 114 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Rowan's expenses are more than the income. Subtract to find the difference: 114 - 83 = 31 dollars"
      ],
      [
        "5/7",
        "So, Rowan needs an extra 31 dollars to balance the budget. \nFind the answer choice that gives Rowan an extra 31 dollars."
      ],
      [
        "6/7",
        "Rowan is planning to spend 55 dollars on club dues. \nSpending only 24 dollars will give an extra 31 dollars."
      ],
      [
        "7/7",
        "So, Rowan can balance the budget by spending only 24 dollars on club dues."
      ]
    ],
    "question_number": "1_42"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Dakota's budget for December.\n\nWhat could Dakota do to balance the budget?",
    "image_tag": "Gr7_49_1_43",
    "backend_description": "A budget table titled 'Dakota's December Budget' with two columns: Income (showing Chores: 45 dollars, Car washing: 20 dollars, Paper route: 34 dollars) and Expenses (showing Music lessons: 53 dollars, Snacks: 18 dollars, Streaming service: 44 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 2 dollars on snacks",
      "Spend only 44 dollars on music lessons",
      "Increase income from paper route to 39 dollars",
      "Spend only 33 dollars on streaming service"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Dakota needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Dakota's sources of income to find the total income.\n45 dollars (Chores) + 20 dollars (Car washing) + 34 dollars (Paper route) = 99 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Dakota's expenses to find the total expenses.\n53 dollars (Music lessons) + 18 dollars (Snacks) + 44 dollars (Streaming service) = 115 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Dakota's expenses are more than the income. Subtract to find the difference: 115 - 99 = 16 dollars"
      ],
      [
        "5/7",
        "So, Dakota needs an extra 16 dollars to balance the budget. \nFind the answer choice that gives Dakota an extra 16 dollars."
      ],
      [
        "6/7",
        "Dakota is planning to spend 18 dollars on snacks. \nSpending only 2 dollars will give an extra 16 dollars."
      ],
      [
        "7/7",
        "So, Dakota can balance the budget by spending only 2 dollars on snacks."
      ]
    ],
    "question_number": "1_43"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Morgan's budget for May.\n\nWhat could Morgan do to balance the budget?",
    "image_tag": "Gr7_49_1_44",
    "backend_description": "A budget table titled 'Morgan's May Budget' with two columns: Income (showing Paper route: 15 dollars, Car washing: 34 dollars, Helping neighbors: 38 dollars) and Expenses (showing Books: 57 dollars, Phone bill: 44 dollars, Snacks: 35 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from paper route to 64 dollars",
      "Spend only 9 dollars on phone bill",
      "Increase income from helping neighbors to 57 dollars",
      "Spend only 32 dollars on books"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Morgan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Morgan's sources of income to find the total income.\n15 dollars (Paper route) + 34 dollars (Car washing) + 38 dollars (Helping neighbors) = 87 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Morgan's expenses to find the total expenses.\n57 dollars (Books) + 44 dollars (Phone bill) + 35 dollars (Snacks) = 136 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Morgan's expenses are more than the income. Subtract to find the difference: 136 - 87 = 49 dollars"
      ],
      [
        "5/7",
        "So, Morgan needs an extra 49 dollars to balance the budget. \nFind the answer choice that gives Morgan an extra 49 dollars."
      ],
      [
        "6/7",
        "Morgan is planning to spend 35 dollars on snacks. \nSpending only -14 dollars will give an extra 49 dollars."
      ],
      [
        "7/7",
        "So, Morgan can balance the budget by spending only -14 dollars on snacks."
      ]
    ],
    "question_number": "1_44"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Drew's budget for September.\n\nWhat could Drew do to balance the budget?",
    "image_tag": "Gr7_49_1_45",
    "backend_description": "A budget table titled 'Drew's September Budget' with two columns: Income (showing Car washing: 19 dollars, Recycling: 39 dollars, Leaf raking: 22 dollars) and Expenses (showing Magazine subscription: 40 dollars, Hobby supplies: 32 dollars, Bus fare: 58 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from recycling to 64 dollars",
      "Spend only 2 dollars on magazine subscription",
      "Increase income from car washing to 69 dollars",
      "Spend only 12 dollars on magazine subscription"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Drew needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Drew's sources of income to find the total income.\n19 dollars (Car washing) + 39 dollars (Recycling) + 22 dollars (Leaf raking) = 80 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Drew's expenses to find the total expenses.\n40 dollars (Magazine subscription) + 32 dollars (Hobby supplies) + 58 dollars (Bus fare) = 130 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Drew's expenses are more than the income. Subtract to find the difference: 130 - 80 = 50 dollars"
      ],
      [
        "5/7",
        "So, Drew needs an extra 50 dollars to balance the budget. \nFind the answer choice that gives Drew an extra 50 dollars."
      ],
      [
        "6/7",
        "Drew is planning to spend 32 dollars on hobby supplies. \nSpending only -18 dollars will give an extra 50 dollars."
      ],
      [
        "7/7",
        "So, Drew can balance the budget by spending only -18 dollars on hobby supplies."
      ]
    ],
    "question_number": "1_45"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Atlas's budget for January.\n\nWhat could Atlas do to balance the budget?",
    "image_tag": "Gr7_49_1_46",
    "backend_description": "A budget table titled 'Atlas's January Budget' with two columns: Income (showing Leaf raking: 35 dollars, Yard work: 27 dollars, Car washing: 24 dollars) and Expenses (showing Music lessons: 52 dollars, Phone bill: 56 dollars, Books: 36 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 9 dollars on music lessons",
      "Increase income from leaf raking to 93 dollars",
      "Increase income from yard work to 36 dollars",
      "Spend only 48 dollars on phone bill"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Atlas needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Atlas's sources of income to find the total income.\n35 dollars (Leaf raking) + 27 dollars (Yard work) + 24 dollars (Car washing) = 86 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Atlas's expenses to find the total expenses.\n52 dollars (Music lessons) + 56 dollars (Phone bill) + 36 dollars (Books) = 144 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Atlas's expenses are more than the income. Subtract to find the difference: 144 - 86 = 58 dollars"
      ],
      [
        "5/7",
        "So, Atlas needs an extra 58 dollars to balance the budget. \nFind the answer choice that gives Atlas an extra 58 dollars."
      ],
      [
        "6/7",
        "Atlas is planning to spend 36 dollars on books. \nSpending only -22 dollars will give an extra 58 dollars."
      ],
      [
        "7/7",
        "So, Atlas can balance the budget by spending only -22 dollars on books."
      ]
    ],
    "question_number": "1_46"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows River's budget for June.\n\nWhat could River do to balance the budget?",
    "image_tag": "Gr7_49_1_47",
    "backend_description": "A budget table titled 'River's June Budget' with two columns: Income (showing Lawn mowing: 21 dollars, Car washing: 15 dollars, Snow shoveling: 39 dollars) and Expenses (showing Music lessons: 38 dollars, School supplies: 30 dollars, Books: 50 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from snow shoveling to 45 dollars",
      "Increase income from lawn mowing to 64 dollars",
      "Spend only -4 dollars on school supplies",
      "Spend only -2 dollars on school supplies"
    ],
    "correct_answers": [
      "B"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money River needs to balance the budget."
      ],
      [
        "2/7",
        "First, add River's sources of income to find the total income.\n21 dollars (Lawn mowing) + 15 dollars (Car washing) + 39 dollars (Snow shoveling) = 75 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add River's expenses to find the total expenses.\n38 dollars (Music lessons) + 30 dollars (School supplies) + 50 dollars (Books) = 118 dollars (Total expenses)"
      ],
      [
        "4/7",
        "River's expenses are more than the income. Subtract to find the difference: 118 - 75 = 43 dollars"
      ],
      [
        "5/7",
        "So, River needs an extra 43 dollars to balance the budget. \nFind the answer choice that gives River an extra 43 dollars."
      ],
      [
        "6/7",
        "River is planning to spend 38 dollars on music lessons. \nSpending only -5 dollars will give an extra 43 dollars."
      ],
      [
        "7/7",
        "So, River can balance the budget by spending only -5 dollars on music lessons."
      ]
    ],
    "question_number": "1_47"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Morgan's budget for September.\n\nWhat could Morgan do to balance the budget?",
    "image_tag": "Gr7_49_1_48",
    "backend_description": "A budget table titled 'Morgan's September Budget' with two columns: Income (showing Helping neighbors: 16 dollars, Tutoring: 28 dollars, Garden work: 28 dollars) and Expenses (showing Sports equipment: 39 dollars, Games: 60 dollars, Club dues: 25 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from helping neighbors to 68 dollars",
      "Spend only -6 dollars on club dues",
      "Spend only 1 dollars on club dues",
      "Spend only -20 dollars on club dues"
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Morgan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Morgan's sources of income to find the total income.\n16 dollars (Helping neighbors) + 28 dollars (Tutoring) + 28 dollars (Garden work) = 72 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Morgan's expenses to find the total expenses.\n39 dollars (Sports equipment) + 60 dollars (Games) + 25 dollars (Club dues) = 124 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Morgan's expenses are more than the income. Subtract to find the difference: 124 - 72 = 52 dollars"
      ],
      [
        "5/7",
        "So, Morgan needs an extra 52 dollars to balance the budget. \nFind the answer choice that gives Morgan an extra 52 dollars."
      ],
      [
        "6/7",
        "Morgan is planning to spend 39 dollars on sports equipment. \nSpending only -13 dollars will give an extra 52 dollars."
      ],
      [
        "7/7",
        "So, Morgan can balance the budget by spending only -13 dollars on sports equipment."
      ]
    ],
    "question_number": "1_48"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Blake's budget for May.\n\nWhat could Blake do to balance the budget?",
    "image_tag": "Gr7_49_1_49",
    "backend_description": "A budget table titled 'Blake's May Budget' with two columns: Income (showing Chores: 36 dollars, Snow shoveling: 37 dollars, Tutoring: 37 dollars) and Expenses (showing Games: 37 dollars, Art supplies: 42 dollars, Bus fare: 46 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Increase income from tutoring to 43 dollars",
      "Increase income from chores to 41 dollars",
      "Spend only 27 dollars on art supplies",
      "Increase income from tutoring to 47 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Blake needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Blake's sources of income to find the total income.\n36 dollars (Chores) + 37 dollars (Snow shoveling) + 37 dollars (Tutoring) = 110 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Blake's expenses to find the total expenses.\n37 dollars (Games) + 42 dollars (Art supplies) + 46 dollars (Bus fare) = 125 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Blake's expenses are more than the income. Subtract to find the difference: 125 - 110 = 15 dollars"
      ],
      [
        "5/7",
        "So, Blake needs an extra 15 dollars to balance the budget. \nFind the answer choice that gives Blake an extra 15 dollars."
      ],
      [
        "6/7",
        "Blake is planning to spend 42 dollars on art supplies. \nSpending only 27 dollars will give an extra 15 dollars."
      ],
      [
        "7/7",
        "So, Blake can balance the budget by spending only 27 dollars on art supplies."
      ]
    ],
    "question_number": "1_49"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Rowan's budget for February.\n\nWhat could Rowan do to balance the budget?",
    "image_tag": "Gr7_49_1_50",
    "backend_description": "A budget table titled 'Rowan's February Budget' with two columns: Income (showing Snow shoveling: 20 dollars, Babysitting: 21 dollars, Chores: 19 dollars) and Expenses (showing Science fair: 53 dollars, Phone bill: 46 dollars, School supplies: 58 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only -24 dollars on phone bill",
      "Spend only 39 dollars on science fair",
      "Increase income from snow shoveling to 94 dollars",
      "Increase income from snow shoveling to 117 dollars"
    ],
    "correct_answers": [
      "D"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Rowan needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Rowan's sources of income to find the total income.\n20 dollars (Snow shoveling) + 21 dollars (Babysitting) + 19 dollars (Chores) = 60 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Rowan's expenses to find the total expenses.\n53 dollars (Science fair) + 46 dollars (Phone bill) + 58 dollars (School supplies) = 157 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Rowan's expenses are more than the income. Subtract to find the difference: 157 - 60 = 97 dollars"
      ],
      [
        "5/7",
        "So, Rowan needs an extra 97 dollars to balance the budget. \nFind the answer choice that gives Rowan an extra 97 dollars."
      ],
      [
        "6/7",
        "Rowan is planning to spend 58 dollars on school supplies. \nSpending only -39 dollars will give an extra 97 dollars."
      ],
      [
        "7/7",
        "So, Rowan can balance the budget by spending only -39 dollars on school supplies."
      ]
    ],
    "question_number": "1_50"
  },
  {
    "skills": "adjust-a-budget",
    "question_text": "This table shows Orion's budget for June.\n\nWhat could Orion do to balance the budget?",
    "image_tag": "Gr7_49_1_51",
    "backend_description": "A budget table titled 'Orion's June Budget' with two columns: Income (showing Pet sitting: 33 dollars, Dog walking: 45 dollars, Snow shoveling: 40 dollars) and Expenses (showing Music lessons: 50 dollars, Science fair: 47 dollars, Birthday gifts: 44 dollars). The clear layout helps students analyze budget balancing.",
    "tag": "Gr7_49_E1",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Spend only 33 dollars on birthday gifts",
      "Spend only 36 dollars on birthday gifts",
      "Spend only 24 dollars on science fair",
      "Increase income from pet sitting to 46 dollars"
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [],
    "solution": [
      [
        "1/7",
        "Find how much money Orion needs to balance the budget."
      ],
      [
        "2/7",
        "First, add Orion's sources of income to find the total income.\n33 dollars (Pet sitting) + 45 dollars (Dog walking) + 40 dollars (Snow shoveling) = 118 dollars (Total income)"
      ],
      [
        "3/7",
        "Next, add Orion's expenses to find the total expenses.\n50 dollars (Music lessons) + 47 dollars (Science fair) + 44 dollars (Birthday gifts) = 141 dollars (Total expenses)"
      ],
      [
        "4/7",
        "Orion's expenses are more than the income. Subtract to find the difference: 141 - 118 = 23 dollars"
      ],
      [
        "5/7",
        "So, Orion needs an extra 23 dollars to balance the budget. \nFind the answer choice that gives Orion an extra 23 dollars."
      ],
      [
        "6/7",
        "Orion is planning to spend 47 dollars on science fair. \nSpending only 24 dollars will give an extra 23 dollars."
      ],
      [
        "7/7",
        "So, Orion can balance the budget by spending only 24 dollars on science fair."
      ]
    ],
    "question_number": "1_51"
  }
]