[
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Layla makes necklaces out of cube-shaped beads. Each bead has a volume of one cubic centimetre. She keeps the beads in a jewellery box that is shaped like a rectangular prism.\n\nThe jewellery box has a height of 6 centimetres. The bottom of the jewellery box can be completely covered by a layer of 60 beads. What is the volume of the jewellery box?\n _ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "360"
      ],
      [
        "360.0"
      ],
      [
        "360.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the jewellery box, you can multiply how many beads are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 60 one cubic centimetre beads in the bottom layer. Since the jewellery box is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "60 x 6 = 360"
      ],
      [
        "4/4",
        "360 one cubic centimetre beads would fill the jewellery box. Therefore, the volume of the jewellery box is 360 cubic centimetres."
      ]
    ],
    "question_number": "2_1",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Naruto collects ninja training weights. Each ninja training weight has a volume of one cubic centimetre. They are kept in a equipment chest that is shaped like a rectangular prism.\n\nThe equipment chest has a height of 6 centimetres. The bottom of the equipment chest can be completely covered by a layer of 89 ninja training weights. What is the volume of the equipment chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "534"
      ],
      [
        "534.0"
      ],
      [
        "534.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the equipment chest, you can multiply how many ninja training weights are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 89 one cubic centimetre ninja training weights in the bottom layer. Since the equipment chest is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "89 x 6 = 534"
      ],
      [
        "4/4",
        "534 one cubic centimetre ninja training weights would fill the equipment chest. Therefore, the volume of the equipment chest is 534 cubic centimetres."
      ]
    ],
    "question_number": "2_2",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Harry Potter collects spell components. Each spell component has a volume of one cubic centimetre. They are kept in a potion cabinet that is shaped like a rectangular prism.\n\nThe potion cabinet has a height of 6 centimetres. The bottom of the potion cabinet can be completely covered by a layer of 28 spell components. What is the volume of the potion cabinet?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "168"
      ],
      [
        "168.0"
      ],
      [
        "168.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the potion cabinet, you can multiply how many spell components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 28 one cubic centimetre spell components in the bottom layer. Since the potion cabinet is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "28 x 6 = 168"
      ],
      [
        "4/4",
        "168 one cubic centimetre spell components would fill the potion cabinet. Therefore, the volume of the potion cabinet is 168 cubic centimetres."
      ]
    ],
    "question_number": "2_3",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Mario collects power-up blocks. Each power-up block has a volume of one cubic centimetre. They are kept in a warp pipe storage that is shaped like a rectangular prism.\n\nThe warp pipe storage has a height of 5 centimetres. The bottom of the warp pipe storage can be completely covered by a layer of 34 power-up blocks. What is the volume of the warp pipe storage?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "170"
      ],
      [
        "170.0"
      ],
      [
        "170.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the warp pipe storage, you can multiply how many power-up blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 34 one cubic centimetre power-up blocks in the bottom layer. Since the warp pipe storage is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "34 x 5 = 170"
      ],
      [
        "4/4",
        "170 one cubic centimetre power-up blocks would fill the warp pipe storage. Therefore, the volume of the warp pipe storage is 170 cubic centimetres."
      ]
    ],
    "question_number": "2_4",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Pikachu collects energy cubes. Each energy cube has a volume of one cubic centimetre. They are kept in a Pokéball storage compartment that is shaped like a rectangular prism.\n\nThe Pokéball storage compartment has a height of 12 centimetres. The bottom of the Pokéball storage compartment can be completely covered by a layer of 54 energy cubes. What is the volume of the Pokéball storage compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "648"
      ],
      [
        "648.0"
      ],
      [
        "648.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the Pokéball storage compartment, you can multiply how many energy cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 54 one cubic centimetre energy cubes in the bottom layer. Since the Pokéball storage compartment is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "54 x 12 = 648"
      ],
      [
        "4/4",
        "648 one cubic centimetre energy cubes would fill the Pokéball storage compartment. Therefore, the volume of the Pokéball storage compartment is 648 cubic centimetres."
      ]
    ],
    "question_number": "2_5",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Elsa collects ice crystals. Each ice crystal has a volume of one cubic centimetre. They are kept in a ice palace vault that is shaped like a rectangular prism.\n\nThe ice palace vault has a height of 5 centimetres. The bottom of the ice palace vault can be completely covered by a layer of 75 ice crystals. What is the volume of the ice palace vault?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "375"
      ],
      [
        "375.0"
      ],
      [
        "375.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ice palace vault, you can multiply how many ice crystals are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 75 one cubic centimetre ice crystals in the bottom layer. Since the ice palace vault is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "75 x 5 = 375"
      ],
      [
        "4/4",
        "375 one cubic centimetre ice crystals would fill the ice palace vault. Therefore, the volume of the ice palace vault is 375 cubic centimetres."
      ]
    ],
    "question_number": "2_6",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Spider-Man collects web cartridges. Each web cartridge has a volume of one cubic centimetre. They are kept in a utility belt compartment that is shaped like a rectangular prism.\n\nThe utility belt compartment has a height of 10 centimetres. The bottom of the utility belt compartment can be completely covered by a layer of 97 web cartridges. What is the volume of the utility belt compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "970"
      ],
      [
        "970.0"
      ],
      [
        "970.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the utility belt compartment, you can multiply how many web cartridges are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 97 one cubic centimetre web cartridges in the bottom layer. Since the utility belt compartment is 10 centimetres tall, 10 layers would fill it."
      ],
      [
        "3/4",
        "97 x 10 = 970"
      ],
      [
        "4/4",
        "970 one cubic centimetre web cartridges would fill the utility belt compartment. Therefore, the volume of the utility belt compartment is 970 cubic centimetres."
      ]
    ],
    "question_number": "2_7",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Minecraft Steve collects resource blocks. Each resource block has a volume of one cubic centimetre. They are kept in a chest that is shaped like a rectangular prism.\n\nThe chest has a height of 7 centimetres. The bottom of the chest can be completely covered by a layer of 100 resource blocks. What is the volume of the chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "700"
      ],
      [
        "700.0"
      ],
      [
        "700.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the chest, you can multiply how many resource blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 100 one cubic centimetre resource blocks in the bottom layer. Since the chest is 7 centimetres tall, 7 layers would fill it."
      ],
      [
        "3/4",
        "100 x 7 = 700"
      ],
      [
        "4/4",
        "700 one cubic centimetre resource blocks would fill the chest. Therefore, the volume of the chest is 700 cubic centimetres."
      ]
    ],
    "question_number": "2_8",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Goku collects senzu bean containers. Each senzu bean container has a volume of one cubic centimetre. They are kept in a capsule storage unit that is shaped like a rectangular prism.\n\nThe capsule storage unit has a height of 10 centimetres. The bottom of the capsule storage unit can be completely covered by a layer of 88 senzu bean containers. What is the volume of the capsule storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "880"
      ],
      [
        "880.0"
      ],
      [
        "880.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the capsule storage unit, you can multiply how many senzu bean containers are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 88 one cubic centimetre senzu bean containers in the bottom layer. Since the capsule storage unit is 10 centimetres tall, 10 layers would fill it."
      ],
      [
        "3/4",
        "88 x 10 = 880"
      ],
      [
        "4/4",
        "880 one cubic centimetre senzu bean containers would fill the capsule storage unit. Therefore, the volume of the capsule storage unit is 880 cubic centimetres."
      ]
    ],
    "question_number": "2_9",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Link collects rupee gems. Each rupee gem has a volume of one cubic centimetre. They are kept in a treasure chest that is shaped like a rectangular prism.\n\nThe treasure chest has a height of 4 centimetres. The bottom of the treasure chest can be completely covered by a layer of 61 rupee gems. What is the volume of the treasure chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "244"
      ],
      [
        "244.0"
      ],
      [
        "244.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the treasure chest, you can multiply how many rupee gems are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 61 one cubic centimetre rupee gems in the bottom layer. Since the treasure chest is 4 centimetres tall, 4 layers would fill it."
      ],
      [
        "3/4",
        "61 x 4 = 244"
      ],
      [
        "4/4",
        "244 one cubic centimetre rupee gems would fill the treasure chest. Therefore, the volume of the treasure chest is 244 cubic centimetres."
      ]
    ],
    "question_number": "2_10",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Iron Man collects arc reactor components. Each arc reactor component has a volume of one cubic centimetre. They are kept in a workshop storage unit that is shaped like a rectangular prism.\n\nThe workshop storage unit has a height of 9 centimetres. The bottom of the workshop storage unit can be completely covered by a layer of 94 arc reactor components. What is the volume of the workshop storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "846"
      ],
      [
        "846.0"
      ],
      [
        "846.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the workshop storage unit, you can multiply how many arc reactor components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 94 one cubic centimetre arc reactor components in the bottom layer. Since the workshop storage unit is 9 centimetres tall, 9 layers would fill it."
      ],
      [
        "3/4",
        "94 x 9 = 846"
      ],
      [
        "4/4",
        "846 one cubic centimetre arc reactor components would fill the workshop storage unit. Therefore, the volume of the workshop storage unit is 846 cubic centimetres."
      ]
    ],
    "question_number": "2_11",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Hermione collects library book cubes. Each library book cube has a volume of one cubic centimetre. They are kept in a enchanted trunk that is shaped like a rectangular prism.\n\nThe enchanted trunk has a height of 6 centimetres. The bottom of the enchanted trunk can be completely covered by a layer of 45 library book cubes. What is the volume of the enchanted trunk?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "270"
      ],
      [
        "270.0"
      ],
      [
        "270.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the enchanted trunk, you can multiply how many library book cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 45 one cubic centimetre library book cubes in the bottom layer. Since the enchanted trunk is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "45 x 6 = 270"
      ],
      [
        "4/4",
        "270 one cubic centimetre library book cubes would fill the enchanted trunk. Therefore, the volume of the enchanted trunk is 270 cubic centimetres."
      ]
    ],
    "question_number": "2_12",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Sonic collects chaos emerald fragments. Each chaos emerald fragment has a volume of one cubic centimetre. They are kept in a ring storage box that is shaped like a rectangular prism.\n\nThe ring storage box has a height of 11 centimetres. The bottom of the ring storage box can be completely covered by a layer of 46 chaos emerald fragments. What is the volume of the ring storage box?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "506"
      ],
      [
        "506.0"
      ],
      [
        "506.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ring storage box, you can multiply how many chaos emerald fragments are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 46 one cubic centimetre chaos emerald fragments in the bottom layer. Since the ring storage box is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "46 x 11 = 506"
      ],
      [
        "4/4",
        "506 one cubic centimetre chaos emerald fragments would fill the ring storage box. Therefore, the volume of the ring storage box is 506 cubic centimetres."
      ]
    ],
    "question_number": "2_13",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Batman collects gadget components. Each gadget component has a volume of one cubic centimetre. They are kept in a Batcave storage compartment that is shaped like a rectangular prism.\n\nThe Batcave storage compartment has a height of 8 centimetres. The bottom of the Batcave storage compartment can be completely covered by a layer of 20 gadget components. What is the volume of the Batcave storage compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "160"
      ],
      [
        "160.0"
      ],
      [
        "160.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the Batcave storage compartment, you can multiply how many gadget components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 20 one cubic centimetre gadget components in the bottom layer. Since the Batcave storage compartment is 8 centimetres tall, 8 layers would fill it."
      ],
      [
        "3/4",
        "20 x 8 = 160"
      ],
      [
        "4/4",
        "160 one cubic centimetre gadget components would fill the Batcave storage compartment. Therefore, the volume of the Batcave storage compartment is 160 cubic centimetres."
      ]
    ],
    "question_number": "2_14",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Luffy collects meat cubes. Each meat cube has a volume of one cubic centimetre. They are kept in a ship's food locker that is shaped like a rectangular prism.\n\nThe ship's food locker has a height of 3 centimetres. The bottom of the ship's food locker can be completely covered by a layer of 49 meat cubes. What is the volume of the ship's food locker?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "147"
      ],
      [
        "147.0"
      ],
      [
        "147.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ship's food locker, you can multiply how many meat cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 49 one cubic centimetre meat cubes in the bottom layer. Since the ship's food locker is 3 centimetres tall, 3 layers would fill it."
      ],
      [
        "3/4",
        "49 x 3 = 147"
      ],
      [
        "4/4",
        "147 one cubic centimetre meat cubes would fill the ship's food locker. Therefore, the volume of the ship's food locker is 147 cubic centimetres."
      ]
    ],
    "question_number": "2_15",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Ash Ketchum collects Pokéball components. Each Pokéball component has a volume of one cubic centimetre. They are kept in a trainer's backpack compartment that is shaped like a rectangular prism.\n\nThe trainer's backpack compartment has a height of 5 centimetres. The bottom of the trainer's backpack compartment can be completely covered by a layer of 51 Pokéball components. What is the volume of the trainer's backpack compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "255"
      ],
      [
        "255.0"
      ],
      [
        "255.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the trainer's backpack compartment, you can multiply how many Pokéball components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 51 one cubic centimetre Pokéball components in the bottom layer. Since the trainer's backpack compartment is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "51 x 5 = 255"
      ],
      [
        "4/4",
        "255 one cubic centimetre Pokéball components would fill the trainer's backpack compartment. Therefore, the volume of the trainer's backpack compartment is 255 cubic centimetres."
      ]
    ],
    "question_number": "2_16",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Thor collects Asgardian power stones. Each Asgardian power stone has a volume of one cubic centimetre. They are kept in a mystical vault that is shaped like a rectangular prism.\n\nThe mystical vault has a height of 4 centimetres. The bottom of the mystical vault can be completely covered by a layer of 99 Asgardian power stones. What is the volume of the mystical vault?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "396"
      ],
      [
        "396.0"
      ],
      [
        "396.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the mystical vault, you can multiply how many Asgardian power stones are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 99 one cubic centimetre Asgardian power stones in the bottom layer. Since the mystical vault is 4 centimetres tall, 4 layers would fill it."
      ],
      [
        "3/4",
        "99 x 4 = 396"
      ],
      [
        "4/4",
        "396 one cubic centimetre Asgardian power stones would fill the mystical vault. Therefore, the volume of the mystical vault is 396 cubic centimetres."
      ]
    ],
    "question_number": "2_17",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Deku collects hero training blocks. Each hero training block has a volume of one cubic centimetre. They are kept in a U.A. storage locker that is shaped like a rectangular prism.\n\nThe U.A. storage locker has a height of 8 centimetres. The bottom of the U.A. storage locker can be completely covered by a layer of 53 hero training blocks. What is the volume of the U.A. storage locker?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "424"
      ],
      [
        "424.0"
      ],
      [
        "424.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the U.A. storage locker, you can multiply how many hero training blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 53 one cubic centimetre hero training blocks in the bottom layer. Since the U.A. storage locker is 8 centimetres tall, 8 layers would fill it."
      ],
      [
        "3/4",
        "53 x 8 = 424"
      ],
      [
        "4/4",
        "424 one cubic centimetre hero training blocks would fill the U.A. storage locker. Therefore, the volume of the U.A. storage locker is 424 cubic centimetres."
      ]
    ],
    "question_number": "2_18",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Tanjiro collects breathing technique crystals. Each breathing technique crystal has a volume of one cubic centimetre. They are kept in a demon slayer equipment box that is shaped like a rectangular prism.\n\nThe demon slayer equipment box has a height of 5 centimetres. The bottom of the demon slayer equipment box can be completely covered by a layer of 98 breathing technique crystals. What is the volume of the demon slayer equipment box?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "490"
      ],
      [
        "490.0"
      ],
      [
        "490.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the demon slayer equipment box, you can multiply how many breathing technique crystals are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 98 one cubic centimetre breathing technique crystals in the bottom layer. Since the demon slayer equipment box is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "98 x 5 = 490"
      ],
      [
        "4/4",
        "490 one cubic centimetre breathing technique crystals would fill the demon slayer equipment box. Therefore, the volume of the demon slayer equipment box is 490 cubic centimetres."
      ]
    ],
    "question_number": "2_19",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Captain America collects vibranium samples. Each vibranium sample has a volume of one cubic centimetre. They are kept in a S.H.I.E.L.D. containment unit that is shaped like a rectangular prism.\n\nThe S.H.I.E.L.D. containment unit has a height of 8 centimetres. The bottom of the S.H.I.E.L.D. containment unit can be completely covered by a layer of 89 vibranium samples. What is the volume of the S.H.I.E.L.D. containment unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "712"
      ],
      [
        "712.0"
      ],
      [
        "712.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the S.H.I.E.L.D. containment unit, you can multiply how many vibranium samples are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 89 one cubic centimetre vibranium samples in the bottom layer. Since the S.H.I.E.L.D. containment unit is 8 centimetres tall, 8 layers would fill it."
      ],
      [
        "3/4",
        "89 x 8 = 712"
      ],
      [
        "4/4",
        "712 one cubic centimetre vibranium samples would fill the S.H.I.E.L.D. containment unit. Therefore, the volume of the S.H.I.E.L.D. containment unit is 712 cubic centimetres."
      ]
    ],
    "question_number": "2_20",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Gojo collects cursed energy blocks. Each cursed energy block has a volume of one cubic centimetre. They are kept in a jujutsu technique storage that is shaped like a rectangular prism.\n\nThe jujutsu technique storage has a height of 6 centimetres. The bottom of the jujutsu technique storage can be completely covered by a layer of 55 cursed energy blocks. What is the volume of the jujutsu technique storage?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "330"
      ],
      [
        "330.0"
      ],
      [
        "330.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the jujutsu technique storage, you can multiply how many cursed energy blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 55 one cubic centimetre cursed energy blocks in the bottom layer. Since the jujutsu technique storage is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "55 x 6 = 330"
      ],
      [
        "4/4",
        "330 one cubic centimetre cursed energy blocks would fill the jujutsu technique storage. Therefore, the volume of the jujutsu technique storage is 330 cubic centimetres."
      ]
    ],
    "question_number": "2_21",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Naruto collects ninja training weights. Each ninja training weight has a volume of one cubic centimetre. They are kept in a equipment chest that is shaped like a rectangular prism.\n\nThe equipment chest has a height of 12 centimetres. The bottom of the equipment chest can be completely covered by a layer of 85 ninja training weights. What is the volume of the equipment chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "1020"
      ],
      [
        "1020.0"
      ],
      [
        "1020.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the equipment chest, you can multiply how many ninja training weights are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 85 one cubic centimetre ninja training weights in the bottom layer. Since the equipment chest is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "85 x 12 = 1020"
      ],
      [
        "4/4",
        "1020 one cubic centimetre ninja training weights would fill the equipment chest. Therefore, the volume of the equipment chest is 1020 cubic centimetres."
      ]
    ],
    "question_number": "2_22",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Harry Potter collects spell components. Each spell component has a volume of one cubic centimetre. They are kept in a potion cabinet that is shaped like a rectangular prism.\n\nThe potion cabinet has a height of 6 centimetres. The bottom of the potion cabinet can be completely covered by a layer of 99 spell components. What is the volume of the potion cabinet?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "594"
      ],
      [
        "594.0"
      ],
      [
        "594.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the potion cabinet, you can multiply how many spell components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 99 one cubic centimetre spell components in the bottom layer. Since the potion cabinet is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "99 x 6 = 594"
      ],
      [
        "4/4",
        "594 one cubic centimetre spell components would fill the potion cabinet. Therefore, the volume of the potion cabinet is 594 cubic centimetres."
      ]
    ],
    "question_number": "2_23",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Mario collects power-up blocks. Each power-up block has a volume of one cubic centimetre. They are kept in a warp pipe storage that is shaped like a rectangular prism.\n\nThe warp pipe storage has a height of 11 centimetres. The bottom of the warp pipe storage can be completely covered by a layer of 26 power-up blocks. What is the volume of the warp pipe storage?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "286"
      ],
      [
        "286.0"
      ],
      [
        "286.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the warp pipe storage, you can multiply how many power-up blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 26 one cubic centimetre power-up blocks in the bottom layer. Since the warp pipe storage is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "26 x 11 = 286"
      ],
      [
        "4/4",
        "286 one cubic centimetre power-up blocks would fill the warp pipe storage. Therefore, the volume of the warp pipe storage is 286 cubic centimetres."
      ]
    ],
    "question_number": "2_24",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Pikachu collects energy cubes. Each energy cube has a volume of one cubic centimetre. They are kept in a Pokéball storage compartment that is shaped like a rectangular prism.\n\nThe Pokéball storage compartment has a height of 12 centimetres. The bottom of the Pokéball storage compartment can be completely covered by a layer of 56 energy cubes. What is the volume of the Pokéball storage compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "672"
      ],
      [
        "672.0"
      ],
      [
        "672.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the Pokéball storage compartment, you can multiply how many energy cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 56 one cubic centimetre energy cubes in the bottom layer. Since the Pokéball storage compartment is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "56 x 12 = 672"
      ],
      [
        "4/4",
        "672 one cubic centimetre energy cubes would fill the Pokéball storage compartment. Therefore, the volume of the Pokéball storage compartment is 672 cubic centimetres."
      ]
    ],
    "question_number": "2_25",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Elsa collects ice crystals. Each ice crystal has a volume of one cubic centimetre. They are kept in a ice palace vault that is shaped like a rectangular prism.\n\nThe ice palace vault has a height of 5 centimetres. The bottom of the ice palace vault can be completely covered by a layer of 26 ice crystals. What is the volume of the ice palace vault?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "130"
      ],
      [
        "130.0"
      ],
      [
        "130.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ice palace vault, you can multiply how many ice crystals are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 26 one cubic centimetre ice crystals in the bottom layer. Since the ice palace vault is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "26 x 5 = 130"
      ],
      [
        "4/4",
        "130 one cubic centimetre ice crystals would fill the ice palace vault. Therefore, the volume of the ice palace vault is 130 cubic centimetres."
      ]
    ],
    "question_number": "2_26",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Spider-Man collects web cartridges. Each web cartridge has a volume of one cubic centimetre. They are kept in a utility belt compartment that is shaped like a rectangular prism.\n\nThe utility belt compartment has a height of 11 centimetres. The bottom of the utility belt compartment can be completely covered by a layer of 27 web cartridges. What is the volume of the utility belt compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "297"
      ],
      [
        "297.0"
      ],
      [
        "297.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the utility belt compartment, you can multiply how many web cartridges are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 27 one cubic centimetre web cartridges in the bottom layer. Since the utility belt compartment is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "27 x 11 = 297"
      ],
      [
        "4/4",
        "297 one cubic centimetre web cartridges would fill the utility belt compartment. Therefore, the volume of the utility belt compartment is 297 cubic centimetres."
      ]
    ],
    "question_number": "2_27",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Minecraft Steve collects resource blocks. Each resource block has a volume of one cubic centimetre. They are kept in a chest that is shaped like a rectangular prism.\n\nThe chest has a height of 6 centimetres. The bottom of the chest can be completely covered by a layer of 35 resource blocks. What is the volume of the chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "210"
      ],
      [
        "210.0"
      ],
      [
        "210.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the chest, you can multiply how many resource blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 35 one cubic centimetre resource blocks in the bottom layer. Since the chest is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "35 x 6 = 210"
      ],
      [
        "4/4",
        "210 one cubic centimetre resource blocks would fill the chest. Therefore, the volume of the chest is 210 cubic centimetres."
      ]
    ],
    "question_number": "2_28",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Goku collects senzu bean containers. Each senzu bean container has a volume of one cubic centimetre. They are kept in a capsule storage unit that is shaped like a rectangular prism.\n\nThe capsule storage unit has a height of 5 centimetres. The bottom of the capsule storage unit can be completely covered by a layer of 97 senzu bean containers. What is the volume of the capsule storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "485"
      ],
      [
        "485.0"
      ],
      [
        "485.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the capsule storage unit, you can multiply how many senzu bean containers are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 97 one cubic centimetre senzu bean containers in the bottom layer. Since the capsule storage unit is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "97 x 5 = 485"
      ],
      [
        "4/4",
        "485 one cubic centimetre senzu bean containers would fill the capsule storage unit. Therefore, the volume of the capsule storage unit is 485 cubic centimetres."
      ]
    ],
    "question_number": "2_29",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Link collects rupee gems. Each rupee gem has a volume of one cubic centimetre. They are kept in a treasure chest that is shaped like a rectangular prism.\n\nThe treasure chest has a height of 12 centimetres. The bottom of the treasure chest can be completely covered by a layer of 86 rupee gems. What is the volume of the treasure chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "1032"
      ],
      [
        "1032.0"
      ],
      [
        "1032.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the treasure chest, you can multiply how many rupee gems are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 86 one cubic centimetre rupee gems in the bottom layer. Since the treasure chest is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "86 x 12 = 1032"
      ],
      [
        "4/4",
        "1032 one cubic centimetre rupee gems would fill the treasure chest. Therefore, the volume of the treasure chest is 1032 cubic centimetres."
      ]
    ],
    "question_number": "2_30",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Iron Man collects arc reactor components. Each arc reactor component has a volume of one cubic centimetre. They are kept in a workshop storage unit that is shaped like a rectangular prism.\n\nThe workshop storage unit has a height of 12 centimetres. The bottom of the workshop storage unit can be completely covered by a layer of 50 arc reactor components. What is the volume of the workshop storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "600"
      ],
      [
        "600.0"
      ],
      [
        "600.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the workshop storage unit, you can multiply how many arc reactor components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 50 one cubic centimetre arc reactor components in the bottom layer. Since the workshop storage unit is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "50 x 12 = 600"
      ],
      [
        "4/4",
        "600 one cubic centimetre arc reactor components would fill the workshop storage unit. Therefore, the volume of the workshop storage unit is 600 cubic centimetres."
      ]
    ],
    "question_number": "2_31",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Hermione collects library book cubes. Each library book cube has a volume of one cubic centimetre. They are kept in a enchanted trunk that is shaped like a rectangular prism.\n\nThe enchanted trunk has a height of 4 centimetres. The bottom of the enchanted trunk can be completely covered by a layer of 72 library book cubes. What is the volume of the enchanted trunk?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "288"
      ],
      [
        "288.0"
      ],
      [
        "288.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the enchanted trunk, you can multiply how many library book cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 72 one cubic centimetre library book cubes in the bottom layer. Since the enchanted trunk is 4 centimetres tall, 4 layers would fill it."
      ],
      [
        "3/4",
        "72 x 4 = 288"
      ],
      [
        "4/4",
        "288 one cubic centimetre library book cubes would fill the enchanted trunk. Therefore, the volume of the enchanted trunk is 288 cubic centimetres."
      ]
    ],
    "question_number": "2_32",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Sonic collects chaos emerald fragments. Each chaos emerald fragment has a volume of one cubic centimetre. They are kept in a ring storage box that is shaped like a rectangular prism.\n\nThe ring storage box has a height of 7 centimetres. The bottom of the ring storage box can be completely covered by a layer of 68 chaos emerald fragments. What is the volume of the ring storage box?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "476"
      ],
      [
        "476.0"
      ],
      [
        "476.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ring storage box, you can multiply how many chaos emerald fragments are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 68 one cubic centimetre chaos emerald fragments in the bottom layer. Since the ring storage box is 7 centimetres tall, 7 layers would fill it."
      ],
      [
        "3/4",
        "68 x 7 = 476"
      ],
      [
        "4/4",
        "476 one cubic centimetre chaos emerald fragments would fill the ring storage box. Therefore, the volume of the ring storage box is 476 cubic centimetres."
      ]
    ],
    "question_number": "2_33",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Batman collects gadget components. Each gadget component has a volume of one cubic centimetre. They are kept in a Batcave storage compartment that is shaped like a rectangular prism.\n\nThe Batcave storage compartment has a height of 11 centimetres. The bottom of the Batcave storage compartment can be completely covered by a layer of 93 gadget components. What is the volume of the Batcave storage compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "1023"
      ],
      [
        "1023.0"
      ],
      [
        "1023.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the Batcave storage compartment, you can multiply how many gadget components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 93 one cubic centimetre gadget components in the bottom layer. Since the Batcave storage compartment is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "93 x 11 = 1023"
      ],
      [
        "4/4",
        "1023 one cubic centimetre gadget components would fill the Batcave storage compartment. Therefore, the volume of the Batcave storage compartment is 1023 cubic centimetres."
      ]
    ],
    "question_number": "2_34",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Luffy collects meat cubes. Each meat cube has a volume of one cubic centimetre. They are kept in a ship's food locker that is shaped like a rectangular prism.\n\nThe ship's food locker has a height of 10 centimetres. The bottom of the ship's food locker can be completely covered by a layer of 41 meat cubes. What is the volume of the ship's food locker?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "410"
      ],
      [
        "410.0"
      ],
      [
        "410.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ship's food locker, you can multiply how many meat cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 41 one cubic centimetre meat cubes in the bottom layer. Since the ship's food locker is 10 centimetres tall, 10 layers would fill it."
      ],
      [
        "3/4",
        "41 x 10 = 410"
      ],
      [
        "4/4",
        "410 one cubic centimetre meat cubes would fill the ship's food locker. Therefore, the volume of the ship's food locker is 410 cubic centimetres."
      ]
    ],
    "question_number": "2_35",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Ash Ketchum collects Pokéball components. Each Pokéball component has a volume of one cubic centimetre. They are kept in a trainer's backpack compartment that is shaped like a rectangular prism.\n\nThe trainer's backpack compartment has a height of 9 centimetres. The bottom of the trainer's backpack compartment can be completely covered by a layer of 52 Pokéball components. What is the volume of the trainer's backpack compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "468"
      ],
      [
        "468.0"
      ],
      [
        "468.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the trainer's backpack compartment, you can multiply how many Pokéball components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 52 one cubic centimetre Pokéball components in the bottom layer. Since the trainer's backpack compartment is 9 centimetres tall, 9 layers would fill it."
      ],
      [
        "3/4",
        "52 x 9 = 468"
      ],
      [
        "4/4",
        "468 one cubic centimetre Pokéball components would fill the trainer's backpack compartment. Therefore, the volume of the trainer's backpack compartment is 468 cubic centimetres."
      ]
    ],
    "question_number": "2_36",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Thor collects Asgardian power stones. Each Asgardian power stone has a volume of one cubic centimetre. They are kept in a mystical vault that is shaped like a rectangular prism.\n\nThe mystical vault has a height of 11 centimetres. The bottom of the mystical vault can be completely covered by a layer of 60 Asgardian power stones. What is the volume of the mystical vault?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "660"
      ],
      [
        "660.0"
      ],
      [
        "660.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the mystical vault, you can multiply how many Asgardian power stones are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 60 one cubic centimetre Asgardian power stones in the bottom layer. Since the mystical vault is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "60 x 11 = 660"
      ],
      [
        "4/4",
        "660 one cubic centimetre Asgardian power stones would fill the mystical vault. Therefore, the volume of the mystical vault is 660 cubic centimetres."
      ]
    ],
    "question_number": "2_37",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Deku collects hero training blocks. Each hero training block has a volume of one cubic centimetre. They are kept in a U.A. storage locker that is shaped like a rectangular prism.\n\nThe U.A. storage locker has a height of 10 centimetres. The bottom of the U.A. storage locker can be completely covered by a layer of 92 hero training blocks. What is the volume of the U.A. storage locker?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "920"
      ],
      [
        "920.0"
      ],
      [
        "920.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the U.A. storage locker, you can multiply how many hero training blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 92 one cubic centimetre hero training blocks in the bottom layer. Since the U.A. storage locker is 10 centimetres tall, 10 layers would fill it."
      ],
      [
        "3/4",
        "92 x 10 = 920"
      ],
      [
        "4/4",
        "920 one cubic centimetre hero training blocks would fill the U.A. storage locker. Therefore, the volume of the U.A. storage locker is 920 cubic centimetres."
      ]
    ],
    "question_number": "2_38",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Tanjiro collects breathing technique crystals. Each breathing technique crystal has a volume of one cubic centimetre. They are kept in a demon slayer equipment box that is shaped like a rectangular prism.\n\nThe demon slayer equipment box has a height of 12 centimetres. The bottom of the demon slayer equipment box can be completely covered by a layer of 78 breathing technique crystals. What is the volume of the demon slayer equipment box?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "936"
      ],
      [
        "936.0"
      ],
      [
        "936.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the demon slayer equipment box, you can multiply how many breathing technique crystals are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 78 one cubic centimetre breathing technique crystals in the bottom layer. Since the demon slayer equipment box is 12 centimetres tall, 12 layers would fill it."
      ],
      [
        "3/4",
        "78 x 12 = 936"
      ],
      [
        "4/4",
        "936 one cubic centimetre breathing technique crystals would fill the demon slayer equipment box. Therefore, the volume of the demon slayer equipment box is 936 cubic centimetres."
      ]
    ],
    "question_number": "2_39",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Captain America collects vibranium samples. Each vibranium sample has a volume of one cubic centimetre. They are kept in a S.H.I.E.L.D. containment unit that is shaped like a rectangular prism.\n\nThe S.H.I.E.L.D. containment unit has a height of 9 centimetres. The bottom of the S.H.I.E.L.D. containment unit can be completely covered by a layer of 31 vibranium samples. What is the volume of the S.H.I.E.L.D. containment unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "279"
      ],
      [
        "279.0"
      ],
      [
        "279.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the S.H.I.E.L.D. containment unit, you can multiply how many vibranium samples are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 31 one cubic centimetre vibranium samples in the bottom layer. Since the S.H.I.E.L.D. containment unit is 9 centimetres tall, 9 layers would fill it."
      ],
      [
        "3/4",
        "31 x 9 = 279"
      ],
      [
        "4/4",
        "279 one cubic centimetre vibranium samples would fill the S.H.I.E.L.D. containment unit. Therefore, the volume of the S.H.I.E.L.D. containment unit is 279 cubic centimetres."
      ]
    ],
    "question_number": "2_40",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Gojo collects cursed energy blocks. Each cursed energy block has a volume of one cubic centimetre. They are kept in a jujutsu technique storage that is shaped like a rectangular prism.\n\nThe jujutsu technique storage has a height of 11 centimetres. The bottom of the jujutsu technique storage can be completely covered by a layer of 61 cursed energy blocks. What is the volume of the jujutsu technique storage?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "671"
      ],
      [
        "671.0"
      ],
      [
        "671.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the jujutsu technique storage, you can multiply how many cursed energy blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 61 one cubic centimetre cursed energy blocks in the bottom layer. Since the jujutsu technique storage is 11 centimetres tall, 11 layers would fill it."
      ],
      [
        "3/4",
        "61 x 11 = 671"
      ],
      [
        "4/4",
        "671 one cubic centimetre cursed energy blocks would fill the jujutsu technique storage. Therefore, the volume of the jujutsu technique storage is 671 cubic centimetres."
      ]
    ],
    "question_number": "2_41",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Naruto collects ninja training weights. Each ninja training weight has a volume of one cubic centimetre. They are kept in a equipment chest that is shaped like a rectangular prism.\n\nThe equipment chest has a height of 6 centimetres. The bottom of the equipment chest can be completely covered by a layer of 24 ninja training weights. What is the volume of the equipment chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "144"
      ],
      [
        "144.0"
      ],
      [
        "144.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the equipment chest, you can multiply how many ninja training weights are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 24 one cubic centimetre ninja training weights in the bottom layer. Since the equipment chest is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "24 x 6 = 144"
      ],
      [
        "4/4",
        "144 one cubic centimetre ninja training weights would fill the equipment chest. Therefore, the volume of the equipment chest is 144 cubic centimetres."
      ]
    ],
    "question_number": "2_42",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Harry Potter collects spell components. Each spell component has a volume of one cubic centimetre. They are kept in a potion cabinet that is shaped like a rectangular prism.\n\nThe potion cabinet has a height of 5 centimetres. The bottom of the potion cabinet can be completely covered by a layer of 84 spell components. What is the volume of the potion cabinet?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "420"
      ],
      [
        "420.0"
      ],
      [
        "420.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the potion cabinet, you can multiply how many spell components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 84 one cubic centimetre spell components in the bottom layer. Since the potion cabinet is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "84 x 5 = 420"
      ],
      [
        "4/4",
        "420 one cubic centimetre spell components would fill the potion cabinet. Therefore, the volume of the potion cabinet is 420 cubic centimetres."
      ]
    ],
    "question_number": "2_43",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Mario collects power-up blocks. Each power-up block has a volume of one cubic centimetre. They are kept in a warp pipe storage that is shaped like a rectangular prism.\n\nThe warp pipe storage has a height of 10 centimetres. The bottom of the warp pipe storage can be completely covered by a layer of 70 power-up blocks. What is the volume of the warp pipe storage?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "700"
      ],
      [
        "700.0"
      ],
      [
        "700.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the warp pipe storage, you can multiply how many power-up blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 70 one cubic centimetre power-up blocks in the bottom layer. Since the warp pipe storage is 10 centimetres tall, 10 layers would fill it."
      ],
      [
        "3/4",
        "70 x 10 = 700"
      ],
      [
        "4/4",
        "700 one cubic centimetre power-up blocks would fill the warp pipe storage. Therefore, the volume of the warp pipe storage is 700 cubic centimetres."
      ]
    ],
    "question_number": "2_44",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Pikachu collects energy cubes. Each energy cube has a volume of one cubic centimetre. They are kept in a Pokéball storage compartment that is shaped like a rectangular prism.\n\nThe Pokéball storage compartment has a height of 5 centimetres. The bottom of the Pokéball storage compartment can be completely covered by a layer of 40 energy cubes. What is the volume of the Pokéball storage compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "200"
      ],
      [
        "200.0"
      ],
      [
        "200.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the Pokéball storage compartment, you can multiply how many energy cubes are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 40 one cubic centimetre energy cubes in the bottom layer. Since the Pokéball storage compartment is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "40 x 5 = 200"
      ],
      [
        "4/4",
        "200 one cubic centimetre energy cubes would fill the Pokéball storage compartment. Therefore, the volume of the Pokéball storage compartment is 200 cubic centimetres."
      ]
    ],
    "question_number": "2_45",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Elsa collects ice crystals. Each ice crystal has a volume of one cubic centimetre. They are kept in a ice palace vault that is shaped like a rectangular prism.\n\nThe ice palace vault has a height of 5 centimetres. The bottom of the ice palace vault can be completely covered by a layer of 24 ice crystals. What is the volume of the ice palace vault?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "120"
      ],
      [
        "120.0"
      ],
      [
        "120.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the ice palace vault, you can multiply how many ice crystals are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 24 one cubic centimetre ice crystals in the bottom layer. Since the ice palace vault is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "24 x 5 = 120"
      ],
      [
        "4/4",
        "120 one cubic centimetre ice crystals would fill the ice palace vault. Therefore, the volume of the ice palace vault is 120 cubic centimetres."
      ]
    ],
    "question_number": "2_46",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Spider-Man collects web cartridges. Each web cartridge has a volume of one cubic centimetre. They are kept in a utility belt compartment that is shaped like a rectangular prism.\n\nThe utility belt compartment has a height of 5 centimetres. The bottom of the utility belt compartment can be completely covered by a layer of 42 web cartridges. What is the volume of the utility belt compartment?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "210"
      ],
      [
        "210.0"
      ],
      [
        "210.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the utility belt compartment, you can multiply how many web cartridges are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 42 one cubic centimetre web cartridges in the bottom layer. Since the utility belt compartment is 5 centimetres tall, 5 layers would fill it."
      ],
      [
        "3/4",
        "42 x 5 = 210"
      ],
      [
        "4/4",
        "210 one cubic centimetre web cartridges would fill the utility belt compartment. Therefore, the volume of the utility belt compartment is 210 cubic centimetres."
      ]
    ],
    "question_number": "2_47",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Minecraft Steve collects resource blocks. Each resource block has a volume of one cubic centimetre. They are kept in a chest that is shaped like a rectangular prism.\n\nThe chest has a height of 6 centimetres. The bottom of the chest can be completely covered by a layer of 34 resource blocks. What is the volume of the chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "204"
      ],
      [
        "204.0"
      ],
      [
        "204.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the chest, you can multiply how many resource blocks are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 34 one cubic centimetre resource blocks in the bottom layer. Since the chest is 6 centimetres tall, 6 layers would fill it."
      ],
      [
        "3/4",
        "34 x 6 = 204"
      ],
      [
        "4/4",
        "204 one cubic centimetre resource blocks would fill the chest. Therefore, the volume of the chest is 204 cubic centimetres."
      ]
    ],
    "question_number": "2_48",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Goku collects senzu bean containers. Each senzu bean container has a volume of one cubic centimetre. They are kept in a capsule storage unit that is shaped like a rectangular prism.\n\nThe capsule storage unit has a height of 4 centimetres. The bottom of the capsule storage unit can be completely covered by a layer of 91 senzu bean containers. What is the volume of the capsule storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "364"
      ],
      [
        "364.0"
      ],
      [
        "364.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the capsule storage unit, you can multiply how many senzu bean containers are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 91 one cubic centimetre senzu bean containers in the bottom layer. Since the capsule storage unit is 4 centimetres tall, 4 layers would fill it."
      ],
      [
        "3/4",
        "91 x 4 = 364"
      ],
      [
        "4/4",
        "364 one cubic centimetre senzu bean containers would fill the capsule storage unit. Therefore, the volume of the capsule storage unit is 364 cubic centimetres."
      ]
    ],
    "question_number": "2_49",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Link collects rupee gems. Each rupee gem has a volume of one cubic centimetre. They are kept in a treasure chest that is shaped like a rectangular prism.\n\nThe treasure chest has a height of 8 centimetres. The bottom of the treasure chest can be completely covered by a layer of 62 rupee gems. What is the volume of the treasure chest?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "496"
      ],
      [
        "496.0"
      ],
      [
        "496.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the treasure chest, you can multiply how many rupee gems are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 62 one cubic centimetre rupee gems in the bottom layer. Since the treasure chest is 8 centimetres tall, 8 layers would fill it."
      ],
      [
        "3/4",
        "62 x 8 = 496"
      ],
      [
        "4/4",
        "496 one cubic centimetre rupee gems would fill the treasure chest. Therefore, the volume of the treasure chest is 496 cubic centimetres."
      ]
    ],
    "question_number": "2_50",
    "solution_image_tag": []
  },
  {
    "skills": "relationship-between-volume-and-the-area-of-the-base-word-problems",
    "question_text": "Iron Man collects arc reactor components. Each arc reactor component has a volume of one cubic centimetre. They are kept in a workshop storage unit that is shaped like a rectangular prism.\n\nThe workshop storage unit has a height of 4 centimetres. The bottom of the workshop storage unit can be completely covered by a layer of 41 arc reactor components. What is the volume of the workshop storage unit?\n_ cubic centimetres",
    "tag": "Gr7_48_E2",
    "question_type": "Fill in the blank",
    "has_alternative_answers": true,
    "correct_answers": [
      [
        "164"
      ],
      [
        "164.0"
      ],
      [
        "164.00"
      ]
    ],
    "solution": [
      [
        "1/4",
        "To find the volume of the workshop storage unit, you can multiply how many arc reactor components are in the bottom layer by how many layers would fill it."
      ],
      [
        "2/4",
        "There are 41 one cubic centimetre arc reactor components in the bottom layer. Since the workshop storage unit is 4 centimetres tall, 4 layers would fill it."
      ],
      [
        "3/4",
        "41 x 4 = 164"
      ],
      [
        "4/4",
        "164 one cubic centimetre arc reactor components would fill the workshop storage unit. Therefore, the volume of the workshop storage unit is 164 cubic centimetres."
      ]
    ],
    "question_number": "2_51",
    "solution_image_tag": []
  }
]