[
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The graph shows quadrilaterals STUV and CDEF. Is STUV similar to CDEF?",
    "image_tag": "Gr7_43_2_1",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF.",
      "No, because DE/TU is not equal to CF/SV."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_1_step_2",
        "Shows STUV dilated by scale factor 3 to create S'T'U'V' in orange dashed lines. The dilated shape S'T'U'V' perfectly coincides with CDEF, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_1_step_4",
        "Shows STUV dilated by scale factor 2 to create S'T'U'V' in orange dashed lines. The dilated shape does not coincide with CDEF, showing that scale factor 2 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that STUV and CDEF are similar:\nYes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF."
      ],
      [
        "2/5",
        "Dilate STUV by a scale factor of 3 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' coincides with CDEF."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 2 centred at the origin does not map STUV onto CDEF, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate STUV by a scale factor of 2 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' does not coincide with CDEF."
      ],
      [
        "5/5",
        "STUV and CDEF are similar, so this sentence is incorrect:\nNo, because DE/TU is not equal to CF/SV."
      ]
    ],
    "question_number": "2_1"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Minecraft map regions PQRS and WXYZ. Are they similar?",
    "image_tag": "Gr7_43_2_3",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_3_step_2",
        "Shows PQRS dilated by scale factor 4 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_3_step_4",
        "Shows PQRS dilated by scale factor 5 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 4 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 5 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_3"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The graph shows quadrilaterals PQRS and WXYZ. Is PQRS similar to WXYZ?",
    "image_tag": "Gr7_43_2_4",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 1.5 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_4_step_2",
        "Shows PQRS dilated by scale factor 1.5 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_4_step_4",
        "Shows PQRS dilated by scale factor 2.5 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 2.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 1.5 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 1.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 2.5 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 2.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_4"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Batman's signal quadrants GHIJ and KLMN. Verify similarity.",
    "image_tag": "Gr7_43_2_5",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_5_step_2",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_5_step_4",
        "Shows GHIJ dilated by scale factor 4 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 4 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 3 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 4 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 4 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_5"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Goku's training zones GHIJ and KLMN. Check for similarity.",
    "image_tag": "Gr7_43_2_6",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 0.5 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 1.5 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_6_step_2",
        "Shows GHIJ dilated by scale factor 0.5 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_6_step_4",
        "Shows GHIJ dilated by scale factor 1.5 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 1.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 0.5 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 0.5 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 1.5 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 1.5 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_6"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Determine if JKLM is similar to NOPQ and justify your answer.",
    "image_tag": "Gr7_43_2_7",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_7_step_2",
        "Shows JKLM dilated by scale factor 2 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_7_step_4",
        "Shows JKLM dilated by scale factor 3 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 2 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 3 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_7"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Determine if JKLM is similar to NOPQ and justify your answer.",
    "image_tag": "Gr7_43_2_8",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3.5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_8_step_2",
        "Shows JKLM dilated by scale factor 2.5 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_8_step_4",
        "Shows JKLM dilated by scale factor 3.5 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 3.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 2.5 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 2.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3.5 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 3.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_8"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Spider-Man's web sections STUV and CDEF. Are they similar?",
    "image_tag": "Gr7_43_2_9",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_9_step_2",
        "Shows STUV dilated by scale factor 2 to create S'T'U'V' in orange dashed lines. The dilated shape S'T'U'V' perfectly coincides with CDEF, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_9_step_4",
        "Shows STUV dilated by scale factor 3 to create S'T'U'V' in orange dashed lines. The dilated shape does not coincide with CDEF, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that STUV and CDEF are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF."
      ],
      [
        "2/5",
        "Dilate STUV by a scale factor of 2 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' coincides with CDEF."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map STUV onto CDEF, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate STUV by a scale factor of 3 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' does not coincide with CDEF."
      ],
      [
        "5/5",
        "STUV and CDEF are similar, so this sentence is incorrect:\nNo, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_9"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Minecraft map regions GHIJ and KLMN. Are they similar?",
    "image_tag": "Gr7_43_2_10",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_10_step_2",
        "Shows GHIJ dilated by scale factor 2 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_10_step_4",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 2 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 3 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_10"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The coordinate plane displays JKLM and NOPQ. Are they similar?",
    "image_tag": "Gr7_43_2_11",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_11_step_2",
        "Shows JKLM dilated by scale factor 2 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_11_step_4",
        "Shows JKLM dilated by scale factor 3 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 2 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 3 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_11"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Pokemon arena sections GHIJ and KLMN. Are they similar?",
    "image_tag": "Gr7_43_2_12",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_12_step_2",
        "Shows GHIJ dilated by scale factor 2 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_12_step_4",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 2 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 3 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_12"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Minecraft map regions ABCD and EFGH. Are they similar?",
    "image_tag": "Gr7_43_2_13",
    "backend_description": "A coordinate grid showing two quadrilaterals: ABCD (smaller, in blue) and EFGH (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps ABCD onto EFGH.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps ABCD onto EFGH.",
      "No, because FE/BA is not equal to GF/CB."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_13_step_2",
        "Shows ABCD dilated by scale factor 4 to create A'B'C'D' in orange dashed lines. The dilated shape A'B'C'D' perfectly coincides with EFGH, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_13_step_4",
        "Shows ABCD dilated by scale factor 5 to create A'B'C'D' in orange dashed lines. The dilated shape does not coincide with EFGH, showing that scale factor 5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that ABCD and EFGH are similar:\nYes, because a dilation by a scale factor of 4 centred at the origin maps ABCD onto EFGH."
      ],
      [
        "2/5",
        "Dilate ABCD by a scale factor of 4 centred at the origin to get A'B'C'D'. Notice that A'B'C'D' coincides with EFGH."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 5 centred at the origin does not map ABCD onto EFGH, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate ABCD by a scale factor of 5 centred at the origin to get A'B'C'D'. Notice that A'B'C'D' does not coincide with EFGH."
      ],
      [
        "5/5",
        "ABCD and EFGH are similar, so this sentence is incorrect:\nNo, because FE/BA is not equal to GF/CB."
      ]
    ],
    "question_number": "2_13"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Spider-Man's web sections JKLM and NOPQ. Are they similar?",
    "image_tag": "Gr7_43_2_14",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_14_step_2",
        "Shows JKLM dilated by scale factor 2 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_14_step_4",
        "Shows JKLM dilated by scale factor 3 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 2 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 3 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_14"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Zelda's dungeon rooms PQRS and WXYZ. Verify similarity.",
    "image_tag": "Gr7_43_2_15",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 3.5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_15_step_2",
        "Shows PQRS dilated by scale factor 2.5 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_15_step_4",
        "Shows PQRS dilated by scale factor 3.5 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 3.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 2.5 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 2.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3.5 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 3.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_15"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Determine if STUV is similar to CDEF and justify your answer.",
    "image_tag": "Gr7_43_2_16",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_16_step_2",
        "Shows STUV dilated by scale factor 3 to create S'T'U'V' in orange dashed lines. The dilated shape S'T'U'V' perfectly coincides with CDEF, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_16_step_4",
        "Shows STUV dilated by scale factor 4 to create S'T'U'V' in orange dashed lines. The dilated shape does not coincide with CDEF, showing that scale factor 4 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that STUV and CDEF are similar:\nYes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF."
      ],
      [
        "2/5",
        "Dilate STUV by a scale factor of 3 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' coincides with CDEF."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 4 centred at the origin does not map STUV onto CDEF, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate STUV by a scale factor of 4 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' does not coincide with CDEF."
      ],
      [
        "5/5",
        "STUV and CDEF are similar, so this sentence is incorrect:\nNo, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_16"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Batman's signal quadrants JKLM and NOPQ. Verify similarity.",
    "image_tag": "Gr7_43_2_17",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_17_step_2",
        "Shows JKLM dilated by scale factor 3 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_17_step_4",
        "Shows JKLM dilated by scale factor 4 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 4 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 3 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 4 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 4 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_17"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Naruto's jutsu zones PQRS and WXYZ. Check if similar.",
    "image_tag": "Gr7_43_2_18",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_18_step_2",
        "Shows PQRS dilated by scale factor 2 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_18_step_4",
        "Shows PQRS dilated by scale factor 3 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 2 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 3 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_18"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Batman's signal quadrants JKLM and NOPQ. Verify similarity.",
    "image_tag": "Gr7_43_2_19",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 1.5 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_19_step_2",
        "Shows JKLM dilated by scale factor 1.5 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_19_step_4",
        "Shows JKLM dilated by scale factor 2.5 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 2.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 1.5 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 1.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 2.5 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 2.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_19"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Mario's power-up regions PQRS and WXYZ. Are they similar?",
    "image_tag": "Gr7_43_2_20",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_20_step_2",
        "Shows PQRS dilated by scale factor 4 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_20_step_4",
        "Shows PQRS dilated by scale factor 5 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 4 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 5 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_20"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Naruto's jutsu zones ABCD and EFGH. Check if similar.",
    "image_tag": "Gr7_43_2_21",
    "backend_description": "A coordinate grid showing two quadrilaterals: ABCD (smaller, in blue) and EFGH (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps ABCD onto EFGH.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps ABCD onto EFGH.",
      "No, because FE/BA is not equal to GF/CB."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_21_step_2",
        "Shows ABCD dilated by scale factor 4 to create A'B'C'D' in orange dashed lines. The dilated shape A'B'C'D' perfectly coincides with EFGH, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_21_step_4",
        "Shows ABCD dilated by scale factor 5 to create A'B'C'D' in orange dashed lines. The dilated shape does not coincide with EFGH, showing that scale factor 5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that ABCD and EFGH are similar:\nYes, because a dilation by a scale factor of 4 centred at the origin maps ABCD onto EFGH."
      ],
      [
        "2/5",
        "Dilate ABCD by a scale factor of 4 centred at the origin to get A'B'C'D'. Notice that A'B'C'D' coincides with EFGH."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 5 centred at the origin does not map ABCD onto EFGH, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate ABCD by a scale factor of 5 centred at the origin to get A'B'C'D'. Notice that A'B'C'D' does not coincide with EFGH."
      ],
      [
        "5/5",
        "ABCD and EFGH are similar, so this sentence is incorrect:\nNo, because FE/BA is not equal to GF/CB."
      ]
    ],
    "question_number": "2_21"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Check whether JKLM and NOPQ are similar quadrilaterals.",
    "image_tag": "Gr7_43_2_22",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 0.5 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 1.5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_22_step_2",
        "Shows JKLM dilated by scale factor 0.5 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_22_step_4",
        "Shows JKLM dilated by scale factor 1.5 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 1.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 0.5 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 0.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 1.5 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 1.5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_22"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Avengers' defense zones JKLM and NOPQ. Check similarity.",
    "image_tag": "Gr7_43_2_23",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_23_step_2",
        "Shows JKLM dilated by scale factor 4 to create J'K'L'M' in orange dashed lines. The dilated shape J'K'L'M' perfectly coincides with NOPQ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_23_step_4",
        "Shows JKLM dilated by scale factor 5 to create J'K'L'M' in orange dashed lines. The dilated shape does not coincide with NOPQ, showing that scale factor 5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that JKLM and NOPQ are similar:\nYes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ."
      ],
      [
        "2/5",
        "Dilate JKLM by a scale factor of 4 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' coincides with NOPQ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 5 centred at the origin does not map JKLM onto NOPQ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate JKLM by a scale factor of 5 centred at the origin to get J'K'L'M'. Notice that J'K'L'M' does not coincide with NOPQ."
      ],
      [
        "5/5",
        "JKLM and NOPQ are similar, so this sentence is incorrect:\nNo, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_23"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Avengers' defense zones GHIJ and KLMN. Check similarity.",
    "image_tag": "Gr7_43_2_24",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_24_step_2",
        "Shows GHIJ dilated by scale factor 2 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_24_step_4",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 3 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 2 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 3 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_24"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Zelda's dungeon rooms GHIJ and KLMN. Verify similarity.",
    "image_tag": "Gr7_43_2_25",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_25_step_2",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape G'H'I'J' perfectly coincides with KLMN, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_25_step_4",
        "Shows GHIJ dilated by scale factor 4 to create G'H'I'J' in orange dashed lines. The dilated shape does not coincide with KLMN, showing that scale factor 4 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that GHIJ and KLMN are similar:\nYes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN."
      ],
      [
        "2/5",
        "Dilate GHIJ by a scale factor of 3 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' coincides with KLMN."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 4 centred at the origin does not map GHIJ onto KLMN, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate GHIJ by a scale factor of 4 centred at the origin to get G'H'I'J'. Notice that G'H'I'J' does not coincide with KLMN."
      ],
      [
        "5/5",
        "GHIJ and KLMN are similar, so this sentence is incorrect:\nNo, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_25"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Goku's training zones PQRS and WXYZ. Check for similarity.",
    "image_tag": "Gr7_43_2_26",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 1.5 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_26_step_2",
        "Shows PQRS dilated by scale factor 1.5 to create P'Q'R'S' in orange dashed lines. The dilated shape P'Q'R'S' perfectly coincides with WXYZ, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_26_step_4",
        "Shows PQRS dilated by scale factor 2.5 to create P'Q'R'S' in orange dashed lines. The dilated shape does not coincide with WXYZ, showing that scale factor 2.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that PQRS and WXYZ are similar:\nYes, because a dilation by a scale factor of 1.5 centred at the origin maps PQRS onto WXYZ."
      ],
      [
        "2/5",
        "Dilate PQRS by a scale factor of 1.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' coincides with WXYZ."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 2.5 centred at the origin does not map PQRS onto WXYZ, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate PQRS by a scale factor of 2.5 centred at the origin to get P'Q'R'S'. Notice that P'Q'R'S' does not coincide with WXYZ."
      ],
      [
        "5/5",
        "PQRS and WXYZ are similar, so this sentence is incorrect:\nNo, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_26"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Naruto's jutsu zones STUV and CDEF. Check if similar.",
    "image_tag": "Gr7_43_2_27",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2.5 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 3.5 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "A"
    ],
    "solution_image_tag": [
      [
        "2/5",
        "Gr7_43_2_27_step_2",
        "Shows STUV dilated by scale factor 2.5 to create S'T'U'V' in orange dashed lines. The dilated shape S'T'U'V' perfectly coincides with CDEF, proving they are similar."
      ],
      [
        "4/5",
        "Gr7_43_2_27_step_4",
        "Shows STUV dilated by scale factor 3.5 to create S'T'U'V' in orange dashed lines. The dilated shape does not coincide with CDEF, showing that scale factor 3.5 is incorrect."
      ]
    ],
    "solution": [
      [
        "1/5",
        "The following sentence correctly states and justifies that STUV and CDEF are similar:\nYes, because a dilation by a scale factor of 2.5 centred at the origin maps STUV onto CDEF."
      ],
      [
        "2/5",
        "Dilate STUV by a scale factor of 2.5 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' coincides with CDEF."
      ],
      [
        "3/5",
        "A dilation by a scale factor of 3.5 centred at the origin does not map STUV onto CDEF, so option B is incorrect."
      ],
      [
        "4/5",
        "Dilate STUV by a scale factor of 3.5 centred at the origin to get S'T'U'V'. Notice that S'T'U'V' does not coincide with CDEF."
      ],
      [
        "5/5",
        "STUV and CDEF are similar, so this sentence is incorrect:\nNo, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_27"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Check whether GHIJ and KLMN are similar quadrilaterals.",
    "image_tag": "Gr7_43_2_28",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_28_step_2",
        "Shows GHIJ dilated by scale factor 2 to create G'H'I'J' in orange dashed lines. The dilated shape does NOT coincide with KLMN, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if GHIJ and KLMN are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate GHIJ by various scale factors. None will map it exactly onto KLMN."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_28"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Check whether PQRS and WXYZ are similar quadrilaterals.",
    "image_tag": "Gr7_43_2_29",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_29_step_2",
        "Shows PQRS dilated by scale factor 4 to create P'Q'R'S' in orange dashed lines. The dilated shape does NOT coincide with WXYZ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if PQRS and WXYZ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate PQRS by various scale factors. None will map it exactly onto WXYZ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_29"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Mario's power-up regions ABCD and EFGH. Are they similar?",
    "image_tag": "Gr7_43_2_30",
    "backend_description": "A coordinate grid showing two quadrilaterals: ABCD (smaller, in blue) and EFGH (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps ABCD onto EFGH.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps ABCD onto EFGH.",
      "No, because FE/BA is not equal to GF/CB."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_30_step_2",
        "Shows ABCD dilated by scale factor 2 to create A'B'C'D' in orange dashed lines. The dilated shape does NOT coincide with EFGH, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if ABCD and EFGH are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate ABCD by various scale factors. None will map it exactly onto EFGH."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because FE/BA is not equal to GF/CB."
      ]
    ],
    "question_number": "2_30"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Spider-Man's web sections GHIJ and KLMN. Are they similar?",
    "image_tag": "Gr7_43_2_31",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_31_step_2",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape does NOT coincide with KLMN, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if GHIJ and KLMN are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate GHIJ by various scale factors. None will map it exactly onto KLMN."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_31"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Zelda's dungeon rooms STUV and CDEF. Verify similarity.",
    "image_tag": "Gr7_43_2_32",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_32_step_2",
        "Shows STUV dilated by scale factor 2 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_32"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Avengers' defense zones STUV and CDEF. Check similarity.",
    "image_tag": "Gr7_43_2_33",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_33_step_2",
        "Shows STUV dilated by scale factor 4 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_33"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Are quadrilaterals GHIJ and KLMN similar figures?",
    "image_tag": "Gr7_43_2_34",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_34_step_2",
        "Shows GHIJ dilated by scale factor 4 to create G'H'I'J' in orange dashed lines. The dilated shape does NOT coincide with KLMN, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if GHIJ and KLMN are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate GHIJ by various scale factors. None will map it exactly onto KLMN."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_34"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The graph shows quadrilaterals JKLM and NOPQ. Is JKLM similar to NOPQ?",
    "image_tag": "Gr7_43_2_35",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_35_step_2",
        "Shows JKLM dilated by scale factor 4 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_35"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Mario's power-up regions STUV and CDEF. Are they similar?",
    "image_tag": "Gr7_43_2_36",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_36_step_2",
        "Shows STUV dilated by scale factor 2 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_36"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Check whether PQRS and WXYZ are similar quadrilaterals.",
    "image_tag": "Gr7_43_2_37",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_37_step_2",
        "Shows PQRS dilated by scale factor 4 to create P'Q'R'S' in orange dashed lines. The dilated shape does NOT coincide with WXYZ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if PQRS and WXYZ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate PQRS by various scale factors. None will map it exactly onto WXYZ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_37"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Spider-Man's web sections JKLM and NOPQ. Are they similar?",
    "image_tag": "Gr7_43_2_38",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_38_step_2",
        "Shows JKLM dilated by scale factor 2 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_38"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Zelda's dungeon rooms STUV and CDEF. Verify similarity.",
    "image_tag": "Gr7_43_2_39",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_39_step_2",
        "Shows STUV dilated by scale factor 3 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_39"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Among Us task areas JKLM and NOPQ. Are they similar?",
    "image_tag": "Gr7_43_2_40",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_40_step_2",
        "Shows JKLM dilated by scale factor 4 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_40"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Among Us task areas ABCD and EFGH. Are they similar?",
    "image_tag": "Gr7_43_2_41",
    "backend_description": "A coordinate grid showing two quadrilaterals: ABCD (smaller, in blue) and EFGH (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps ABCD onto EFGH.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps ABCD onto EFGH.",
      "No, because FE/BA is not equal to GF/CB."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_41_step_2",
        "Shows ABCD dilated by scale factor 4 to create A'B'C'D' in orange dashed lines. The dilated shape does NOT coincide with EFGH, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if ABCD and EFGH are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate ABCD by various scale factors. None will map it exactly onto EFGH."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because FE/BA is not equal to GF/CB."
      ]
    ],
    "question_number": "2_41"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Avengers' defense zones PQRS and WXYZ. Check similarity.",
    "image_tag": "Gr7_43_2_42",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_42_step_2",
        "Shows PQRS dilated by scale factor 4 to create P'Q'R'S' in orange dashed lines. The dilated shape does NOT coincide with WXYZ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if PQRS and WXYZ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate PQRS by various scale factors. None will map it exactly onto WXYZ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_42"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Determine if STUV is similar to CDEF and justify your answer.",
    "image_tag": "Gr7_43_2_43",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_43_step_2",
        "Shows STUV dilated by scale factor 3 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_43"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Determine if GHIJ is similar to KLMN and justify your answer.",
    "image_tag": "Gr7_43_2_44",
    "backend_description": "A coordinate grid showing two quadrilaterals: GHIJ (smaller, in blue) and KLMN (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps GHIJ onto KLMN.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps GHIJ onto KLMN.",
      "No, because LK/HG is not equal to ML/IH."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_44_step_2",
        "Shows GHIJ dilated by scale factor 3 to create G'H'I'J' in orange dashed lines. The dilated shape does NOT coincide with KLMN, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if GHIJ and KLMN are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate GHIJ by various scale factors. None will map it exactly onto KLMN."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because LK/HG is not equal to ML/IH."
      ]
    ],
    "question_number": "2_44"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Are quadrilaterals JKLM and NOPQ similar figures?",
    "image_tag": "Gr7_43_2_45",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_45_step_2",
        "Shows JKLM dilated by scale factor 3 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_45"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The coordinate plane displays PQRS and WXYZ. Are they similar?",
    "image_tag": "Gr7_43_2_46",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_46_step_2",
        "Shows PQRS dilated by scale factor 2 to create P'Q'R'S' in orange dashed lines. The dilated shape does NOT coincide with WXYZ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if PQRS and WXYZ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate PQRS by various scale factors. None will map it exactly onto WXYZ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_46"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Batman's signal quadrants ABCD and EFGH. Verify similarity.",
    "image_tag": "Gr7_43_2_47",
    "backend_description": "A coordinate grid showing two quadrilaterals: ABCD (smaller, in blue) and EFGH (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps ABCD onto EFGH.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps ABCD onto EFGH.",
      "No, because FE/BA is not equal to GF/CB."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_47_step_2",
        "Shows ABCD dilated by scale factor 2 to create A'B'C'D' in orange dashed lines. The dilated shape does NOT coincide with EFGH, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if ABCD and EFGH are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate ABCD by various scale factors. None will map it exactly onto EFGH."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because FE/BA is not equal to GF/CB."
      ]
    ],
    "question_number": "2_47"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "The coordinate plane displays JKLM and NOPQ. Are they similar?",
    "image_tag": "Gr7_43_2_48",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 4 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 5 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_48_step_2",
        "Shows JKLM dilated by scale factor 4 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_48"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Goku's training zones STUV and CDEF. Check for similarity.",
    "image_tag": "Gr7_43_2_49",
    "backend_description": "A coordinate grid showing two quadrilaterals: STUV (smaller, in blue) and CDEF (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps STUV onto CDEF.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps STUV onto CDEF.",
      "No, because DC/TS is not equal to ED/UT."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_49_step_2",
        "Shows STUV dilated by scale factor 2 to create S'T'U'V' in orange dashed lines. The dilated shape does NOT coincide with CDEF, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if STUV and CDEF are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate STUV by various scale factors. None will map it exactly onto CDEF."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because DC/TS is not equal to ED/UT."
      ]
    ],
    "question_number": "2_49"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Spider-Man's web sections PQRS and WXYZ. Are they similar?",
    "image_tag": "Gr7_43_2_50",
    "backend_description": "A coordinate grid showing two quadrilaterals: PQRS (smaller, in blue) and WXYZ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps PQRS onto WXYZ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps PQRS onto WXYZ.",
      "No, because XW/QP is not equal to YX/RQ."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_50_step_2",
        "Shows PQRS dilated by scale factor 2 to create P'Q'R'S' in orange dashed lines. The dilated shape does NOT coincide with WXYZ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if PQRS and WXYZ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate PQRS by various scale factors. None will map it exactly onto WXYZ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because XW/QP is not equal to YX/RQ."
      ]
    ],
    "question_number": "2_50"
  },
  {
    "skills": "determine-if-two-figures-are-similar-justify-your-answer",
    "question_text": "Batman's signal quadrants JKLM and NOPQ. Verify similarity.",
    "image_tag": "Gr7_43_2_51",
    "backend_description": "A coordinate grid showing two quadrilaterals: JKLM (smaller, in blue) and NOPQ (larger, in green). Both shapes are positioned on the grid to help students determine if they are similar by checking if one is a dilation of the other.",
    "tag": "Gr7_43_E2",
    "question_type": "Multiple Choice Question with Single Answer",
    "choices": [
      "Yes, because a dilation by a scale factor of 2 centred at the origin maps JKLM onto NOPQ.",
      "Yes, because a dilation by a scale factor of 3 centred at the origin maps JKLM onto NOPQ.",
      "No, because ON/KJ is not equal to PO/LK."
    ],
    "correct_answers": [
      "C"
    ],
    "solution_image_tag": [
      [
        "2/4",
        "Gr7_43_2_51_step_2",
        "Shows JKLM dilated by scale factor 2 to create J'K'L'M' in orange dashed lines. The dilated shape does NOT coincide with NOPQ, proving they are not similar."
      ]
    ],
    "solution": [
      [
        "1/4",
        "To check if JKLM and NOPQ are similar, we need to see if a dilation maps one onto the other."
      ],
      [
        "2/4",
        "Dilate JKLM by various scale factors. None will map it exactly onto NOPQ."
      ],
      [
        "3/4",
        "The ratios of corresponding sides are not equal, confirming the shapes are not similar."
      ],
      [
        "4/4",
        "The correct answer is: No, because ON/KJ is not equal to PO/LK."
      ]
    ],
    "question_number": "2_51"
  }
]