[
  {
    "question_text": "This graph shows how Mike's bank account balance is related to the number of admission tickets he purchases.\n\nHow many admission tickets does Mike need to buy to get the account balance down to $10?\n\n_ admission tickets",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_1",
    "backend_description": "The image shows a line graph titled 'Bank account balance' with 'Number of admission tickets' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $40 on the y-axis and decreasing to $0 as the number of admission tickets increases to over 60. The line passes through the point (50,10).",
    "question_type": "Fill in the blank",
    "question_number": "4_1",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "50"
    ],
    "solution": [
      [
        "1/3",
        "Find $10 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 50 admission tickets. To get the account balance down to $10, Mike needs to buy 50 admission tickets."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_1_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $10 mark, extending rightward until it intersects the black line that represents Mike’s bank balance. The red line helps identify where the account balance reaches $10. "
      ],
      [
        "2/3",
        "Gr8_24_4_1_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of tickets reaches 50. These steps illustrate how to use the graph to determine that Mike needs to buy 50 tickets for the balance to reach $10."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of tulips Maura, a florist, has left is related to the number of arrangements she puts together.\n\nIf Maura puts together 5 arrangements, how many tulips will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_2",
    "backend_description": "The image shows a line graph titled 'Tulips remaining' with 'Number of arrangements' on the x-axis and 'Tulips remaining' on the y-axis. A black line starts at 100 tulips and decreases to about 20 tulips as the number of arrangements increases from 0 to 10. The line passes through the point (5,60).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_2",
    "tag": "Gr8_24_E4",
    "choices": [
      "40 tulips",
      "50 tulips",
      "60 tulips",
      "80 tulips"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 5 arrangements on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 60 tulips. If Maura puts together  arrangements, she will have 60 tulips left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_2_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 5 arrangements, extending upward until it intersects the black line that represents the number of tulips remaining. The red line helps identify where the number of tulips is 60 when Maura puts together 5 arrangements."
      ],
      [
        "2/3",
        "Gr8_24_4_2_step_2",
        "This image adds a horizontal red line from the y-axis at 60 tulips, extending leftward until it intersects the black line that represents the number of tulips remaining. The red line helps identify where the number of tulips is 60 when Maura puts together 5 arrangements."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of beads Lucas, a jeweler, has left is related to the number of bracelets she makes.\n\nIf Lucas makes 8 bracelets, how many beads will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_3",
    "backend_description": "The image shows a line graph titled 'Beads left' with 'Number of bracelets' on the x-axis and 'Beads left' on the y-axis. A black line starts at 114 beads and decreases to about 6 beads as the number of bracelets increases from 0 to 9. The line passes through the point (8,18).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_3",
    "tag": "Gr8_24_E4",
    "choices": [
      "29 beads",
      "34 beads",
      "38 beads",
      "18 beads"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 8 bracelets on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 18 beads. If Lucas makes 8 bracelets, she will have 18 beads left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_3_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 8 bracelets, extending upward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 18 when Lucas makes 8 bracelets."
      ],
      [
        "2/3",
        "Gr8_24_4_3_step_2",
        "This image adds a horizontal red line from the y-axis at 18 beads, extending leftward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 18 when Lucas makes 8 bracelets."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of tiles Evelyn, a artist, has left is related to the number of mosaics she creates.\n\nIf Evelyn creates 4 mosaics, how many tiles will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_4",
    "backend_description": "The image shows a line graph titled 'Tiles left' with 'Number of mosaics' on the x-axis and 'Tiles left' on the y-axis. A black line starts at 118 tiles and decreases to about 8 tiles as the number of mosaics increases from 0 to 11. The line passes through the point (4,78).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_4",
    "tag": "Gr8_24_E4",
    "choices": [
      "78 tiles",
      "88 tiles",
      "104 tiles",
      "81 tiles"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Find 4 mosaics on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 78 tiles. If Evelyn creates 4 mosaics, she will have 78 tiles left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_4_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 4 mosaics, extending upward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is 78 when Evelyn creates 4 mosaics."
      ],
      [
        "2/3",
        "Gr8_24_4_4_step_2",
        "This image adds a horizontal red line from the y-axis at 78 tiles, extending leftward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is 78 when Evelyn creates 4 mosaics."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of beads Lucas, a jeweler, has left is related to the number of bracelets he makes.\n\nIf Lucas makes 8 bracelets, how many beads will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_5",
    "backend_description": "The image shows a line graph titled 'Beads left' with 'Number of bracelets' on the x-axis and 'Beads left' on the y-axis. A black line starts at 104 beads and decreases to about 5 beads as the number of bracelets increases from 0 to 9. The line passes through the point (8,16).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_5",
    "tag": "Gr8_24_E4",
    "choices": [
      "16 beads",
      "5 beads",
      "18 beads",
      "27 beads"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Find 8 bracelets on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 16 beads. If Lucas makes 8 bracelets, he will have 16 beads left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_5_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 8 bracelets, extending upward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 16 when Lucas makes 8 bracelets."
      ],
      [
        "2/3",
        "Gr8_24_4_5_step_2",
        "This image adds a horizontal red line from the y-axis at 16 beads, extending leftward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 16 when Lucas makes 8 bracelets."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Charlotte's time remaining is related to the number of problems he solves.\n\nHow many problems does Charlotte need to buy to get the time remaining down to 9 minutes?\n\n_ problems",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_6",
    "backend_description": "The image shows a line graph titled 'Minutes left' with 'Problems solved' on the x-axis and 'Minutes left' on the y-axis. The graph contains a black line starting at 39 minutes on the y-axis and decreasing to 0 minutes as the number of problems increases to over 41. The line passes through the point (31,9).",
    "question_type": "Fill in the blank",
    "question_number": "4_6",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "31"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 minutes on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 31 problems. To get the time remaining down to 9 minutes, Charlotte needs to buy 31 problems."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_6_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 9 minutes mark, extending rightward until it intersects the black line that represents Charlotte's time remaining. The red line helps identify where the time remaining reaches 9 minutes."
      ],
      [
        "2/3",
        "Gr8_24_4_6_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of problems reaches 31. These steps illustrate how to use the graph to determine that Charlotte needs to buy 31 problems for the time remaining to reach 9 minutes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Mason's cookie jar is related to the number of days he pass.\n\nHow many days does Mason need to buy to get the cookie jar down to 54?\n\n_ days",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_7",
    "backend_description": "The image shows a line graph titled 'Cookies left' with 'Days passed' on the x-axis and 'Cookies left' on the y-axis. The graph contains a black line starting at 76 on the y-axis and decreasing to 0 as the number of days increases to over 93. The line passes through the point (27,54).",
    "question_type": "Fill in the blank",
    "question_number": "4_7",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "27"
    ],
    "solution": [
      [
        "1/3",
        "Find 54 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 27 days. To get the cookie jar down to 54, Mason needs to buy 27 days."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_7_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 54 mark, extending rightward until it intersects the black line that represents Mason's cookie jar. The red line helps identify where the cookie jar reaches 54."
      ],
      [
        "2/3",
        "Gr8_24_4_7_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of days reaches 27. These steps illustrate how to use the graph to determine that Mason needs to buy 27 days for the cookie jar to reach 54."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of books Emily, a librarian, has left is related to the number of boxes he packs.\n\nIf Emily packs 3 boxes, how many books will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_8",
    "backend_description": "The image shows a line graph titled 'Books remaining' with 'Number of boxes' on the x-axis and 'Books remaining' on the y-axis. A black line starts at 115 books and decreases to about 1 books as the number of boxes increases from 0 to 19. The line passes through the point (3,97).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_8",
    "tag": "Gr8_24_E4",
    "choices": [
      "115 books",
      "97 books",
      "85 books",
      "91 books"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Find 3 boxes on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 97 books. If Emily packs 3 boxes, she will have 97 books left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_8_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 3 boxes, extending upward until it intersects the black line that represents the number of books remaining. The red line helps identify where the number of books is 97 when Emily packs 3 boxes."
      ],
      [
        "2/3",
        "Gr8_24_4_8_step_2",
        "This image adds a horizontal red line from the y-axis at 97 books, extending leftward until it intersects the black line that represents the number of books remaining. The red line helps identify where the number of books is 97 when Emily packs 3 boxes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Mason's cookie jar is related to the number of days she pass.\n\nHow many days does Mason need to buy to get the cookie jar down to 15?\n\n_ days",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_9",
    "backend_description": "The image shows a line graph titled 'Cookies left' with 'Days passed' on the x-axis and 'Cookies left' on the y-axis. The graph contains a black line starting at 40 on the y-axis and decreasing to 0 as the number of days increases to over 44. The line passes through the point (27,15).",
    "question_type": "Fill in the blank",
    "question_number": "4_9",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "27"
    ],
    "solution": [
      [
        "1/3",
        "Find 15 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 27 days. To get the cookie jar down to 15, Mason needs to buy 27 days."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_9_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 15 mark, extending rightward until it intersects the black line that represents Mason's cookie jar. The red line helps identify where the cookie jar reaches 15."
      ],
      [
        "2/3",
        "Gr8_24_4_9_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of days reaches 27. These steps illustrate how to use the graph to determine that Mason needs to buy 27 days for the cookie jar to reach 15."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of buttons Harper, a tailor, has left is related to the number of shirts she sews.\n\nIf Harper sews 3 shirts, how many buttons will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_10",
    "backend_description": "The image shows a line graph titled 'Buttons remaining' with 'Number of shirts' on the x-axis and 'Buttons remaining' on the y-axis. A black line starts at 127 buttons and decreases to about 1 buttons as the number of shirts increases from 0 to 18. The line passes through the point (3,106).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_10",
    "tag": "Gr8_24_E4",
    "choices": [
      "93 buttons",
      "130 buttons",
      "106 buttons",
      "119 buttons"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 3 shirts on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 106 buttons. If Harper sews 3 shirts, she will have 106 buttons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_10_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 3 shirts, extending upward until it intersects the black line that represents the number of buttons remaining. The red line helps identify where the number of buttons is 106 when Harper sews 3 shirts."
      ],
      [
        "2/3",
        "Gr8_24_4_10_step_2",
        "This image adds a horizontal red line from the y-axis at 106 buttons, extending leftward until it intersects the black line that represents the number of buttons remaining. The red line helps identify where the number of buttons is 106 when Harper sews 3 shirts."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Ethan's candy supply is related to the number of children she gives candy to.\n\nHow many children does Ethan need to buy to get the candy supply down to 30?\n\n_ children",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_11",
    "backend_description": "The image shows a line graph titled 'Candies left' with 'Number of children' on the x-axis and 'Candies left' on the y-axis. The graph contains a black line starting at 41 on the y-axis and decreasing to 0 as the number of children increases to over 18. The line passes through the point (4,30).",
    "question_type": "Fill in the blank",
    "question_number": "4_11",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "4"
    ],
    "solution": [
      [
        "1/3",
        "Find 30 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 4 children. To get the candy supply down to 30, Ethan needs to buy 4 children."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_11_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 30 mark, extending rightward until it intersects the black line that represents Ethan's candy supply. The red line helps identify where the candy supply reaches 30."
      ],
      [
        "2/3",
        "Gr8_24_4_11_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of children reaches 4. These steps illustrate how to use the graph to determine that Ethan needs to buy 4 children for the candy supply to reach 30."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of batteries Elizabeth, a technician, has left is related to the number of devices he installs.\n\nIf Elizabeth installs 9 devices, how many batteries will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_12",
    "backend_description": "The image shows a line graph titled 'Batteries remaining' with 'Number of devices' on the x-axis and 'Batteries remaining' on the y-axis. A black line starts at 134 batteries and decreases to about 2 batteries as the number of devices increases from 0 to 33. The line passes through the point (9,98).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_12",
    "tag": "Gr8_24_E4",
    "choices": [
      "91 batteries",
      "94 batteries",
      "124 batteries",
      "98 batteries"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 devices on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 98 batteries. If Elizabeth installs 9 devices, she will have 98 batteries left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_12_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 9 devices, extending upward until it intersects the black line that represents the number of batteries remaining. The red line helps identify where the number of batteries is 98 when Elizabeth installs 9 devices."
      ],
      [
        "2/3",
        "Gr8_24_4_12_step_2",
        "This image adds a horizontal red line from the y-axis at 98 batteries, extending leftward until it intersects the black line that represents the number of batteries remaining. The red line helps identify where the number of batteries is 98 when Elizabeth installs 9 devices."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Ava's ink level is related to the number of pages she prints.\n\nHow many pages does Ava need to buy to get the ink level down to 51%?\n\n_ pages",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_13",
    "backend_description": "The image shows a line graph titled 'Ink %' with 'Pages printed' on the x-axis and 'Ink %' on the y-axis. The graph contains a black line starting at 69% on the y-axis and decreasing to 0% as the number of pages increases to over 89. The line passes through the point (23,51).",
    "question_type": "Fill in the blank",
    "question_number": "4_13",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "23"
    ],
    "solution": [
      [
        "1/3",
        "Find 51% on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 23 pages. To get the ink level down to 51%, Ava needs to buy 23 pages."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_13_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 51% mark, extending rightward until it intersects the black line that represents Ava's ink level. The red line helps identify where the ink level reaches 51%."
      ],
      [
        "2/3",
        "Gr8_24_4_13_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of pages reaches 23. These steps illustrate how to use the graph to determine that Ava needs to buy 23 pages for the ink level to reach 51%."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of ribbons Ryan, a wrapper, has left is related to the number of gifts she wraps.\n\nIf Ryan wraps 9 gifts, how many ribbons will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_14",
    "backend_description": "The image shows a line graph titled 'Ribbons left' with 'Number of gifts' on the x-axis and 'Ribbons left' on the y-axis. A black line starts at 127 ribbons and decreases to about 7 ribbons as the number of gifts increases from 0 to 10. The line passes through the point (9,19).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_14",
    "tag": "Gr8_24_E4",
    "choices": [
      "14 ribbons",
      "19 ribbons",
      "4 ribbons",
      "29 ribbons"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 gifts on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 19 ribbons. If Ryan wraps 9 gifts, she will have 19 ribbons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_14_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 9 gifts, extending upward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 19 when Ryan wraps 9 gifts."
      ],
      [
        "2/3",
        "Gr8_24_4_14_step_2",
        "This image adds a horizontal red line from the y-axis at 19 ribbons, extending leftward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 19 when Ryan wraps 9 gifts."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of beads Lucas, a jeweler, has left is related to the number of bracelets he makes.\n\nIf Lucas makes 3 bracelets, how many beads will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_15",
    "backend_description": "The image shows a line graph titled 'Beads left' with 'Number of bracelets' on the x-axis and 'Beads left' on the y-axis. A black line starts at 148 beads and decreases to about 8 beads as the number of bracelets increases from 0 to 14. The line passes through the point (3,118).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_15",
    "tag": "Gr8_24_E4",
    "choices": [
      "146 beads",
      "109 beads",
      "118 beads",
      "121 beads"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 3 bracelets on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 118 beads. If Lucas makes 3 bracelets, she will have 118 beads left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_15_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 3 bracelets, extending upward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 118 when Lucas makes 3 bracelets."
      ],
      [
        "2/3",
        "Gr8_24_4_15_step_2",
        "This image adds a horizontal red line from the y-axis at 118 beads, extending leftward until it intersects the black line that represents the number of beads remaining. The red line helps identify where the number of beads is 118 when Lucas makes 3 bracelets."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Charlotte's time remaining is related to the number of problems he solves.\n\nHow many problems does Charlotte need to buy to get the time remaining down to 20 minutes?\n\n_ problems",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_16",
    "backend_description": "The image shows a line graph titled 'Minutes left' with 'Problems solved' on the x-axis and 'Minutes left' on the y-axis. The graph contains a black line starting at 44 minutes on the y-axis and decreasing to 0 minutes as the number of problems increases to over 38. The line passes through the point (21,20).",
    "question_type": "Fill in the blank",
    "question_number": "4_16",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "21"
    ],
    "solution": [
      [
        "1/3",
        "Find 20 minutes on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 21 problems. To get the time remaining down to 20 minutes, Charlotte needs to buy 21 problems."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_16_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 20 minutes mark, extending rightward until it intersects the black line that represents Charlotte's time remaining. The red line helps identify where the time remaining reaches 20 minutes."
      ],
      [
        "2/3",
        "Gr8_24_4_16_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of problems reaches 21. These steps illustrate how to use the graph to determine that Charlotte needs to buy 21 problems for the time remaining to reach 20 minutes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Ava's ink level is related to the number of pages she prints.\n\nHow many pages does Ava need to buy to get the ink level down to 39%?\n\n_ pages",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_17",
    "backend_description": "The image shows a line graph titled 'Ink %' with 'Pages printed' on the x-axis and 'Ink %' on the y-axis. The graph contains a black line starting at 81% on the y-axis and decreasing to 0% as the number of pages increases to over 127. The line passes through the point (66,39).",
    "question_type": "Fill in the blank",
    "question_number": "4_17",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "66"
    ],
    "solution": [
      [
        "1/3",
        "Find 39% on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 66 pages. To get the ink level down to 39%, Ava needs to buy 66 pages."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_17_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 39% mark, extending rightward until it intersects the black line that represents Ava's ink level. The red line helps identify where the ink level reaches 39%."
      ],
      [
        "2/3",
        "Gr8_24_4_17_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of pages reaches 66. These steps illustrate how to use the graph to determine that Ava needs to buy 66 pages for the ink level to reach 39%."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of nails Madison, a carpenter, has left is related to the number of boards she uses.\n\nIf Madison uses 9 boards, how many nails will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_18",
    "backend_description": "The image shows a line graph titled 'Nails remaining' with 'Number of boards' on the x-axis and 'Nails remaining' on the y-axis. A black line starts at 104 nails and decreases to about 0 nails as the number of boards increases from 0 to 13. The line passes through the point (9,32).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_18",
    "tag": "Gr8_24_E4",
    "choices": [
      "53 nails",
      "50 nails",
      "16 nails",
      "32 nails"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 boards on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 32 nails. If Madison uses 9 boards, she will have 32 nails left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_18_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 9 boards, extending upward until it intersects the black line that represents the number of nails remaining. The red line helps identify where the number of nails is 32 when Madison uses 9 boards."
      ],
      [
        "2/3",
        "Gr8_24_4_18_step_2",
        "This image adds a horizontal red line from the y-axis at 32 nails, extending leftward until it intersects the black line that represents the number of nails remaining. The red line helps identify where the number of nails is 32 when Madison uses 9 boards."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Mike's bank account balance is related to the number of admission tickets she purchases.\n\nHow many admission tickets does Mike need to buy to get the bank account balance down to $32?\n\n_ admission tickets",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_19",
    "backend_description": "The image shows a line graph titled 'Balance' with 'Number of admission tickets' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $93 on the y-axis and decreasing to $0 as the number of admission tickets increases to over 133. The line passes through the point (87,32).",
    "question_type": "Fill in the blank",
    "question_number": "4_19",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "87"
    ],
    "solution": [
      [
        "1/3",
        "Find $32 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 87 admission tickets. To get the bank account balance down to $32, Mike needs to buy 87 admission tickets."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_19_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $32 mark, extending rightward until it intersects the black line that represents Mike's bank account balance. The red line helps identify where the bank account balance reaches $32."
      ],
      [
        "2/3",
        "Gr8_24_4_19_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of admission tickets reaches 87. These steps illustrate how to use the graph to determine that Mike needs to buy 87 admission tickets for the bank account balance to reach $32."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of papers Michael, a secretary, has left is related to the number of folders she files.\n\nIf Michael files 7 folders, how many papers will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_20",
    "backend_description": "The image shows a line graph titled 'Papers left' with 'Number of folders' on the x-axis and 'Papers left' on the y-axis. A black line starts at 129 papers and decreases to about 8 papers as the number of folders increases from 0 to 11. The line passes through the point (7,52).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_20",
    "tag": "Gr8_24_E4",
    "choices": [
      "31 papers",
      "38 papers",
      "40 papers",
      "52 papers"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 7 folders on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 52 papers. If Michael files 7 folders, he will have 52 papers left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_20_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 7 folders, extending upward until it intersects the black line that represents the number of papers remaining. The red line helps identify where the number of papers is 52 when Michael files 7 folders."
      ],
      [
        "2/3",
        "Gr8_24_4_20_step_2",
        "This image adds a horizontal red line from the y-axis at 52 papers, extending leftward until it intersects the black line that represents the number of papers remaining. The red line helps identify where the number of papers is 52 when Michael files 7 folders."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Charlotte's time remaining is related to the number of problems he solves.\n\nHow many problems does Charlotte need to buy to get the time remaining down to 12 minutes?\n\n_ problems",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_21",
    "backend_description": "The image shows a line graph titled 'Minutes left' with 'Problems solved' on the x-axis and 'Minutes left' on the y-axis. The graph contains a black line starting at 81 minutes on the y-axis and decreasing to 0 minutes as the number of problems increases to over 35. The line passes through the point (29,12).",
    "question_type": "Fill in the blank",
    "question_number": "4_21",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "29"
    ],
    "solution": [
      [
        "1/3",
        "Find 12 minutes on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 29 problems. To get the time remaining down to 12 minutes, Charlotte needs to buy 29 problems."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_21_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 12 minutes mark, extending rightward until it intersects the black line that represents Charlotte's time remaining. The red line helps identify where the time remaining reaches 12 minutes."
      ],
      [
        "2/3",
        "Gr8_24_4_21_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of problems reaches 29. These steps illustrate how to use the graph to determine that Charlotte needs to buy 29 problems for the time remaining to reach 12 minutes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Sarah's savings is related to the number of video games he buys.\n\nHow many video games does Sarah need to buy to get the savings down to $24?\n\n_ video games",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_22",
    "backend_description": "The image shows a line graph titled 'Savings' with 'Number of video games' on the x-axis and 'Savings' on the y-axis. The graph contains a black line starting at $35 on the y-axis and decreasing to $0 as the number of video games increases to over 29. The line passes through the point (9,24).",
    "question_type": "Fill in the blank",
    "question_number": "4_22",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "9"
    ],
    "solution": [
      [
        "1/3",
        "Find $24 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 9 video games. To get the savings down to $24, Sarah needs to buy 9 video games."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_22_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $24 mark, extending rightward until it intersects the black line that represents Sarah's savings. The red line helps identify where the savings reaches $24."
      ],
      [
        "2/3",
        "Gr8_24_4_22_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of video games reaches 9. These steps illustrate how to use the graph to determine that Sarah needs to buy 9 video games for the savings to reach $24."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of balloons Olivia, a party planner, has left is related to the number of party bags she prepares.\n\nIf Olivia prepares 5 party bags, how many balloons will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_23",
    "backend_description": "The image shows a line graph titled 'Balloons left' with 'Number of party bags' on the x-axis and 'Balloons left' on the y-axis. A black line starts at 90 balloons and decreases to about 0 balloons as the number of party bags increases from 0 to 10. The line passes through the point (5,45).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_23",
    "tag": "Gr8_24_E4",
    "choices": [
      "20 balloons",
      "42 balloons",
      "45 balloons",
      "51 balloons"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 5 party bags on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 45 balloons. If Olivia prepares 5 party bags, he will have 45 balloons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_23_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 5 party bags, extending upward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 45 when Olivia prepares 5 party bags."
      ],
      [
        "2/3",
        "Gr8_24_4_23_step_2",
        "This image adds a horizontal red line from the y-axis at 45 balloons, extending leftward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 45 when Olivia prepares 5 party bags."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Emma's gift card balance is related to the number of songs he downloads.\n\nHow many songs does Emma need to buy to get the gift card balance down to $19?\n\n_ songs",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_24",
    "backend_description": "The image shows a line graph titled 'Balance' with 'Number of songs' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $64 on the y-axis and decreasing to $0 as the number of songs increases to over 50. The line passes through the point (35,19).",
    "question_type": "Fill in the blank",
    "question_number": "4_24",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "35"
    ],
    "solution": [
      [
        "1/3",
        "Find $19 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 35 songs. To get the gift card balance down to $19, Emma needs to buy 35 songs."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_24_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $19 mark, extending rightward until it intersects the black line that represents Emma's gift card balance. The red line helps identify where the gift card balance reaches $19."
      ],
      [
        "2/3",
        "Gr8_24_4_24_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of songs reaches 35. These steps illustrate how to use the graph to determine that Emma needs to buy 35 songs for the gift card balance to reach $19."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of batteries Elizabeth, a technician, has left is related to the number of devices he installs.\n\nIf Elizabeth installs 3 devices, how many batteries will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_25",
    "backend_description": "The image shows a line graph titled 'Batteries remaining' with 'Number of devices' on the x-axis and 'Batteries remaining' on the y-axis. A black line starts at 112 batteries and decreases to about 2 batteries as the number of devices increases from 0 to 11. The line passes through the point (3,82).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_25",
    "tag": "Gr8_24_E4",
    "choices": [
      "68 batteries",
      "92 batteries",
      "59 batteries",
      "82 batteries"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 3 devices on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 82 batteries. If Elizabeth installs 3 devices, she will have 82 batteries left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_25_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 3 devices, extending upward until it intersects the black line that represents the number of batteries remaining. The red line helps identify where the number of batteries is 82 when Elizabeth installs 3 devices."
      ],
      [
        "2/3",
        "Gr8_24_4_25_step_2",
        "This image adds a horizontal red line from the y-axis at 82 batteries, extending leftward until it intersects the black line that represents the number of batteries remaining. The red line helps identify where the number of batteries is 82 when Elizabeth installs 3 devices."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Amelia's ice cream is related to the number of scoops he serves.\n\nHow many scoops does Amelia need to buy to get the ice cream down to 46?\n\n_ scoops",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_26",
    "backend_description": "The image shows a line graph titled 'Pints remaining' with 'Scoops served' on the x-axis and 'Pints remaining' on the y-axis. The graph contains a black line starting at 59 on the y-axis and decreasing to 0 as the number of scoops increases to over 100. The line passes through the point (22,46).",
    "question_type": "Fill in the blank",
    "question_number": "4_26",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "22"
    ],
    "solution": [
      [
        "1/3",
        "Find 46 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 22 scoops. To get the ice cream down to 46, Amelia needs to buy 22 scoops."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_26_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 46 mark, extending rightward until it intersects the black line that represents Amelia's ice cream. The red line helps identify where the ice cream reaches 46."
      ],
      [
        "2/3",
        "Gr8_24_4_26_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of scoops reaches 22. These steps illustrate how to use the graph to determine that Amelia needs to buy 22 scoops for the ice cream to reach 46."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of papers Michael, a secretary, has left is related to the number of folders he files.\n\nIf Michael files 9 folders, how many papers will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_27",
    "backend_description": "The image shows a line graph titled 'Papers left' with 'Number of folders' on the x-axis and 'Papers left' on the y-axis. A black line starts at 121 papers and decreases to about 1 papers as the number of folders increases from 0 to 12. The line passes through the point (9,31).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_27",
    "tag": "Gr8_24_E4",
    "choices": [
      "57 papers",
      "2 papers",
      "53 papers",
      "31 papers"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 folders on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 31 papers. If Michael files 9 folders, she will have 31 papers left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_27_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 9 folders, extending upward until it intersects the black line that represents the number of papers remaining. The red line helps identify where the number of papers is 31 when Michael files 9 folders."
      ],
      [
        "2/3",
        "Gr8_24_4_27_step_2",
        "This image adds a horizontal red line from the y-axis at 31 papers, extending leftward until it intersects the black line that represents the number of papers remaining. The red line helps identify where the number of papers is 31 when Michael files 9 folders."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Noah's data allowance is related to the number of videos he streams.\n\nHow many videos does Noah need to buy to get the data allowance down to GB19?\n\n_ videos",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_28",
    "backend_description": "The image shows a line graph titled 'GB remaining' with 'Videos streamed' on the x-axis and 'GB remaining' on the y-axis. The graph contains a black line starting at GB67 on the y-axis and decreasing to GB0 as the number of videos increases to over 41. The line passes through the point (30,19).",
    "question_type": "Fill in the blank",
    "question_number": "4_28",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "30"
    ],
    "solution": [
      [
        "1/3",
        "Find GB19 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 30 videos. To get the data allowance down to GB19, Noah needs to buy 30 videos."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_28_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the GB19 mark, extending rightward until it intersects the black line that represents Noah's data allowance. The red line helps identify where the data allowance reaches GB19."
      ],
      [
        "2/3",
        "Gr8_24_4_28_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of videos reaches 30. These steps illustrate how to use the graph to determine that Noah needs to buy 30 videos for the data allowance to reach GB19."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of roses Carlos, a florist, has left is related to the number of bouquets he creates.\n\nIf Carlos creates 4 bouquets, how many roses will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_29",
    "backend_description": "The image shows a line graph titled 'Roses remaining' with 'Number of bouquets' on the x-axis and 'Roses remaining' on the y-axis. A black line starts at 91 roses and decreases to about 1 roses as the number of bouquets increases from 0 to 10. The line passes through the point (4,55).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_29",
    "tag": "Gr8_24_E4",
    "choices": [
      "39 roses",
      "55 roses",
      "54 roses",
      "66 roses"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Find 4 bouquets on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 55 roses. If Carlos creates 4 bouquets, she will have 55 roses left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_29_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 4 bouquets, extending upward until it intersects the black line that represents the number of roses remaining. The red line helps identify where the number of roses is 55 when Carlos creates 4 bouquets."
      ],
      [
        "2/3",
        "Gr8_24_4_29_step_2",
        "This image adds a horizontal red line from the y-axis at 55 roses, extending leftward until it intersects the black line that represents the number of roses remaining. The red line helps identify where the number of roses is 55 when Carlos creates 4 bouquets."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Lily's battery charge is related to the number of hours she uses.\n\nHow many hours does Lily need to buy to get the battery charge down to 9%?\n\n_ hours",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_30",
    "backend_description": "The image shows a line graph titled 'Battery %' with 'Hours of use' on the x-axis and 'Battery %' on the y-axis. The graph contains a black line starting at 76% on the y-axis and decreasing to 0% as the number of hours increases to over 32. The line passes through the point (28,9).",
    "question_type": "Fill in the blank",
    "question_number": "4_30",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "28"
    ],
    "solution": [
      [
        "1/3",
        "Find 9% on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 28 hours. To get the battery charge down to 9%, Lily needs to buy 28 hours."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_30_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 9% mark, extending rightward until it intersects the black line that represents Lily's battery charge. The red line helps identify where the battery charge reaches 9%."
      ],
      [
        "2/3",
        "Gr8_24_4_30_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of hours reaches 28. These steps illustrate how to use the graph to determine that Lily needs to buy 28 hours for the battery charge to reach 9%."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of tiles Evelyn, a artist, has left is related to the number of mosaics he creates.\n\nIf Evelyn creates 9 mosaics, how many tiles will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_31",
    "backend_description": "The image shows a line graph titled 'Tiles left' with 'Number of mosaics' on the x-axis and 'Tiles left' on the y-axis. A black line starts at 94 tiles and decreases to about 6 tiles as the number of mosaics increases from 0 to 8. The line passes through the point (9,-5).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_31",
    "tag": "Gr8_24_E4",
    "choices": [
      "24 tiles",
      "-5 tiles",
      "2 tiles",
      "9 tiles"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Find 9 mosaics on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at -5 tiles. If Evelyn creates 9 mosaics, she will have -5 tiles left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_31_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 9 mosaics, extending upward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is -5 when Evelyn creates 9 mosaics."
      ],
      [
        "2/3",
        "Gr8_24_4_31_step_2",
        "This image adds a horizontal red line from the y-axis at -5 tiles, extending leftward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is -5 when Evelyn creates 9 mosaics."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of ribbons Ryan, a wrapper, has left is related to the number of gifts she wraps.\n\nIf Ryan wraps 7 gifts, how many ribbons will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_32",
    "backend_description": "The image shows a line graph titled 'Ribbons left' with 'Number of gifts' on the x-axis and 'Ribbons left' on the y-axis. A black line starts at 125 ribbons and decreases to about 5 ribbons as the number of gifts increases from 0 to 10. The line passes through the point (7,41).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_32",
    "tag": "Gr8_24_E4",
    "choices": [
      "63 ribbons",
      "41 ribbons",
      "35 ribbons",
      "54 ribbons"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Find 7 gifts on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 41 ribbons. If Ryan wraps 7 gifts, she will have 41 ribbons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_32_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 7 gifts, extending upward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 41 when Ryan wraps 7 gifts."
      ],
      [
        "2/3",
        "Gr8_24_4_32_step_2",
        "This image adds a horizontal red line from the y-axis at 41 ribbons, extending leftward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 41 when Ryan wraps 7 gifts."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Emma's gift card balance is related to the number of songs she downloads.\n\nHow many songs does Emma need to buy to get the gift card balance down to $22?\n\n_ songs",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_33",
    "backend_description": "The image shows a line graph titled 'Balance' with 'Number of songs' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $56 on the y-axis and decreasing to $0 as the number of songs increases to over 55. The line passes through the point (33,22).",
    "question_type": "Fill in the blank",
    "question_number": "4_33",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "33"
    ],
    "solution": [
      [
        "1/3",
        "Find $22 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 33 songs. To get the gift card balance down to $22, Emma needs to buy 33 songs."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_33_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $22 mark, extending rightward until it intersects the black line that represents Emma's gift card balance. The red line helps identify where the gift card balance reaches $22."
      ],
      [
        "2/3",
        "Gr8_24_4_33_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of songs reaches 33. These steps illustrate how to use the graph to determine that Emma needs to buy 33 songs for the gift card balance to reach $22."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of tulips Maura, a florist, has left is related to the number of arrangements he puts together.\n\nIf Maura puts together 6 arrangements, how many tulips will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_34",
    "backend_description": "The image shows a line graph titled 'Tulips remaining' with 'Number of arrangements' on the x-axis and 'Tulips remaining' on the y-axis. A black line starts at 107 tulips and decreases to about 8 tulips as the number of arrangements increases from 0 to 9. The line passes through the point (6,41).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_34",
    "tag": "Gr8_24_E4",
    "choices": [
      "48 tulips",
      "26 tulips",
      "41 tulips",
      "51 tulips"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 6 arrangements on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 41 tulips. If Maura puts together 6 arrangements, he will have 41 tulips left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_34_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 6 arrangements, extending upward until it intersects the black line that represents the number of tulips remaining. The red line helps identify where the number of tulips is 41 when Maura puts together 6 arrangements."
      ],
      [
        "2/3",
        "Gr8_24_4_34_step_2",
        "This image adds a horizontal red line from the y-axis at 41 tulips, extending leftward until it intersects the black line that represents the number of tulips remaining. The red line helps identify where the number of tulips is 41 when Maura puts together 6 arrangements."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Mike's bank account balance is related to the number of admission tickets she purchases.\n\nHow many admission tickets does Mike need to buy to get the bank account balance down to $42?\n\n_ admission tickets",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_35",
    "backend_description": "The image shows a line graph titled 'Balance' with 'Number of admission tickets' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $64 on the y-axis and decreasing to $0 as the number of admission tickets increases to over 21. The line passes through the point (7,42).",
    "question_type": "Fill in the blank",
    "question_number": "4_35",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "7"
    ],
    "solution": [
      [
        "1/3",
        "Find $42 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 7 admission tickets. To get the bank account balance down to $42, Mike needs to buy 7 admission tickets."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_35_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $42 mark, extending rightward until it intersects the black line that represents Mike's bank account balance. The red line helps identify where the bank account balance reaches $42."
      ],
      [
        "2/3",
        "Gr8_24_4_35_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of admission tickets reaches 7. These steps illustrate how to use the graph to determine that Mike needs to buy 7 admission tickets for the bank account balance to reach $42."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of ribbons Ryan, a wrapper, has left is related to the number of gifts she wraps.\n\nIf Ryan wraps 7 gifts, how many ribbons will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_36",
    "backend_description": "The image shows a line graph titled 'Ribbons left' with 'Number of gifts' on the x-axis and 'Ribbons left' on the y-axis. A black line starts at 144 ribbons and decreases to about 4 ribbons as the number of gifts increases from 0 to 14. The line passes through the point (7,74).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_36",
    "tag": "Gr8_24_E4",
    "choices": [
      "65 ribbons",
      "91 ribbons",
      "45 ribbons",
      "74 ribbons"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 7 gifts on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 74 ribbons. If Ryan wraps 7 gifts, he will have 74 ribbons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_36_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 7 gifts, extending upward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 74 when Ryan wraps 7 gifts."
      ],
      [
        "2/3",
        "Gr8_24_4_36_step_2",
        "This image adds a horizontal red line from the y-axis at 74 ribbons, extending leftward until it intersects the black line that represents the number of ribbons remaining. The red line helps identify where the number of ribbons is 74 when Ryan wraps 7 gifts."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of books Emily, a librarian, has left is related to the number of boxes he packs.\n\nIf Emily packs 5 boxes, how many books will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_37",
    "backend_description": "The image shows a line graph titled 'Books remaining' with 'Number of boxes' on the x-axis and 'Books remaining' on the y-axis. A black line starts at 125 books and decreases to about 5 books as the number of boxes increases from 0 to 10. The line passes through the point (5,65).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_37",
    "tag": "Gr8_24_E4",
    "choices": [
      "49 books",
      "74 books",
      "57 books",
      "65 books"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 5 boxes on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 65 books. If Emily packs 5 boxes, she will have 65 books left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_37_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 5 boxes, extending upward until it intersects the black line that represents the number of books remaining. The red line helps identify where the number of books is 65 when Emily packs 5 boxes."
      ],
      [
        "2/3",
        "Gr8_24_4_37_step_2",
        "This image adds a horizontal red line from the y-axis at 65 books, extending leftward until it intersects the black line that represents the number of books remaining. The red line helps identify where the number of books is 65 when Emily packs 5 boxes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Ethan's candy supply is related to the number of children he gives candy to.\n\nHow many children does Ethan need to buy to get the candy supply down to 16?\n\n_ children",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_38",
    "backend_description": "The image shows a line graph titled 'Candies left' with 'Number of children' on the x-axis and 'Candies left' on the y-axis. The graph contains a black line starting at 69 on the y-axis and decreasing to 0 as the number of children increases to over 67. The line passes through the point (51,16).",
    "question_type": "Fill in the blank",
    "question_number": "4_38",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "51"
    ],
    "solution": [
      [
        "1/3",
        "Find 16 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 51 children. To get the candy supply down to 16, Ethan needs to buy 51 children."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_38_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 16 mark, extending rightward until it intersects the black line that represents Ethan's candy supply. The red line helps identify where the candy supply reaches 16."
      ],
      [
        "2/3",
        "Gr8_24_4_38_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of children reaches 51. These steps illustrate how to use the graph to determine that Ethan needs to buy 51 children for the candy supply to reach 16."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Emma's gift card balance is related to the number of songs she downloads.\n\nHow many songs does Emma need to buy to get the gift card balance down to $6?\n\n_ songs",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_39",
    "backend_description": "The image shows a line graph titled 'Balance' with 'Number of songs' on the x-axis and 'Balance' on the y-axis. The graph contains a black line starting at $57 on the y-axis and decreasing to $0 as the number of songs increases to over 46. The line passes through the point (41,6).",
    "question_type": "Fill in the blank",
    "question_number": "4_39",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "41"
    ],
    "solution": [
      [
        "1/3",
        "Find $6 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 41 songs. To get the gift card balance down to $6, Emma needs to buy 41 songs."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_39_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $6 mark, extending rightward until it intersects the black line that represents Emma's gift card balance. The red line helps identify where the gift card balance reaches $6."
      ],
      [
        "2/3",
        "Gr8_24_4_39_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of songs reaches 41. These steps illustrate how to use the graph to determine that Emma needs to buy 41 songs for the gift card balance to reach $6."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of balloons Olivia, a party planner, has left is related to the number of party bags he prepares.\n\nIf Olivia prepares 6 party bags, how many balloons will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_40",
    "backend_description": "The image shows a line graph titled 'Balloons left' with 'Number of party bags' on the x-axis and 'Balloons left' on the y-axis. A black line starts at 101 balloons and decreases to about 5 balloons as the number of party bags increases from 0 to 16. The line passes through the point (6,65).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_40",
    "tag": "Gr8_24_E4",
    "choices": [
      "42 balloons",
      "75 balloons",
      "65 balloons",
      "59 balloons"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 6 party bags on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 65 balloons. If Olivia prepares 6 party bags, he will have 65 balloons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_40_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 6 party bags, extending upward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 65 when Olivia prepares 6 party bags."
      ],
      [
        "2/3",
        "Gr8_24_4_40_step_2",
        "This image adds a horizontal red line from the y-axis at 65 balloons, extending leftward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 65 when Olivia prepares 6 party bags."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of tiles Evelyn, a artist, has left is related to the number of mosaics she creates.\n\nIf Evelyn creates 5 mosaics, how many tiles will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_41",
    "backend_description": "The image shows a line graph titled 'Tiles left' with 'Number of mosaics' on the x-axis and 'Tiles left' on the y-axis. A black line starts at 129 tiles and decreases to about 1 tiles as the number of mosaics increases from 0 to 16. The line passes through the point (5,89).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_41",
    "tag": "Gr8_24_E4",
    "choices": [
      "70 tiles",
      "66 tiles",
      "75 tiles",
      "89 tiles"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 5 mosaics on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 89 tiles. If Evelyn creates 5 mosaics, he will have 89 tiles left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_41_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 5 mosaics, extending upward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is 89 when Evelyn creates 5 mosaics."
      ],
      [
        "2/3",
        "Gr8_24_4_41_step_2",
        "This image adds a horizontal red line from the y-axis at 89 tiles, extending leftward until it intersects the black line that represents the number of tiles remaining. The red line helps identify where the number of tiles is 89 when Evelyn creates 5 mosaics."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Ava's ink level is related to the number of pages he prints.\n\nHow many pages does Ava need to buy to get the ink level down to 33%?\n\n_ pages",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_42",
    "backend_description": "The image shows a line graph titled 'Ink %' with 'Pages printed' on the x-axis and 'Ink %' on the y-axis. The graph contains a black line starting at 44% on the y-axis and decreasing to 0% as the number of pages increases to over 15. The line passes through the point (3,33).",
    "question_type": "Fill in the blank",
    "question_number": "4_42",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/3",
        "Find 33% on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 3 pages. To get the ink level down to 33%, Ava needs to buy 3 pages."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_42_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 33% mark, extending rightward until it intersects the black line that represents Ava's ink level. The red line helps identify where the ink level reaches 33%."
      ],
      [
        "2/3",
        "Gr8_24_4_42_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of pages reaches 3. These steps illustrate how to use the graph to determine that Ava needs to buy 3 pages for the ink level to reach 33%."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Jake's fuel tank is related to the number of miles he drives.\n\nHow many miles does Jake need to buy to get the fuel tank down to 17?\n\n_ miles",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_43",
    "backend_description": "The image shows a line graph titled 'Gallons remaining' with 'Miles driven' on the x-axis and 'Gallons remaining' on the y-axis. The graph contains a black line starting at 81 on the y-axis and decreasing to 0 as the number of miles increases to over 39. The line passes through the point (31,17).",
    "question_type": "Fill in the blank",
    "question_number": "4_43",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "31"
    ],
    "solution": [
      [
        "1/3",
        "Find 17 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 31 miles. To get the fuel tank down to 17, Jake needs to buy 31 miles."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_43_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 17 mark, extending rightward until it intersects the black line that represents Jake's fuel tank. The red line helps identify where the fuel tank reaches 17."
      ],
      [
        "2/3",
        "Gr8_24_4_43_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of miles reaches 31. These steps illustrate how to use the graph to determine that Jake needs to buy 31 miles for the fuel tank to reach 17."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of balloons Olivia, a party planner, has left is related to the number of party bags she prepares.\n\nIf Olivia prepares 8 party bags, how many balloons will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_44",
    "backend_description": "The image shows a line graph titled 'Balloons left' with 'Number of party bags' on the x-axis and 'Balloons left' on the y-axis. A black line starts at 115 balloons and decreases to about 0 balloons as the number of party bags increases from 0 to 23. The line passes through the point (8,75).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_44",
    "tag": "Gr8_24_E4",
    "choices": [
      "75 balloons",
      "48 balloons",
      "100 balloons",
      "46 balloons"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Find 8 party bags on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 75 balloons. If Olivia prepares 8 party bags, he will have 75 balloons left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_44_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 8 party bags, extending upward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 75 when Olivia prepares 8 party bags."
      ],
      [
        "2/3",
        "Gr8_24_4_44_step_2",
        "This image adds a horizontal red line from the y-axis at 75 balloons, extending leftward until it intersects the black line that represents the number of balloons remaining. The red line helps identify where the number of balloons is 75 when Olivia prepares 8 party bags."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Aiden's candle height is related to the number of hours he burns for.\n\nHow many hours does Aiden need to buy to get the candle height down to cm19?\n\n_ hours",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_45",
    "backend_description": "The image shows a line graph titled 'Height (cm)' with 'Hours burned' on the x-axis and 'Height (cm)' on the y-axis. The graph contains a black line starting at cm65 on the y-axis and decreasing to cm0 as the number of hours increases to over 97. The line passes through the point (68,19).",
    "question_type": "Fill in the blank",
    "question_number": "4_45",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "68"
    ],
    "solution": [
      [
        "1/3",
        "Find cm19 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 68 hours. To get the candle height down to cm19, Aiden needs to buy 68 hours."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_45_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the cm19 mark, extending rightward until it intersects the black line that represents Aiden's candle height. The red line helps identify where the candle height reaches cm19."
      ],
      [
        "2/3",
        "Gr8_24_4_45_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of hours reaches 68. These steps illustrate how to use the graph to determine that Aiden needs to buy 68 hours for the candle height to reach cm19."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Jackson's budget is related to the number of items she purchases.\n\nHow many items does Jackson need to buy to get the budget down to $34?\n\n_ items",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_46",
    "backend_description": "The image shows a line graph titled 'Budget remaining' with 'Items purchased' on the x-axis and 'Budget remaining' on the y-axis. The graph contains a black line starting at $74 on the y-axis and decreasing to $0 as the number of items increases to over 26. The line passes through the point (14,34).",
    "question_type": "Fill in the blank",
    "question_number": "4_46",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "14"
    ],
    "solution": [
      [
        "1/3",
        "Find $34 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 14 items. To get the budget down to $34, Jackson needs to buy 14 items."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_46_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the $34 mark, extending rightward until it intersects the black line that represents Jackson's budget. The red line helps identify where the budget reaches $34."
      ],
      [
        "2/3",
        "Gr8_24_4_46_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of items reaches 14. These steps illustrate how to use the graph to determine that Jackson needs to buy 14 items for the budget to reach $34."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Charlotte's time remaining is related to the number of problems he solves.\n\nHow many problems does Charlotte need to buy to get the time remaining down to 40 minutes?\n\n_ problems",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_47",
    "backend_description": "The image shows a line graph titled 'Minutes left' with 'Problems solved' on the x-axis and 'Minutes left' on the y-axis. The graph contains a black line starting at 50 minutes on the y-axis and decreasing to 0 minutes as the number of problems increases to over 18. The line passes through the point (3,40).",
    "question_type": "Fill in the blank",
    "question_number": "4_47",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "3"
    ],
    "solution": [
      [
        "1/3",
        "Find 40 minutes on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 3 problems. To get the time remaining down to 40 minutes, Charlotte needs to buy 3 problems."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_47_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 40 minutes mark, extending rightward until it intersects the black line that represents Charlotte's time remaining. The red line helps identify where the time remaining reaches 40 minutes."
      ],
      [
        "2/3",
        "Gr8_24_4_47_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of problems reaches 3. These steps illustrate how to use the graph to determine that Charlotte needs to buy 3 problems for the time remaining to reach 40 minutes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Charlotte's time remaining is related to the number of problems she solves.\n\nHow many problems does Charlotte need to buy to get the time remaining down to 24 minutes?\n\n_ problems",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_48",
    "backend_description": "The image shows a line graph titled 'Minutes left' with 'Problems solved' on the x-axis and 'Minutes left' on the y-axis. The graph contains a black line starting at 56 minutes on the y-axis and decreasing to 0 minutes as the number of problems increases to over 25. The line passes through the point (14,24).",
    "question_type": "Fill in the blank",
    "question_number": "4_48",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "14"
    ],
    "solution": [
      [
        "1/3",
        "Find 24 minutes on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 14 problems. To get the time remaining down to 24 minutes, Charlotte needs to buy 14 problems."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_48_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the 24 minutes mark, extending rightward until it intersects the black line that represents Charlotte's time remaining. The red line helps identify where the time remaining reaches 24 minutes."
      ],
      [
        "2/3",
        "Gr8_24_4_48_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of problems reaches 14. These steps illustrate how to use the graph to determine that Charlotte needs to buy 14 problems for the time remaining to reach 24 minutes."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of pencils Abigail, a teacher, has left is related to the number of students she gives out.\n\nIf Abigail gives out 10 students, how many pencils will he have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_49",
    "backend_description": "The image shows a line graph titled 'Pencils left' with 'Number of students' on the x-axis and 'Pencils left' on the y-axis. A black line starts at 126 pencils and decreases to about 6 pencils as the number of students increases from 0 to 10. The line passes through the point (10,6).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_49",
    "tag": "Gr8_24_E4",
    "choices": [
      "9 pencils",
      "36 pencils",
      "6 pencils",
      "23 pencils"
    ],
    "correct_answers": [
      "C"
    ],
    "solution": [
      [
        "1/3",
        "Find 10 students on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 6 pencils. If Abigail gives out 10 students, she will have 6 pencils left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_49_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 10 students, extending upward until it intersects the black line that represents the number of pencils remaining. The red line helps identify where the number of pencils is 6 when Abigail gives out 10 students."
      ],
      [
        "2/3",
        "Gr8_24_4_49_step_2",
        "This image adds a horizontal red line from the y-axis at 6 pencils, extending leftward until it intersects the black line that represents the number of pencils remaining. The red line helps identify where the number of pencils is 6 when Abigail gives out 10 students."
      ]
    ]
  },
  {
    "question_text": "This graph shows how the number of stamps Benjamin, a clerk, has left is related to the number of letters he mails.\n\nIf Benjamin mails 10 letters, how many stamps will she have left?",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_50",
    "backend_description": "The image shows a line graph titled 'Stamps remaining' with 'Number of letters' on the x-axis and 'Stamps remaining' on the y-axis. A black line starts at 132 stamps and decreases to about 6 stamps as the number of letters increases from 0 to 18. The line passes through the point (10,62).",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "4_50",
    "tag": "Gr8_24_E4",
    "choices": [
      "71 stamps",
      "82 stamps",
      "68 stamps",
      "62 stamps"
    ],
    "correct_answers": [
      "D"
    ],
    "solution": [
      [
        "1/3",
        "Find 10 letters on the x-axis. Move up until you intersect the graph."
      ],
      [
        "2/3",
        "Now move left until you intersect the y-axis."
      ],
      [
        "3/3",
        "You intersect the y-axis at 62 stamps. If Benjamin mails 10 letters, he will have 62 stamps left."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_50_step_1",
        "This image shows the same graph with a vertical red line drawn from the x-axis at 10 letters, extending upward until it intersects the black line that represents the number of stamps remaining. The red line helps identify where the number of stamps is 62 when Benjamin mails 10 letters."
      ],
      [
        "2/3",
        "Gr8_24_4_50_step_2",
        "This image adds a horizontal red line from the y-axis at 62 stamps, extending leftward until it intersects the black line that represents the number of stamps remaining. The red line helps identify where the number of stamps is 62 when Benjamin mails 10 letters."
      ]
    ]
  },
  {
    "question_text": "This graph shows how Aiden's candle height is related to the number of hours she burns for.\n\nHow many hours does Aiden need to buy to get the candle height down to cm50?\n\n_ hours",
    "skills": "interpret-the-graph-of-a-linear-function-word-problems",
    "image_tag": "Gr8_24_4_51",
    "backend_description": "The image shows a line graph titled 'Height (cm)' with 'Hours burned' on the x-axis and 'Height (cm)' on the y-axis. The graph contains a black line starting at cm78 on the y-axis and decreasing to cm0 as the number of hours increases to over 52. The line passes through the point (18,50).",
    "question_type": "Fill in the blank",
    "question_number": "4_51",
    "tag": "Gr8_24_E4",
    "correct_answers": [
      "18"
    ],
    "solution": [
      [
        "1/3",
        "Find cm50 on the y-axis. Move right until you intersect the graph."
      ],
      [
        "2/3",
        "Now move down until you intersect the x-axis."
      ],
      [
        "3/3",
        "You intersect the x-axis at 18 hours. To get the candle height down to cm50, Aiden needs to buy 18 hours."
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_24_4_51_step_1",
        "This image shows the same graph with a horizontal red line drawn across the y-axis at the cm50 mark, extending rightward until it intersects the black line that represents Aiden's candle height. The red line helps identify where the candle height reaches cm50."
      ],
      [
        "2/3",
        "Gr8_24_4_51_step_2",
        "This image adds a vertical red line downward from that point of intersection to the x-axis, marking where the number of hours reaches 18. These steps illustrate how to use the graph to determine that Aiden needs to buy 18 hours for the candle height to reach cm50."
      ]
    ]
  }
]