[
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_1",
    "backend_description": "The image shows a large cube made up of smaller unit cubes. The cube is shaded with different tones of pink and purple to show its three-dimensional structure, with 4 cubes along each edge, forming a 4 by 4 by 4 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_1",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_1_A",
      "Gr8_39_1_1_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 16 pink squares arranged in 4 rows and 4 columns",
      "This image displays a flat grid of 20 pink squares arranged in 5 rows and 4 columns"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_1_step_1",
        "The image shows a large pink cube made up of smaller unit cubes. The cube is arranged in a 4 by 4 by 4 structure, with each face consisting of 16 visible unit squares. The front face is highlighted with a black border, showing the 4 by 4 arrangement of 16 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_1_step_2",
        "This image displays a flat grid of 16 pink squares arranged in 4 rows and 4 columns, representing the 4 by 4 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_2",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_2",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_2_A",
      "Gr8_39_1_2_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 49 blue and white squares arranged in 7 rows and 7 columns",
      "This image displays a flat grid of 46 blue and white squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_2_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The back face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_2_step_2",
        "This image displays a flat grid of 49 blue and white squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_3",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Mario game blocks. The cube is shaded with different tones of brown and gold to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_3",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_3_A",
      "Gr8_39_1_3_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 62 brown and gold squares",
      "This image displays a flat grid of 64 brown and gold squares arranged in 8 rows and 8 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_3_step_1",
        "The image shows a large brown and gold cube made up of smaller unit cubes styled as Mario game blocks. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The right side face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_3_step_2",
        "This image displays a flat grid of 64 brown and gold squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_4",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_4",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_4_A",
      "Gr8_39_1_4_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 30 blue and white squares",
      "This image displays a flat grid of 25 blue and white squares arranged in 5 rows and 5 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_4_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The left side face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_4_step_2",
        "This image displays a flat grid of 25 blue and white squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_5",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pac-Man dots. The cube is shaded with different tones of yellow to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_5",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_5_A",
      "Gr8_39_1_5_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 52 yellow squares",
      "This image displays a flat grid of 49 yellow squares arranged in 7 rows and 7 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_5_step_1",
        "The image shows a large yellow cube made up of smaller unit cubes styled as Pac-Man dots. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The right side face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_5_step_2",
        "This image displays a flat grid of 49 yellow squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_6",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is shaded with different tones of multicolored to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_6",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_6_A",
      "Gr8_39_1_6_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 25 multicolored squares arranged in 5 rows and 5 columns",
      "This image displays a flat grid of 23 multicolored squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_6_step_1",
        "The image shows a large multicolored cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The left side face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_6_step_2",
        "This image displays a flat grid of 25 multicolored squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_7",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is shaded with different tones of gray and black to show its three-dimensional structure, with 9 cubes along each edge, forming a 9 by 9 by 9 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_7",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_7_A",
      "Gr8_39_1_7_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 81 gray and black squares arranged in 9 rows and 9 columns",
      "This image displays a flat grid of 85 gray and black squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_7_step_1",
        "The image shows a large gray and black cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is arranged in a 9 by 9 by 9 structure, with each face consisting of 81 visible unit squares. The back face is highlighted with a black border, showing the 9 by 9 arrangement of 81 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_7_step_2",
        "This image displays a flat grid of 81 gray and black squares arranged in 9 rows and 9 columns, representing the 9 by 9 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_8",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is shaded with different tones of blue glowing to show its three-dimensional structure, with 9 cubes along each edge, forming a 9 by 9 by 9 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_8",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_8_A",
      "Gr8_39_1_8_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 81 blue glowing squares arranged in 9 rows and 9 columns",
      "This image displays a flat grid of 77 blue glowing squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_8_step_1",
        "The image shows a large blue glowing cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is arranged in a 9 by 9 by 9 structure, with each face consisting of 81 visible unit squares. The left side face is highlighted with a black border, showing the 9 by 9 arrangement of 81 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_8_step_2",
        "This image displays a flat grid of 81 blue glowing squares arranged in 9 rows and 9 columns, representing the 9 by 9 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_9",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Among Us character blocks. The cube is shaded with different tones of red and cyan to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_9",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_9_A",
      "Gr8_39_1_9_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 4 red and cyan squares arranged in 2 rows and 2 columns",
      "This image displays a flat grid of 2 red and cyan squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_9_step_1",
        "The image shows a large red and cyan cube made up of smaller unit cubes styled as Among Us character blocks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The front face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_9_step_2",
        "This image displays a flat grid of 4 red and cyan squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_10",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Avatar element blocks. The cube is shaded with different tones of four different colors to show its three-dimensional structure, with 3 cubes along each edge, forming a 3 by 3 by 3 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_10",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_10_A",
      "Gr8_39_1_10_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 9 four different colors squares arranged in 3 rows and 3 columns",
      "This image displays a flat grid of 13 four different colors squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_10_step_1",
        "The image shows a large four different colors cube made up of smaller unit cubes styled as Avatar element blocks. The cube is arranged in a 3 by 3 by 3 structure, with each face consisting of 9 visible unit squares. The side face is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_10_step_2",
        "This image displays a flat grid of 9 four different colors squares arranged in 3 rows and 3 columns, representing the 3 by 3 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_11",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_11",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_11_A",
      "Gr8_39_1_11_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 2 red and yellow squares",
      "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_11_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The top face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_11_step_2",
        "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_12",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is shaded with different tones of wood and stone textures to show its three-dimensional structure, with 9 cubes along each edge, forming a 9 by 9 by 9 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_12",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_12_A",
      "Gr8_39_1_12_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 81 wood and stone textures squares arranged in 9 rows and 9 columns",
      "This image displays a flat grid of 78 wood and stone textures squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_12_step_1",
        "The image shows a large wood and stone textures cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is arranged in a 9 by 9 by 9 structure, with each face consisting of 81 visible unit squares. The side face is highlighted with a black border, showing the 9 by 9 arrangement of 81 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_12_step_2",
        "This image displays a flat grid of 81 wood and stone textures squares arranged in 9 rows and 9 columns, representing the 9 by 9 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_13",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is shaded with different tones of gray and black to show its three-dimensional structure, with 3 cubes along each edge, forming a 3 by 3 by 3 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_13",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_13_A",
      "Gr8_39_1_13_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 11 gray and black squares",
      "This image displays a flat grid of 9 gray and black squares arranged in 3 rows and 3 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_13_step_1",
        "The image shows a large gray and black cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is arranged in a 3 by 3 by 3 structure, with each face consisting of 9 visible unit squares. The right side face is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_13_step_2",
        "This image displays a flat grid of 9 gray and black squares arranged in 3 rows and 3 columns, representing the 3 by 3 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_14",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pac-Man dots. The cube is shaded with different tones of yellow to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_14",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_14_A",
      "Gr8_39_1_14_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 49 yellow squares arranged in 7 rows and 7 columns",
      "This image displays a flat grid of 52 yellow squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_14_step_1",
        "The image shows a large yellow cube made up of smaller unit cubes styled as Pac-Man dots. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The right side face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_14_step_2",
        "This image displays a flat grid of 49 yellow squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_15",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_15",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_15_A",
      "Gr8_39_1_15_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 41 red and yellow squares",
      "This image displays a flat grid of 36 red and yellow squares arranged in 6 rows and 6 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_15_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The back face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_15_step_2",
        "This image displays a flat grid of 36 red and yellow squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_16",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is shaded with different tones of wood and stone textures to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_16",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_16_A",
      "Gr8_39_1_16_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 64 wood and stone textures squares arranged in 8 rows and 8 columns",
      "This image displays a flat grid of 68 wood and stone textures squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_16_step_1",
        "The image shows a large wood and stone textures cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The top face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_16_step_2",
        "This image displays a flat grid of 64 wood and stone textures squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_17",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_17",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_17_A",
      "Gr8_39_1_17_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 36 blue and white squares arranged in 6 rows and 6 columns",
      "This image displays a flat grid of 34 blue and white squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_17_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The back face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_17_step_2",
        "This image displays a flat grid of 36 blue and white squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_18",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is shaded with different tones of wood and stone textures to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_18",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_18_A",
      "Gr8_39_1_18_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 25 wood and stone textures squares arranged in 5 rows and 5 columns",
      "This image displays a flat grid of 21 wood and stone textures squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_18_step_1",
        "The image shows a large wood and stone textures cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The top face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_18_step_2",
        "This image displays a flat grid of 25 wood and stone textures squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_19",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Minecraft blocks. The cube is shaded with different tones of green and brown to show its three-dimensional structure, with 3 cubes along each edge, forming a 3 by 3 by 3 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_19",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_19_A",
      "Gr8_39_1_19_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 9 green and brown squares arranged in 3 rows and 3 columns",
      "This image displays a flat grid of 11 green and brown squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_19_step_1",
        "The image shows a large green and brown cube made up of smaller unit cubes styled as Minecraft blocks. The cube is arranged in a 3 by 3 by 3 structure, with each face consisting of 9 visible unit squares. The back face is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_19_step_2",
        "This image displays a flat grid of 9 green and brown squares arranged in 3 rows and 3 columns, representing the 3 by 3 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_20",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is shaded with different tones of blue glowing to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_20",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_20_A",
      "Gr8_39_1_20_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 49 blue glowing squares arranged in 7 rows and 7 columns",
      "This image displays a flat grid of 52 blue glowing squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_20_step_1",
        "The image shows a large blue glowing cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The left side face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_20_step_2",
        "This image displays a flat grid of 49 blue glowing squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_21",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Space Invaders pixels. The cube is shaded with different tones of white and green to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_21",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_21_A",
      "Gr8_39_1_21_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 7 white and green squares",
      "This image displays a flat grid of 4 white and green squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_21_step_1",
        "The image shows a large white and green cube made up of smaller unit cubes styled as Space Invaders pixels. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The left side face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_21_step_2",
        "This image displays a flat grid of 4 white and green squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_22",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_22",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_22_A",
      "Gr8_39_1_22_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 60 red and yellow squares",
      "This image displays a flat grid of 64 red and yellow squares arranged in 8 rows and 8 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_22_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The front face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_22_step_2",
        "This image displays a flat grid of 64 red and yellow squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_23",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is shaded with different tones of multicolored to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_23",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_23_A",
      "Gr8_39_1_23_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 4 multicolored squares arranged in 2 rows and 2 columns",
      "This image displays a flat grid of 8 multicolored squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_23_step_1",
        "The image shows a large multicolored cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The top face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_23_step_2",
        "This image displays a flat grid of 4 multicolored squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_24",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Overwatch loot boxes. The cube is shaded with different tones of orange and purple to show its three-dimensional structure, with 10 cubes along each edge, forming a 10 by 10 by 10 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_24",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_24_A",
      "Gr8_39_1_24_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 104 orange and purple squares",
      "This image displays a flat grid of 100 orange and purple squares arranged in 10 rows and 10 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_24_step_1",
        "The image shows a large orange and purple cube made up of smaller unit cubes styled as Overwatch loot boxes. The cube is arranged in a 10 by 10 by 10 structure, with each face consisting of 100 visible unit squares. The left side face is highlighted with a black border, showing the 10 by 10 arrangement of 100 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_24_step_2",
        "This image displays a flat grid of 100 orange and purple squares arranged in 10 rows and 10 columns, representing the 10 by 10 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_25",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is shaded with different tones of blue glowing to show its three-dimensional structure, with 9 cubes along each edge, forming a 9 by 9 by 9 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_25",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_25_A",
      "Gr8_39_1_25_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 81 blue glowing squares arranged in 9 rows and 9 columns",
      "This image displays a flat grid of 77 blue glowing squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_25_step_1",
        "The image shows a large blue glowing cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is arranged in a 9 by 9 by 9 structure, with each face consisting of 81 visible unit squares. The right side face is highlighted with a black border, showing the 9 by 9 arrangement of 81 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_25_step_2",
        "This image displays a flat grid of 81 blue glowing squares arranged in 9 rows and 9 columns, representing the 9 by 9 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_26",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_26",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_26_A",
      "Gr8_39_1_26_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 1 red and yellow squares arranged in 1 rows and 1 columns",
      "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_26_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The back face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_26_step_2",
        "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_27",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Final Fantasy materia. The cube is shaded with different tones of glowing green and red to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_27",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_27_A",
      "Gr8_39_1_27_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 45 glowing green and red squares",
      "This image displays a flat grid of 49 glowing green and red squares arranged in 7 rows and 7 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_27_step_1",
        "The image shows a large glowing green and red cube made up of smaller unit cubes styled as Final Fantasy materia. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The left side face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_27_step_2",
        "This image displays a flat grid of 49 glowing green and red squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_28",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Harry Potter spell cubes. The cube is shaded with different tones of gold and silver to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_28",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_28_A",
      "Gr8_39_1_28_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 45 gold and silver squares",
      "This image displays a flat grid of 49 gold and silver squares arranged in 7 rows and 7 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_28_step_1",
        "The image shows a large gold and silver cube made up of smaller unit cubes styled as Harry Potter spell cubes. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The side face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_28_step_2",
        "This image displays a flat grid of 49 gold and silver squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_29",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_29",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_29_A",
      "Gr8_39_1_29_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 61 blue and white squares",
      "This image displays a flat grid of 64 blue and white squares arranged in 8 rows and 8 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_29_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The right side face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_29_step_2",
        "This image displays a flat grid of 64 blue and white squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_30",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Tetris blocks. The cube is shaded with different tones of various bright colors to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_30",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_30_A",
      "Gr8_39_1_30_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 29 various bright colors squares",
      "This image displays a flat grid of 25 various bright colors squares arranged in 5 rows and 5 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_30_step_1",
        "The image shows a large various bright colors cube made up of smaller unit cubes styled as Tetris blocks. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The front face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_30_step_2",
        "This image displays a flat grid of 25 various bright colors squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_31",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Harry Potter spell cubes. The cube is shaded with different tones of gold and silver to show its three-dimensional structure, with 10 cubes along each edge, forming a 10 by 10 by 10 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_31",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_31_A",
      "Gr8_39_1_31_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 100 gold and silver squares arranged in 10 rows and 10 columns",
      "This image displays a flat grid of 102 gold and silver squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_31_step_1",
        "The image shows a large gold and silver cube made up of smaller unit cubes styled as Harry Potter spell cubes. The cube is arranged in a 10 by 10 by 10 structure, with each face consisting of 100 visible unit squares. The left side face is highlighted with a black border, showing the 10 by 10 arrangement of 100 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_31_step_2",
        "This image displays a flat grid of 100 gold and silver squares arranged in 10 rows and 10 columns, representing the 10 by 10 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_32",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Tetris blocks. The cube is shaded with different tones of various bright colors to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_32",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_32_A",
      "Gr8_39_1_32_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 8 various bright colors squares",
      "This image displays a flat grid of 4 various bright colors squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_32_step_1",
        "The image shows a large various bright colors cube made up of smaller unit cubes styled as Tetris blocks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The right side face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_32_step_2",
        "This image displays a flat grid of 4 various bright colors squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_33",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is shaded with different tones of blue glowing to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_33",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_33_A",
      "Gr8_39_1_33_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 40 blue glowing squares",
      "This image displays a flat grid of 36 blue glowing squares arranged in 6 rows and 6 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_33_step_1",
        "The image shows a large blue glowing cube made up of smaller unit cubes styled as Star Wars holocrons. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The right side face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_33_step_2",
        "This image displays a flat grid of 36 blue glowing squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_34",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Zelda rupee crystals. The cube is shaded with different tones of green and blue to show its three-dimensional structure, with 3 cubes along each edge, forming a 3 by 3 by 3 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_34",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_34_A",
      "Gr8_39_1_34_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 9 green and blue squares arranged in 3 rows and 3 columns",
      "This image displays a flat grid of 5 green and blue squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_34_step_1",
        "The image shows a large green and blue cube made up of smaller unit cubes styled as Zelda rupee crystals. The cube is arranged in a 3 by 3 by 3 structure, with each face consisting of 9 visible unit squares. The back face is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_34_step_2",
        "This image displays a flat grid of 9 green and blue squares arranged in 3 rows and 3 columns, representing the 3 by 3 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_35",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_35",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_35_A",
      "Gr8_39_1_35_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 9 blue and white squares arranged in 3 rows and 3 columns",
      "This image displays a flat grid of 4 blue and white squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_35_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The side face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_35_step_2",
        "This image displays a flat grid of 4 blue and white squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_36",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Tetris blocks. The cube is shaded with different tones of various bright colors to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_36",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_36_A",
      "Gr8_39_1_36_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 25 various bright colors squares arranged in 5 rows and 5 columns",
      "This image displays a flat grid of 22 various bright colors squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_36_step_1",
        "The image shows a large various bright colors cube made up of smaller unit cubes styled as Tetris blocks. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The left side face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_36_step_2",
        "This image displays a flat grid of 25 various bright colors squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_37",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is shaded with different tones of purple and orange to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_37",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_37_A",
      "Gr8_39_1_37_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 36 purple and orange squares arranged in 6 rows and 6 columns",
      "This image displays a flat grid of 33 purple and orange squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_37_step_1",
        "The image shows a large purple and orange cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The back face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_37_step_2",
        "This image displays a flat grid of 36 purple and orange squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_38",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Among Us character blocks. The cube is shaded with different tones of red and cyan to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_38",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_38_A",
      "Gr8_39_1_38_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 9 red and cyan squares arranged in 3 rows and 3 columns",
      "This image displays a flat grid of 4 red and cyan squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_38_step_1",
        "The image shows a large red and cyan cube made up of smaller unit cubes styled as Among Us character blocks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The side face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_38_step_2",
        "This image displays a flat grid of 4 red and cyan squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_39",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_39",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_39_A",
      "Gr8_39_1_39_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 25 red and yellow squares arranged in 5 rows and 5 columns",
      "This image displays a flat grid of 21 red and yellow squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_39_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The back face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_39_step_2",
        "This image displays a flat grid of 25 red and yellow squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_40",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is shaded with different tones of gray and black to show its three-dimensional structure, with 10 cubes along each edge, forming a 10 by 10 by 10 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_40",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_40_A",
      "Gr8_39_1_40_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 98 gray and black squares",
      "This image displays a flat grid of 100 gray and black squares arranged in 10 rows and 10 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_40_step_1",
        "The image shows a large gray and black cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is arranged in a 10 by 10 by 10 structure, with each face consisting of 100 visible unit squares. The front face is highlighted with a black border, showing the 10 by 10 arrangement of 100 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_40_step_2",
        "This image displays a flat grid of 100 gray and black squares arranged in 10 rows and 10 columns, representing the 10 by 10 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the right side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_41",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is shaded with different tones of gray and black to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_41",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_41_A",
      "Gr8_39_1_41_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 25 gray and black squares arranged in 5 rows and 5 columns",
      "This image displays a flat grid of 28 gray and black squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the right side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the right side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_41_step_1",
        "The image shows a large gray and black cube made up of smaller unit cubes styled as Nintendo game cartridges. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The right side face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_41_step_2",
        "This image displays a flat grid of 25 gray and black squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the right side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_42",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is shaded with different tones of purple and orange to show its three-dimensional structure, with 3 cubes along each edge, forming a 3 by 3 by 3 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_42",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_42_A",
      "Gr8_39_1_42_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 7 purple and orange squares",
      "This image displays a flat grid of 9 purple and orange squares arranged in 3 rows and 3 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_42_step_1",
        "The image shows a large purple and orange cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is arranged in a 3 by 3 by 3 structure, with each face consisting of 9 visible unit squares. The left side face is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_42_step_2",
        "This image displays a flat grid of 9 purple and orange squares arranged in 3 rows and 3 columns, representing the 3 by 3 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_43",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 7 cubes along each edge, forming a 7 by 7 by 7 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_43",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_43_A",
      "Gr8_39_1_43_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 49 blue and white squares arranged in 7 rows and 7 columns",
      "This image displays a flat grid of 52 blue and white squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_43_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 7 by 7 by 7 structure, with each face consisting of 49 visible unit squares. The top face is highlighted with a black border, showing the 7 by 7 arrangement of 49 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_43_step_2",
        "This image displays a flat grid of 49 blue and white squares arranged in 7 rows and 7 columns, representing the 7 by 7 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the top, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_44",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is shaded with different tones of purple and orange to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_44",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_44_A",
      "Gr8_39_1_44_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 36 purple and orange squares arranged in 6 rows and 6 columns",
      "This image displays a flat grid of 34 purple and orange squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the top, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_44_step_1",
        "The image shows a large purple and orange cube made up of smaller unit cubes styled as Marvel infinity stones. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The top face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_44_step_2",
        "This image displays a flat grid of 36 purple and orange squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the top."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_45",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Final Fantasy materia. The cube is shaded with different tones of glowing green and red to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_45",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_45_A",
      "Gr8_39_1_45_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 64 glowing green and red squares arranged in 8 rows and 8 columns",
      "This image displays a flat grid of 68 glowing green and red squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_45_step_1",
        "The image shows a large glowing green and red cube made up of smaller unit cubes styled as Final Fantasy materia. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The left side face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_45_step_2",
        "This image displays a flat grid of 64 glowing green and red squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the left side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_46",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Sonic rings arrangement. The cube is shaded with different tones of golden to show its three-dimensional structure, with 8 cubes along each edge, forming a 8 by 8 by 8 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_46",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_46_A",
      "Gr8_39_1_46_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 68 golden squares",
      "This image displays a flat grid of 64 golden squares arranged in 8 rows and 8 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_46_step_1",
        "The image shows a large golden cube made up of smaller unit cubes styled as Sonic rings arrangement. The cube is arranged in a 8 by 8 by 8 structure, with each face consisting of 64 visible unit squares. The side face is highlighted with a black border, showing the 8 by 8 arrangement of 64 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_46_step_2",
        "This image displays a flat grid of 64 golden squares arranged in 8 rows and 8 columns, representing the 8 by 8 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_47",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Among Us character blocks. The cube is shaded with different tones of red and cyan to show its three-dimensional structure, with 5 cubes along each edge, forming a 5 by 5 by 5 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_47",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_47_A",
      "Gr8_39_1_47_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 27 red and cyan squares",
      "This image displays a flat grid of 25 red and cyan squares arranged in 5 rows and 5 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_47_step_1",
        "The image shows a large red and cyan cube made up of smaller unit cubes styled as Among Us character blocks. The cube is arranged in a 5 by 5 by 5 structure, with each face consisting of 25 visible unit squares. The side face is highlighted with a black border, showing the 5 by 5 arrangement of 25 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_47_step_2",
        "This image displays a flat grid of 25 red and cyan squares arranged in 5 rows and 5 columns, representing the 5 by 5 face of the cube that is visible from the side."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_48",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is shaded with different tones of blue and white to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_48",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_48_A",
      "Gr8_39_1_48_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 8 blue and white squares",
      "This image displays a flat grid of 4 blue and white squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_48_step_1",
        "The image shows a large blue and white cube made up of smaller unit cubes styled as Pokemon storage boxes. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The front face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_48_step_2",
        "This image displays a flat grid of 4 blue and white squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the back, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_49",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is shaded with different tones of wood and stone textures to show its three-dimensional structure, with 6 cubes along each edge, forming a 6 by 6 by 6 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_49",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_49_A",
      "Gr8_39_1_49_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 32 wood and stone textures squares",
      "This image displays a flat grid of 36 wood and stone textures squares arranged in 6 rows and 6 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the back. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the back, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_49_step_1",
        "The image shows a large wood and stone textures cube made up of smaller unit cubes styled as Fortnite building blocks. The cube is arranged in a 6 by 6 by 6 structure, with each face consisting of 36 visible unit squares. The back face is highlighted with a black border, showing the 6 by 6 arrangement of 36 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_49_step_2",
        "This image displays a flat grid of 36 wood and stone textures squares arranged in 6 rows and 6 columns, representing the 6 by 6 face of the cube that is visible from the back."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the front, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_50",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as LEGO bricks. The cube is shaded with different tones of red and yellow to show its three-dimensional structure, with 2 cubes along each edge, forming a 2 by 2 by 2 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_50",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_50_A",
      "Gr8_39_1_50_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 2 red and yellow squares",
      "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns"
    ],
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the front. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the front, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_50_step_1",
        "The image shows a large red and yellow cube made up of smaller unit cubes styled as LEGO bricks. The cube is arranged in a 2 by 2 by 2 structure, with each face consisting of 4 visible unit squares. The front face is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_50_step_2",
        "This image displays a flat grid of 4 red and yellow squares arranged in 2 rows and 2 columns, representing the 2 by 2 face of the cube that is visible from the front."
      ]
    ]
  },
  {
    "question_text": "If you look at this object from the left side, what will you see?",
    "skills": "front-side-and-top-view",
    "image_tag": "Gr8_39_1_51",
    "backend_description": "The image shows a large cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is shaded with different tones of multicolored to show its three-dimensional structure, with 9 cubes along each edge, forming a 9 by 9 by 9 cube.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "1_51",
    "tag": "Gr8_39_E1",
    "image_choice_tags": [
      "Gr8_39_1_51_A",
      "Gr8_39_1_51_B"
    ],
    "image_choice_tags_backend_description": [
      "This image displays a flat grid of 81 multicolored squares arranged in 9 rows and 9 columns",
      "This image displays a flat grid of 84 multicolored squares"
    ],
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/2",
        "Imagine you are looking at this object from the left side. You will see the squares highlighted below:"
      ],
      [
        "2/2",
        "If you look at this object from the left side, you will see:"
      ]
    ],
    "solution_image_tag": [
      [
        "1/2",
        "Gr8_39_1_51_step_1",
        "The image shows a large multicolored cube made up of smaller unit cubes styled as Rubik's cube pieces. The cube is arranged in a 9 by 9 by 9 structure, with each face consisting of 81 visible unit squares. The left side face is highlighted with a black border, showing the 9 by 9 arrangement of 81 visible unit squares."
      ],
      [
        "2/2",
        "Gr8_39_1_51_step_2",
        "This image displays a flat grid of 81 multicolored squares arranged in 9 rows and 9 columns, representing the 9 by 9 face of the cube that is visible from the left side."
      ]
    ]
  }
]