[
  {
    "question_text": "Mila is hosting a movie marathon over the weekend. There will be p people at the party altogether. Mila estimates she'll need one bag of cheese popcorn and one pack of gummy worms per person. A bag of cheese popcorn costs $2.50, and a pack of gummy worms costs $1.50.\n\nPick all the expressions that represent how much money Mila will spend on cheese popcorn and gummy worms.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "question_number": "3_1",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.50(p+1)+1.50(p+1)",
      "2.50p+1.50p",
      "4.00p",
      "p(2.50+1.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Mila will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Mila will spend on cheese popcorn to the amount she will spend on gummy worms."
      ],
      [
        "3/13",
        "Mila will spend 2.50p dollars on cheese popcorn.\nMultiply the cost of each bag of cheese popcorn, $2.50, by the number of people, p."
      ],
      [
        "4/13",
        "Mila will spend 1.50p dollars on gummy worms.\nMultiply the cost of each pack of gummy worms, $1.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.50p+1.50p is one way to find how much money Mila will spend on cheese popcorn and gummy worms."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bag of cheese popcorn and a pack of gummy worms by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bag of cheese popcorn and a pack of gummy worms is $4.00.\nAdd the cost of a bag of cheese popcorn, $2.50, to the cost of a pack of gummy worms, $1.50."
      ],
      [
        "8/13",
        "There will be p people at the party."
      ],
      [
        "9/13",
        "So, 4.00p is one way to find how much money Mila will spend on cheese popcorn and gummy worms."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bag of cheese popcorn to the cost of a pack of gummy worms. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bag of cheese popcorn costs $2.50.\nA pack of gummy worms costs $1.50.\nThere will be p people at the party."
      ],
      [
        "12/13",
        "So, p(2.50+1.50) is one way to find how much money Mila will spend on cheese popcorn and gummy worms."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.50p+1.50p\n4.00p\np(2.50+1.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "question_text": "Ms. Jones runs the school cafeteria. In October, she had to order 15 cases of chocolate milk twice because the students at her school love it so much. Each case contains c cartons of chocolate milk.\n\nPick all the expressions that represent how many cartons of chocolate milk Ms. Jones ordered in October.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "question_number": "3_2",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+15c",
      "2(15c)",
      "30c",
      "c(2+15)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many cartons of chocolate milk Ms. Jones ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Jones ordered chocolate milk by how many cartons of chocolate milk are in each order."
      ],
      [
        "3/10",
        "Ms. Jones ordered chocolate milk twice, or 2 times."
      ],
      [
        "4/10",
        "There are 15c cartons of chocolate milk in each order. Multiply how many cases Ms. Jones ordered each time, 15, by how many cartons of chocolate milk are in each case, c."
      ],
      [
        "5/10",
        "So, 2(15c) is one way to find how many cartons of chocolate milk Ms. Jones ordered in October."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many cases Ms. Jones ordered in October by how many cartons of chocolate milk are in each case."
      ],
      [
        "7/10",
        "Ms. Jones ordered 30 cases in October. Multiply the number of cases in each order, 15, by how many times she ordered chocolate milk in October, 2."
      ],
      [
        "8/10",
        "There are c cartons of chocolate milk in each case."
      ],
      [
        "9/10",
        "So, 30c is one way to find how many cartons of chocolate milk Ms. Jones ordered in October."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(15c)\n30c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": []
  },
  {
    "question_text": "Alex is organizing a gaming tournament this weekend. There will be p people attending altogether. Alex estimates they'll need one can of energy drink and one bag of bag of chips per person. A can of energy drink costs $3.00, and a bag of bag of chips costs $2.00.\n\nPick all the expressions that represent how much money Alex will spend on energy drinks and bag of chipss.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.00(p+1)+2.00(p+1)",
      "3.00p+2.00p",
      "5.00p",
      "p(3.00+2.00)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Alex will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Alex will spend on energy drinks to the amount they will spend on bag of chipss."
      ],
      [
        "3/13",
        "Alex will spend 3.00p dollars on energy drinks.\nMultiply the cost of each can of energy drink, $3.00, by the number of people, p."
      ],
      [
        "4/13",
        "Alex will spend 2.00p dollars on bag of chipss.\nMultiply the cost of each bag of bag of chips, $2.00, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.00p+2.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a can of energy drink and a bag of bag of chips by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a can of energy drink and a bag of bag of chips is $5.00.\nAdd the cost of a can of energy drink, $3.00, to the cost of a bag of bag of chips, $2.00."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a can of energy drink to the cost of a bag of bag of chips. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A can of energy drink costs $3.00.\nA bag of bag of chips costs $2.00.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.00+2.00) is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.00p+2.00p\n5.00p\np(3.00+2.00)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_3"
  },
  {
    "question_text": "Ms. Garcia manages the school library. In September, they had to order 12 sets of manga series three times because the students love them so much. Each set contains c volumes.\n\nPick all the expressions that represent how many volumes Ms. Garcia ordered in September.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+12c",
      "3(12c)",
      "36c",
      "c(3+12)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many volumes Ms. Garcia ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Garcia ordered manga series by how many volumes are in each order."
      ],
      [
        "3/10",
        "Ms. Garcia ordered manga series three times, or 3 times."
      ],
      [
        "4/10",
        "There are 12c volumes in each order. Multiply how many sets Ms. Garcia ordered each time, 12, by how many volumes are in each set, c."
      ],
      [
        "5/10",
        "So, 3(12c) is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many sets Ms. Garcia ordered in September by how many volumes are in each set."
      ],
      [
        "7/10",
        "Ms. Garcia ordered 36 sets in September. Multiply the number of sets in each order, 12, by how many times they ordered manga series in September, 3."
      ],
      [
        "8/10",
        "There are c volumes in each set."
      ],
      [
        "9/10",
        "So, 36c is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(12c)\n36c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_4"
  },
  {
    "question_text": "Sofia is organizing a birthday party on Saturday. There will be p people attending altogether. Sofia estimates they'll need one slice of slice of pizza and one cupcake of cupcake per person. A slice of slice of pizza costs $2.75, and a cupcake of cupcake costs $1.75.\n\nPick all the expressions that represent how much money Sofia will spend on slice of pizzas and cupcakes.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.75(p+1)+1.75(p+1)",
      "2.75p+1.75p",
      "4.50p",
      "p(2.75+1.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Sofia will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Sofia will spend on slice of pizzas to the amount they will spend on cupcakes."
      ],
      [
        "3/13",
        "Sofia will spend 2.75p dollars on slice of pizzas.\nMultiply the cost of each slice of slice of pizza, $2.75, by the number of people, p."
      ],
      [
        "4/13",
        "Sofia will spend 1.75p dollars on cupcakes.\nMultiply the cost of each cupcake of cupcake, $1.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.75p+1.75p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a slice of slice of pizza and a cupcake of cupcake by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a slice of slice of pizza and a cupcake of cupcake is $4.50.\nAdd the cost of a slice of slice of pizza, $2.75, to the cost of a cupcake of cupcake, $1.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 4.50p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a slice of slice of pizza to the cost of a cupcake of cupcake. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A slice of slice of pizza costs $2.75.\nA cupcake of cupcake costs $1.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.75+1.75) is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.75p+1.75p\n4.50p\np(2.75+1.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_5"
  },
  {
    "question_text": "Mr. Tech manages the computer lab. In January, they had to order 20 packs of USB drives twice due to high demand. Each pack contains c drives.\n\nPick all the expressions that represent how many drives Mr. Tech ordered in January.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+20c",
      "2(20c)",
      "40c",
      "c(2+20)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many drives Mr. Tech ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mr. Tech ordered USB drives by how many drives are in each order."
      ],
      [
        "3/10",
        "Mr. Tech ordered USB drives twice, or 2 times."
      ],
      [
        "4/10",
        "There are 20c drives in each order. Multiply how many packs Mr. Tech ordered each time, 20, by how many drives are in each pack, c."
      ],
      [
        "5/10",
        "So, 2(20c) is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many packs Mr. Tech ordered in January by how many drives are in each pack."
      ],
      [
        "7/10",
        "Mr. Tech ordered 40 packs in January. Multiply the number of packs in each order, 20, by how many times they ordered USB drives in January, 2."
      ],
      [
        "8/10",
        "There are c drives in each pack."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(20c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_6"
  },
  {
    "question_text": "Marcus is organizing a study group session tomorrow. There will be p people attending altogether. Marcus estimates they'll need one bottle of bottle of water and one bar of granola bar per person. A bottle of bottle of water costs $3.50, and a bar of granola bar costs $1.50.\n\nPick all the expressions that represent how much money Marcus will spend on bottle of waters and granola bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.50(p+1)+1.50(p+1)",
      "3.50p+1.50p",
      "5.00p",
      "p(3.50+1.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Marcus will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Marcus will spend on bottle of waters to the amount they will spend on granola bars."
      ],
      [
        "3/13",
        "Marcus will spend 3.50p dollars on bottle of waters.\nMultiply the cost of each bottle of bottle of water, $3.50, by the number of people, p."
      ],
      [
        "4/13",
        "Marcus will spend 1.50p dollars on granola bars.\nMultiply the cost of each bar of granola bar, $1.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.50p+1.50p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of water and a bar of granola bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of water and a bar of granola bar is $5.00.\nAdd the cost of a bottle of bottle of water, $3.50, to the cost of a bar of granola bar, $1.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of water to the cost of a bar of granola bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of water costs $3.50.\nA bar of granola bar costs $1.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.50+1.50) is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.50p+1.50p\n5.00p\np(3.50+1.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_7"
  },
  {
    "question_text": "Professor Lee manages the art studio. In March, they had to order 18 bundles of paint brushes three times because they kept running out. Each bundle contains c brushes.\n\nPick all the expressions that represent how many brushes Professor Lee ordered in March.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+18c",
      "3(18c)",
      "54c",
      "c(3+18)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many brushes Professor Lee ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Professor Lee ordered paint brushes by how many brushes are in each order."
      ],
      [
        "3/10",
        "Professor Lee ordered paint brushes three times, or 3 times."
      ],
      [
        "4/10",
        "There are 18c brushes in each order. Multiply how many bundles Professor Lee ordered each time, 18, by how many brushes are in each bundle, c."
      ],
      [
        "5/10",
        "So, 3(18c) is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many bundles Professor Lee ordered in March by how many brushes are in each bundle."
      ],
      [
        "7/10",
        "Professor Lee ordered 54 bundles in March. Multiply the number of bundles in each order, 18, by how many times they ordered paint brushes in March, 3."
      ],
      [
        "8/10",
        "There are c brushes in each bundle."
      ],
      [
        "9/10",
        "So, 54c is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(18c)\n54c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_8"
  },
  {
    "question_text": "Coach Chen is organizing a team victory celebration. There will be p people attending altogether. Coach Chen estimates they'll need one bottle of sports drink and one bar of protein bar per person. A bottle of sports drink costs $2.25, and a bar of protein bar costs $2.75.\n\nPick all the expressions that represent how much money Coach Chen will spend on sports drinks and protein bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.25(p+1)+2.75(p+1)",
      "2.25p+2.75p",
      "5.00p",
      "p(2.25+2.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Coach Chen will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Coach Chen will spend on sports drinks to the amount they will spend on protein bars."
      ],
      [
        "3/13",
        "Coach Chen will spend 2.25p dollars on sports drinks.\nMultiply the cost of each bottle of sports drink, $2.25, by the number of people, p."
      ],
      [
        "4/13",
        "Coach Chen will spend 2.75p dollars on protein bars.\nMultiply the cost of each bar of protein bar, $2.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.25p+2.75p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of sports drink and a bar of protein bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of sports drink and a bar of protein bar is $5.00.\nAdd the cost of a bottle of sports drink, $2.25, to the cost of a bar of protein bar, $2.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of sports drink to the cost of a bar of protein bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of sports drink costs $2.25.\nA bar of protein bar costs $2.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.25+2.75) is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.25p+2.75p\n5.00p\np(2.25+2.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_9"
  },
  {
    "question_text": "Coach Williams manages the school gym. In February, they had to order 25 crates of basketballs twice to meet student requests. Each crate contains c balls.\n\nPick all the expressions that represent how many balls Coach Williams ordered in February.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+25c",
      "2(25c)",
      "50c",
      "c(2+25)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many balls Coach Williams ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Coach Williams ordered basketballs by how many balls are in each order."
      ],
      [
        "3/10",
        "Coach Williams ordered basketballs twice, or 2 times."
      ],
      [
        "4/10",
        "There are 25c balls in each order. Multiply how many crates Coach Williams ordered each time, 25, by how many balls are in each crate, c."
      ],
      [
        "5/10",
        "So, 2(25c) is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many crates Coach Williams ordered in February by how many balls are in each crate."
      ],
      [
        "7/10",
        "Coach Williams ordered 50 crates in February. Multiply the number of crates in each order, 25, by how many times they ordered basketballs in February, 2."
      ],
      [
        "8/10",
        "There are c balls in each crate."
      ],
      [
        "9/10",
        "So, 50c is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(25c)\n50c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_10"
  },
  {
    "question_text": "Emma is organizing a art club exhibition opening. There will be p people attending altogether. Emma estimates they'll need one cup of cup of coffee and one cookie of cookie per person. A cup of cup of coffee costs $3.25, and a cookie of cookie costs $2.25.\n\nPick all the expressions that represent how much money Emma will spend on cup of coffees and cookies.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.25(p+1)+2.25(p+1)",
      "3.25p+2.25p",
      "5.50p",
      "p(3.25+2.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Emma will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Emma will spend on cup of coffees to the amount they will spend on cookies."
      ],
      [
        "3/13",
        "Emma will spend 3.25p dollars on cup of coffees.\nMultiply the cost of each cup of cup of coffee, $3.25, by the number of people, p."
      ],
      [
        "4/13",
        "Emma will spend 2.25p dollars on cookies.\nMultiply the cost of each cookie of cookie, $2.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.25p+2.25p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of cup of coffee and a cookie of cookie by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of cup of coffee and a cookie of cookie is $5.50.\nAdd the cost of a cup of cup of coffee, $3.25, to the cost of a cookie of cookie, $2.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.50p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of cup of coffee to the cost of a cookie of cookie. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of cup of coffee costs $3.25.\nA cookie of cookie costs $2.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.25+2.25) is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.25p+2.25p\n5.50p\np(3.25+2.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_11"
  },
  {
    "question_text": "Mrs. Song manages the music room. In April, they had to order 10 packages of guitar strings four times because of their popularity. Each package contains c sets of strings.\n\nPick all the expressions that represent how many sets of strings Mrs. Song ordered in April.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "4c+10c",
      "4(10c)",
      "40c",
      "c(4+10)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many sets of strings Mrs. Song ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mrs. Song ordered guitar strings by how many sets of strings are in each order."
      ],
      [
        "3/10",
        "Mrs. Song ordered guitar strings four times, or 4 times."
      ],
      [
        "4/10",
        "There are 10c sets of strings in each order. Multiply how many packages Mrs. Song ordered each time, 10, by how many sets of strings are in each package, c."
      ],
      [
        "5/10",
        "So, 4(10c) is one way to find how many sets of strings Mrs. Song ordered in April."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many packages Mrs. Song ordered in April by how many sets of strings are in each package."
      ],
      [
        "7/10",
        "Mrs. Song ordered 40 packages in April. Multiply the number of packages in each order, 10, by how many times they ordered guitar strings in April, 4."
      ],
      [
        "8/10",
        "There are c sets of strings in each package."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many sets of strings Mrs. Song ordered in April."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n4(10c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_12"
  },
  {
    "question_text": "Jamal is organizing a book club meeting. There will be p people attending altogether. Jamal estimates they'll need one cup of cup of tea and one sandwich of sandwich per person. A cup of cup of tea costs $2.50, and a sandwich of sandwich costs $2.50.\n\nPick all the expressions that represent how much money Jamal will spend on cup of teas and sandwichs.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.50(p+1)+2.50(p+1)",
      "2.50p+2.50p",
      "5.00p",
      "p(2.50+2.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Jamal will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Jamal will spend on cup of teas to the amount they will spend on sandwichs."
      ],
      [
        "3/13",
        "Jamal will spend 2.50p dollars on cup of teas.\nMultiply the cost of each cup of cup of tea, $2.50, by the number of people, p."
      ],
      [
        "4/13",
        "Jamal will spend 2.50p dollars on sandwichs.\nMultiply the cost of each sandwich of sandwich, $2.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.50p+2.50p is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of cup of tea and a sandwich of sandwich by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of cup of tea and a sandwich of sandwich is $5.00.\nAdd the cost of a cup of cup of tea, $2.50, to the cost of a sandwich of sandwich, $2.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of cup of tea to the cost of a sandwich of sandwich. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of cup of tea costs $2.50.\nA sandwich of sandwich costs $2.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.50+2.50) is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.50p+2.50p\n5.00p\np(2.50+2.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_13"
  },
  {
    "question_text": "Dr. Martinez manages the chemistry lab. In November, they had to order 16 boxes of test tubes three times due to increased usage. Each box contains c tubes.\n\nPick all the expressions that represent how many tubes Dr. Martinez ordered in November.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+16c",
      "3(16c)",
      "48c",
      "c(3+16)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many tubes Dr. Martinez ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Dr. Martinez ordered test tubes by how many tubes are in each order."
      ],
      [
        "3/10",
        "Dr. Martinez ordered test tubes three times, or 3 times."
      ],
      [
        "4/10",
        "There are 16c tubes in each order. Multiply how many boxes Dr. Martinez ordered each time, 16, by how many tubes are in each box, c."
      ],
      [
        "5/10",
        "So, 3(16c) is one way to find how many tubes Dr. Martinez ordered in November."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many boxes Dr. Martinez ordered in November by how many tubes are in each box."
      ],
      [
        "7/10",
        "Dr. Martinez ordered 48 boxes in November. Multiply the number of boxes in each order, 16, by how many times they ordered test tubes in November, 3."
      ],
      [
        "8/10",
        "There are c tubes in each box."
      ],
      [
        "9/10",
        "So, 48c is one way to find how many tubes Dr. Martinez ordered in November."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(16c)\n48c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_14"
  },
  {
    "question_text": "Ranger Kim is organizing a scout camping trip. There will be p people attending altogether. Ranger Kim estimates they'll need one bottle of bottle of juice and one pack of trail mix pack per person. A bottle of bottle of juice costs $3.75, and a pack of trail mix pack costs $1.25.\n\nPick all the expressions that represent how much money Ranger Kim will spend on bottle of juices and trail mix packs.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.75(p+1)+1.25(p+1)",
      "3.75p+1.25p",
      "5.00p",
      "p(3.75+1.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Ranger Kim will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Ranger Kim will spend on bottle of juices to the amount they will spend on trail mix packs."
      ],
      [
        "3/13",
        "Ranger Kim will spend 3.75p dollars on bottle of juices.\nMultiply the cost of each bottle of bottle of juice, $3.75, by the number of people, p."
      ],
      [
        "4/13",
        "Ranger Kim will spend 1.25p dollars on trail mix packs.\nMultiply the cost of each pack of trail mix pack, $1.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.75p+1.25p is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of juice and a pack of trail mix pack by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of juice and a pack of trail mix pack is $5.00.\nAdd the cost of a bottle of bottle of juice, $3.75, to the cost of a pack of trail mix pack, $1.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of juice to the cost of a pack of trail mix pack. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of juice costs $3.75.\nA pack of trail mix pack costs $1.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.75+1.25) is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.75p+1.25p\n5.00p\np(3.75+1.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_15"
  },
  {
    "question_text": "Director Brown manages the school theater. In May, they had to order 24 shipments of stage lights twice to ensure adequate supply. Each shipment contains c lights.\n\nPick all the expressions that represent how many lights Director Brown ordered in May.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+24c",
      "2(24c)",
      "48c",
      "c(2+24)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many lights Director Brown ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Director Brown ordered stage lights by how many lights are in each order."
      ],
      [
        "3/10",
        "Director Brown ordered stage lights twice, or 2 times."
      ],
      [
        "4/10",
        "There are 24c lights in each order. Multiply how many shipments Director Brown ordered each time, 24, by how many lights are in each shipment, c."
      ],
      [
        "5/10",
        "So, 2(24c) is one way to find how many lights Director Brown ordered in May."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many shipments Director Brown ordered in May by how many lights are in each shipment."
      ],
      [
        "7/10",
        "Director Brown ordered 48 shipments in May. Multiply the number of shipments in each order, 24, by how many times they ordered stage lights in May, 2."
      ],
      [
        "8/10",
        "There are c lights in each shipment."
      ],
      [
        "9/10",
        "So, 48c is one way to find how many lights Director Brown ordered in May."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(24c)\n48c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_16"
  },
  {
    "question_text": "DJ Maya is organizing a outdoor concert. There will be p people attending altogether. DJ Maya estimates they'll need one bottle of bottle of soda and one pretzel of pretzel per person. A bottle of bottle of soda costs $2.00, and a pretzel of pretzel costs $3.50.\n\nPick all the expressions that represent how much money DJ Maya will spend on bottle of sodas and pretzels.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.00(p+1)+3.50(p+1)",
      "2.00p+3.50p",
      "5.50p",
      "p(2.00+3.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money DJ Maya will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount DJ Maya will spend on bottle of sodas to the amount they will spend on pretzels."
      ],
      [
        "3/13",
        "DJ Maya will spend 2.00p dollars on bottle of sodas.\nMultiply the cost of each bottle of bottle of soda, $2.00, by the number of people, p."
      ],
      [
        "4/13",
        "DJ Maya will spend 3.50p dollars on pretzels.\nMultiply the cost of each pretzel of pretzel, $3.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.00p+3.50p is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of soda and a pretzel of pretzel by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of soda and a pretzel of pretzel is $5.50.\nAdd the cost of a bottle of bottle of soda, $2.00, to the cost of a pretzel of pretzel, $3.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.50p is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of soda to the cost of a pretzel of pretzel. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of soda costs $2.00.\nA pretzel of pretzel costs $3.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.00+3.50) is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.00p+3.50p\n5.50p\np(2.00+3.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_17"
  },
  {
    "question_text": "Mr. Circuit manages the robotics workshop. In December, they had to order 8 kits of servo motors 5 times because of frequent use. Each kit contains c motors.\n\nPick all the expressions that represent how many motors Mr. Circuit ordered in December.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "5c+8c",
      "5(8c)",
      "40c",
      "c(5+8)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many motors Mr. Circuit ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mr. Circuit ordered servo motors by how many motors are in each order."
      ],
      [
        "3/10",
        "Mr. Circuit ordered servo motors 5 times, or 5 times."
      ],
      [
        "4/10",
        "There are 8c motors in each order. Multiply how many kits Mr. Circuit ordered each time, 8, by how many motors are in each kit, c."
      ],
      [
        "5/10",
        "So, 5(8c) is one way to find how many motors Mr. Circuit ordered in December."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many kits Mr. Circuit ordered in December by how many motors are in each kit."
      ],
      [
        "7/10",
        "Mr. Circuit ordered 40 kits in December. Multiply the number of kits in each order, 8, by how many times they ordered servo motors in December, 5."
      ],
      [
        "8/10",
        "There are c motors in each kit."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many motors Mr. Circuit ordered in December."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n5(8c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_18"
  },
  {
    "question_text": "Dr. Peterson is organizing a science fair awards ceremony. There will be p people attending altogether. Dr. Peterson estimates they'll need one box of juice box and one muffin of muffin per person. A box of juice box costs $4.00, and a muffin of muffin costs $1.00.\n\nPick all the expressions that represent how much money Dr. Peterson will spend on juice boxes and muffins.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "4.00(p+1)+1.00(p+1)",
      "4.00p+1.00p",
      "5.00p",
      "p(4.00+1.00)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Dr. Peterson will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Dr. Peterson will spend on juice boxes to the amount they will spend on muffins."
      ],
      [
        "3/13",
        "Dr. Peterson will spend 4.00p dollars on juice boxes.\nMultiply the cost of each box of juice box, $4.00, by the number of people, p."
      ],
      [
        "4/13",
        "Dr. Peterson will spend 1.00p dollars on muffins.\nMultiply the cost of each muffin of muffin, $1.00, by the number of people, p."
      ],
      [
        "5/13",
        "So, 4.00p+1.00p is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a box of juice box and a muffin of muffin by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a box of juice box and a muffin of muffin is $5.00.\nAdd the cost of a box of juice box, $4.00, to the cost of a muffin of muffin, $1.00."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a box of juice box to the cost of a muffin of muffin. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A box of juice box costs $4.00.\nA muffin of muffin costs $1.00.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(4.00+1.00) is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n4.00p+1.00p\n5.00p\np(4.00+1.00)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_19"
  },
  {
    "question_text": "Ms. Green manages the school greenhouse. In June, they had to order 14 collections of seed packets three times to accommodate all students. Each collection contains c packets.\n\nPick all the expressions that represent how many packets Ms. Green ordered in June.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+14c",
      "3(14c)",
      "42c",
      "c(3+14)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many packets Ms. Green ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Green ordered seed packets by how many packets are in each order."
      ],
      [
        "3/10",
        "Ms. Green ordered seed packets three times, or 3 times."
      ],
      [
        "4/10",
        "There are 14c packets in each order. Multiply how many collections Ms. Green ordered each time, 14, by how many packets are in each collection, c."
      ],
      [
        "5/10",
        "So, 3(14c) is one way to find how many packets Ms. Green ordered in June."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many collections Ms. Green ordered in June by how many packets are in each collection."
      ],
      [
        "7/10",
        "Ms. Green ordered 42 collections in June. Multiply the number of collections in each order, 14, by how many times they ordered seed packets in June, 3."
      ],
      [
        "8/10",
        "There are c packets in each collection."
      ],
      [
        "9/10",
        "So, 42c is one way to find how many packets Ms. Green ordered in June."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(14c)\n42c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_20"
  },
  {
    "question_text": "Yuki is organizing a anime convention meetup. There will be p people attending altogether. Yuki estimates they'll need one cup of boba tea and one rice ball of rice ball per person. A cup of boba tea costs $1.75, and a rice ball of rice ball costs $3.25.\n\nPick all the expressions that represent how much money Yuki will spend on boba teas and rice balls.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "1.75(p+1)+3.25(p+1)",
      "1.75p+3.25p",
      "5.00p",
      "p(1.75+3.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Yuki will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Yuki will spend on boba teas to the amount they will spend on rice balls."
      ],
      [
        "3/13",
        "Yuki will spend 1.75p dollars on boba teas.\nMultiply the cost of each cup of boba tea, $1.75, by the number of people, p."
      ],
      [
        "4/13",
        "Yuki will spend 3.25p dollars on rice balls.\nMultiply the cost of each rice ball of rice ball, $3.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 1.75p+3.25p is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of boba tea and a rice ball of rice ball by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of boba tea and a rice ball of rice ball is $5.00.\nAdd the cost of a cup of boba tea, $1.75, to the cost of a rice ball of rice ball, $3.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of boba tea to the cost of a rice ball of rice ball. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of boba tea costs $1.75.\nA rice ball of rice ball costs $3.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(1.75+3.25) is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n1.75p+3.25p\n5.00p\np(1.75+3.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_21"
  },
  {
    "question_text": "Coach Pixel manages the gaming arena. In August, they had to order 22 boxes of gaming mice twice due to overwhelming interest. Each box contains c mice.\n\nPick all the expressions that represent how many mice Coach Pixel ordered in August.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+22c",
      "2(22c)",
      "44c",
      "c(2+22)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many mice Coach Pixel ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Coach Pixel ordered gaming mice by how many mice are in each order."
      ],
      [
        "3/10",
        "Coach Pixel ordered gaming mice twice, or 2 times."
      ],
      [
        "4/10",
        "There are 22c mice in each order. Multiply how many boxes Coach Pixel ordered each time, 22, by how many mice are in each box, c."
      ],
      [
        "5/10",
        "So, 2(22c) is one way to find how many mice Coach Pixel ordered in August."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many boxes Coach Pixel ordered in August by how many mice are in each box."
      ],
      [
        "7/10",
        "Coach Pixel ordered 44 boxes in August. Multiply the number of boxes in each order, 22, by how many times they ordered gaming mice in August, 2."
      ],
      [
        "8/10",
        "There are c mice in each box."
      ],
      [
        "9/10",
        "So, 44c is one way to find how many mice Coach Pixel ordered in August."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(22c)\n44c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_22"
  },
  {
    "question_text": "Alex is organizing a gaming tournament this weekend. There will be p people attending altogether. Alex estimates they'll need one can of energy drink and one bag of bag of chips per person. A can of energy drink costs $3.00, and a bag of bag of chips costs $2.00.\n\nPick all the expressions that represent how much money Alex will spend on energy drinks and bag of chipss.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.00(p+1)+2.00(p+1)",
      "3.00p+2.00p",
      "5.00p",
      "p(3.00+2.00)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Alex will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Alex will spend on energy drinks to the amount they will spend on bag of chipss."
      ],
      [
        "3/13",
        "Alex will spend 3.00p dollars on energy drinks.\nMultiply the cost of each can of energy drink, $3.00, by the number of people, p."
      ],
      [
        "4/13",
        "Alex will spend 2.00p dollars on bag of chipss.\nMultiply the cost of each bag of bag of chips, $2.00, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.00p+2.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a can of energy drink and a bag of bag of chips by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a can of energy drink and a bag of bag of chips is $5.00.\nAdd the cost of a can of energy drink, $3.00, to the cost of a bag of bag of chips, $2.00."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a can of energy drink to the cost of a bag of bag of chips. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A can of energy drink costs $3.00.\nA bag of bag of chips costs $2.00.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.00+2.00) is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.00p+2.00p\n5.00p\np(3.00+2.00)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_23"
  },
  {
    "question_text": "Ms. Garcia manages the school library. In September, they had to order 12 sets of manga series three times because the students love them so much. Each set contains c volumes.\n\nPick all the expressions that represent how many volumes Ms. Garcia ordered in September.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+12c",
      "3(12c)",
      "36c",
      "c(3+12)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many volumes Ms. Garcia ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Garcia ordered manga series by how many volumes are in each order."
      ],
      [
        "3/10",
        "Ms. Garcia ordered manga series three times, or 3 times."
      ],
      [
        "4/10",
        "There are 12c volumes in each order. Multiply how many sets Ms. Garcia ordered each time, 12, by how many volumes are in each set, c."
      ],
      [
        "5/10",
        "So, 3(12c) is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many sets Ms. Garcia ordered in September by how many volumes are in each set."
      ],
      [
        "7/10",
        "Ms. Garcia ordered 36 sets in September. Multiply the number of sets in each order, 12, by how many times they ordered manga series in September, 3."
      ],
      [
        "8/10",
        "There are c volumes in each set."
      ],
      [
        "9/10",
        "So, 36c is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(12c)\n36c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_24"
  },
  {
    "question_text": "Sofia is organizing a birthday party on Saturday. There will be p people attending altogether. Sofia estimates they'll need one slice of slice of pizza and one cupcake of cupcake per person. A slice of slice of pizza costs $2.75, and a cupcake of cupcake costs $1.75.\n\nPick all the expressions that represent how much money Sofia will spend on slice of pizzas and cupcakes.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.75(p+1)+1.75(p+1)",
      "2.75p+1.75p",
      "4.50p",
      "p(2.75+1.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Sofia will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Sofia will spend on slice of pizzas to the amount they will spend on cupcakes."
      ],
      [
        "3/13",
        "Sofia will spend 2.75p dollars on slice of pizzas.\nMultiply the cost of each slice of slice of pizza, $2.75, by the number of people, p."
      ],
      [
        "4/13",
        "Sofia will spend 1.75p dollars on cupcakes.\nMultiply the cost of each cupcake of cupcake, $1.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.75p+1.75p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a slice of slice of pizza and a cupcake of cupcake by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a slice of slice of pizza and a cupcake of cupcake is $4.50.\nAdd the cost of a slice of slice of pizza, $2.75, to the cost of a cupcake of cupcake, $1.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 4.50p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a slice of slice of pizza to the cost of a cupcake of cupcake. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A slice of slice of pizza costs $2.75.\nA cupcake of cupcake costs $1.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.75+1.75) is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.75p+1.75p\n4.50p\np(2.75+1.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_25"
  },
  {
    "question_text": "Mr. Tech manages the computer lab. In January, they had to order 20 packs of USB drives twice due to high demand. Each pack contains c drives.\n\nPick all the expressions that represent how many drives Mr. Tech ordered in January.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+20c",
      "2(20c)",
      "40c",
      "c(2+20)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many drives Mr. Tech ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mr. Tech ordered USB drives by how many drives are in each order."
      ],
      [
        "3/10",
        "Mr. Tech ordered USB drives twice, or 2 times."
      ],
      [
        "4/10",
        "There are 20c drives in each order. Multiply how many packs Mr. Tech ordered each time, 20, by how many drives are in each pack, c."
      ],
      [
        "5/10",
        "So, 2(20c) is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many packs Mr. Tech ordered in January by how many drives are in each pack."
      ],
      [
        "7/10",
        "Mr. Tech ordered 40 packs in January. Multiply the number of packs in each order, 20, by how many times they ordered USB drives in January, 2."
      ],
      [
        "8/10",
        "There are c drives in each pack."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(20c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_26"
  },
  {
    "question_text": "Marcus is organizing a study group session tomorrow. There will be p people attending altogether. Marcus estimates they'll need one bottle of bottle of water and one bar of granola bar per person. A bottle of bottle of water costs $3.50, and a bar of granola bar costs $1.50.\n\nPick all the expressions that represent how much money Marcus will spend on bottle of waters and granola bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.50(p+1)+1.50(p+1)",
      "3.50p+1.50p",
      "5.00p",
      "p(3.50+1.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Marcus will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Marcus will spend on bottle of waters to the amount they will spend on granola bars."
      ],
      [
        "3/13",
        "Marcus will spend 3.50p dollars on bottle of waters.\nMultiply the cost of each bottle of bottle of water, $3.50, by the number of people, p."
      ],
      [
        "4/13",
        "Marcus will spend 1.50p dollars on granola bars.\nMultiply the cost of each bar of granola bar, $1.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.50p+1.50p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of water and a bar of granola bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of water and a bar of granola bar is $5.00.\nAdd the cost of a bottle of bottle of water, $3.50, to the cost of a bar of granola bar, $1.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of water to the cost of a bar of granola bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of water costs $3.50.\nA bar of granola bar costs $1.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.50+1.50) is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.50p+1.50p\n5.00p\np(3.50+1.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_27"
  },
  {
    "question_text": "Professor Lee manages the art studio. In March, they had to order 18 bundles of paint brushes three times because they kept running out. Each bundle contains c brushes.\n\nPick all the expressions that represent how many brushes Professor Lee ordered in March.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+18c",
      "3(18c)",
      "54c",
      "c(3+18)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many brushes Professor Lee ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Professor Lee ordered paint brushes by how many brushes are in each order."
      ],
      [
        "3/10",
        "Professor Lee ordered paint brushes three times, or 3 times."
      ],
      [
        "4/10",
        "There are 18c brushes in each order. Multiply how many bundles Professor Lee ordered each time, 18, by how many brushes are in each bundle, c."
      ],
      [
        "5/10",
        "So, 3(18c) is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many bundles Professor Lee ordered in March by how many brushes are in each bundle."
      ],
      [
        "7/10",
        "Professor Lee ordered 54 bundles in March. Multiply the number of bundles in each order, 18, by how many times they ordered paint brushes in March, 3."
      ],
      [
        "8/10",
        "There are c brushes in each bundle."
      ],
      [
        "9/10",
        "So, 54c is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(18c)\n54c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_28"
  },
  {
    "question_text": "Coach Chen is organizing a team victory celebration. There will be p people attending altogether. Coach Chen estimates they'll need one bottle of sports drink and one bar of protein bar per person. A bottle of sports drink costs $2.25, and a bar of protein bar costs $2.75.\n\nPick all the expressions that represent how much money Coach Chen will spend on sports drinks and protein bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.25(p+1)+2.75(p+1)",
      "2.25p+2.75p",
      "5.00p",
      "p(2.25+2.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Coach Chen will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Coach Chen will spend on sports drinks to the amount they will spend on protein bars."
      ],
      [
        "3/13",
        "Coach Chen will spend 2.25p dollars on sports drinks.\nMultiply the cost of each bottle of sports drink, $2.25, by the number of people, p."
      ],
      [
        "4/13",
        "Coach Chen will spend 2.75p dollars on protein bars.\nMultiply the cost of each bar of protein bar, $2.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.25p+2.75p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of sports drink and a bar of protein bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of sports drink and a bar of protein bar is $5.00.\nAdd the cost of a bottle of sports drink, $2.25, to the cost of a bar of protein bar, $2.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of sports drink to the cost of a bar of protein bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of sports drink costs $2.25.\nA bar of protein bar costs $2.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.25+2.75) is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.25p+2.75p\n5.00p\np(2.25+2.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_29"
  },
  {
    "question_text": "Coach Williams manages the school gym. In February, they had to order 25 crates of basketballs twice to meet student requests. Each crate contains c balls.\n\nPick all the expressions that represent how many balls Coach Williams ordered in February.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+25c",
      "2(25c)",
      "50c",
      "c(2+25)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many balls Coach Williams ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Coach Williams ordered basketballs by how many balls are in each order."
      ],
      [
        "3/10",
        "Coach Williams ordered basketballs twice, or 2 times."
      ],
      [
        "4/10",
        "There are 25c balls in each order. Multiply how many crates Coach Williams ordered each time, 25, by how many balls are in each crate, c."
      ],
      [
        "5/10",
        "So, 2(25c) is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many crates Coach Williams ordered in February by how many balls are in each crate."
      ],
      [
        "7/10",
        "Coach Williams ordered 50 crates in February. Multiply the number of crates in each order, 25, by how many times they ordered basketballs in February, 2."
      ],
      [
        "8/10",
        "There are c balls in each crate."
      ],
      [
        "9/10",
        "So, 50c is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(25c)\n50c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_30"
  },
  {
    "question_text": "Emma is organizing a art club exhibition opening. There will be p people attending altogether. Emma estimates they'll need one cup of cup of coffee and one cookie of cookie per person. A cup of cup of coffee costs $3.25, and a cookie of cookie costs $2.25.\n\nPick all the expressions that represent how much money Emma will spend on cup of coffees and cookies.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.25(p+1)+2.25(p+1)",
      "3.25p+2.25p",
      "5.50p",
      "p(3.25+2.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Emma will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Emma will spend on cup of coffees to the amount they will spend on cookies."
      ],
      [
        "3/13",
        "Emma will spend 3.25p dollars on cup of coffees.\nMultiply the cost of each cup of cup of coffee, $3.25, by the number of people, p."
      ],
      [
        "4/13",
        "Emma will spend 2.25p dollars on cookies.\nMultiply the cost of each cookie of cookie, $2.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.25p+2.25p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of cup of coffee and a cookie of cookie by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of cup of coffee and a cookie of cookie is $5.50.\nAdd the cost of a cup of cup of coffee, $3.25, to the cost of a cookie of cookie, $2.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.50p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of cup of coffee to the cost of a cookie of cookie. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of cup of coffee costs $3.25.\nA cookie of cookie costs $2.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.25+2.25) is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.25p+2.25p\n5.50p\np(3.25+2.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_31"
  },
  {
    "question_text": "Mrs. Song manages the music room. In April, they had to order 10 packages of guitar strings four times because of their popularity. Each package contains c sets of strings.\n\nPick all the expressions that represent how many sets of strings Mrs. Song ordered in April.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "4c+10c",
      "4(10c)",
      "40c",
      "c(4+10)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many sets of strings Mrs. Song ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mrs. Song ordered guitar strings by how many sets of strings are in each order."
      ],
      [
        "3/10",
        "Mrs. Song ordered guitar strings four times, or 4 times."
      ],
      [
        "4/10",
        "There are 10c sets of strings in each order. Multiply how many packages Mrs. Song ordered each time, 10, by how many sets of strings are in each package, c."
      ],
      [
        "5/10",
        "So, 4(10c) is one way to find how many sets of strings Mrs. Song ordered in April."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many packages Mrs. Song ordered in April by how many sets of strings are in each package."
      ],
      [
        "7/10",
        "Mrs. Song ordered 40 packages in April. Multiply the number of packages in each order, 10, by how many times they ordered guitar strings in April, 4."
      ],
      [
        "8/10",
        "There are c sets of strings in each package."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many sets of strings Mrs. Song ordered in April."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n4(10c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_32"
  },
  {
    "question_text": "Jamal is organizing a book club meeting. There will be p people attending altogether. Jamal estimates they'll need one cup of cup of tea and one sandwich of sandwich per person. A cup of cup of tea costs $2.50, and a sandwich of sandwich costs $2.50.\n\nPick all the expressions that represent how much money Jamal will spend on cup of teas and sandwichs.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.50(p+1)+2.50(p+1)",
      "2.50p+2.50p",
      "5.00p",
      "p(2.50+2.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Jamal will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Jamal will spend on cup of teas to the amount they will spend on sandwichs."
      ],
      [
        "3/13",
        "Jamal will spend 2.50p dollars on cup of teas.\nMultiply the cost of each cup of cup of tea, $2.50, by the number of people, p."
      ],
      [
        "4/13",
        "Jamal will spend 2.50p dollars on sandwichs.\nMultiply the cost of each sandwich of sandwich, $2.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.50p+2.50p is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of cup of tea and a sandwich of sandwich by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of cup of tea and a sandwich of sandwich is $5.00.\nAdd the cost of a cup of cup of tea, $2.50, to the cost of a sandwich of sandwich, $2.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of cup of tea to the cost of a sandwich of sandwich. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of cup of tea costs $2.50.\nA sandwich of sandwich costs $2.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.50+2.50) is one way to find how much money Jamal will spend on cup of teas and sandwichs."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.50p+2.50p\n5.00p\np(2.50+2.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_33"
  },
  {
    "question_text": "Dr. Martinez manages the chemistry lab. In November, they had to order 16 boxes of test tubes three times due to increased usage. Each box contains c tubes.\n\nPick all the expressions that represent how many tubes Dr. Martinez ordered in November.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+16c",
      "3(16c)",
      "48c",
      "c(3+16)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many tubes Dr. Martinez ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Dr. Martinez ordered test tubes by how many tubes are in each order."
      ],
      [
        "3/10",
        "Dr. Martinez ordered test tubes three times, or 3 times."
      ],
      [
        "4/10",
        "There are 16c tubes in each order. Multiply how many boxes Dr. Martinez ordered each time, 16, by how many tubes are in each box, c."
      ],
      [
        "5/10",
        "So, 3(16c) is one way to find how many tubes Dr. Martinez ordered in November."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many boxes Dr. Martinez ordered in November by how many tubes are in each box."
      ],
      [
        "7/10",
        "Dr. Martinez ordered 48 boxes in November. Multiply the number of boxes in each order, 16, by how many times they ordered test tubes in November, 3."
      ],
      [
        "8/10",
        "There are c tubes in each box."
      ],
      [
        "9/10",
        "So, 48c is one way to find how many tubes Dr. Martinez ordered in November."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(16c)\n48c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_34"
  },
  {
    "question_text": "Ranger Kim is organizing a scout camping trip. There will be p people attending altogether. Ranger Kim estimates they'll need one bottle of bottle of juice and one pack of trail mix pack per person. A bottle of bottle of juice costs $3.75, and a pack of trail mix pack costs $1.25.\n\nPick all the expressions that represent how much money Ranger Kim will spend on bottle of juices and trail mix packs.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.75(p+1)+1.25(p+1)",
      "3.75p+1.25p",
      "5.00p",
      "p(3.75+1.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Ranger Kim will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Ranger Kim will spend on bottle of juices to the amount they will spend on trail mix packs."
      ],
      [
        "3/13",
        "Ranger Kim will spend 3.75p dollars on bottle of juices.\nMultiply the cost of each bottle of bottle of juice, $3.75, by the number of people, p."
      ],
      [
        "4/13",
        "Ranger Kim will spend 1.25p dollars on trail mix packs.\nMultiply the cost of each pack of trail mix pack, $1.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.75p+1.25p is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of juice and a pack of trail mix pack by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of juice and a pack of trail mix pack is $5.00.\nAdd the cost of a bottle of bottle of juice, $3.75, to the cost of a pack of trail mix pack, $1.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of juice to the cost of a pack of trail mix pack. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of juice costs $3.75.\nA pack of trail mix pack costs $1.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.75+1.25) is one way to find how much money Ranger Kim will spend on bottle of juices and trail mix packs."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.75p+1.25p\n5.00p\np(3.75+1.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_35"
  },
  {
    "question_text": "Director Brown manages the school theater. In May, they had to order 24 shipments of stage lights twice to ensure adequate supply. Each shipment contains c lights.\n\nPick all the expressions that represent how many lights Director Brown ordered in May.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+24c",
      "2(24c)",
      "48c",
      "c(2+24)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many lights Director Brown ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Director Brown ordered stage lights by how many lights are in each order."
      ],
      [
        "3/10",
        "Director Brown ordered stage lights twice, or 2 times."
      ],
      [
        "4/10",
        "There are 24c lights in each order. Multiply how many shipments Director Brown ordered each time, 24, by how many lights are in each shipment, c."
      ],
      [
        "5/10",
        "So, 2(24c) is one way to find how many lights Director Brown ordered in May."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many shipments Director Brown ordered in May by how many lights are in each shipment."
      ],
      [
        "7/10",
        "Director Brown ordered 48 shipments in May. Multiply the number of shipments in each order, 24, by how many times they ordered stage lights in May, 2."
      ],
      [
        "8/10",
        "There are c lights in each shipment."
      ],
      [
        "9/10",
        "So, 48c is one way to find how many lights Director Brown ordered in May."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(24c)\n48c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_36"
  },
  {
    "question_text": "DJ Maya is organizing a outdoor concert. There will be p people attending altogether. DJ Maya estimates they'll need one bottle of bottle of soda and one pretzel of pretzel per person. A bottle of bottle of soda costs $2.00, and a pretzel of pretzel costs $3.50.\n\nPick all the expressions that represent how much money DJ Maya will spend on bottle of sodas and pretzels.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.00(p+1)+3.50(p+1)",
      "2.00p+3.50p",
      "5.50p",
      "p(2.00+3.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money DJ Maya will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount DJ Maya will spend on bottle of sodas to the amount they will spend on pretzels."
      ],
      [
        "3/13",
        "DJ Maya will spend 2.00p dollars on bottle of sodas.\nMultiply the cost of each bottle of bottle of soda, $2.00, by the number of people, p."
      ],
      [
        "4/13",
        "DJ Maya will spend 3.50p dollars on pretzels.\nMultiply the cost of each pretzel of pretzel, $3.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.00p+3.50p is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of soda and a pretzel of pretzel by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of soda and a pretzel of pretzel is $5.50.\nAdd the cost of a bottle of bottle of soda, $2.00, to the cost of a pretzel of pretzel, $3.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.50p is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of soda to the cost of a pretzel of pretzel. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of soda costs $2.00.\nA pretzel of pretzel costs $3.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.00+3.50) is one way to find how much money DJ Maya will spend on bottle of sodas and pretzels."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.00p+3.50p\n5.50p\np(2.00+3.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_37"
  },
  {
    "question_text": "Mr. Circuit manages the robotics workshop. In December, they had to order 8 kits of servo motors 5 times because of frequent use. Each kit contains c motors.\n\nPick all the expressions that represent how many motors Mr. Circuit ordered in December.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "5c+8c",
      "5(8c)",
      "40c",
      "c(5+8)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many motors Mr. Circuit ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mr. Circuit ordered servo motors by how many motors are in each order."
      ],
      [
        "3/10",
        "Mr. Circuit ordered servo motors 5 times, or 5 times."
      ],
      [
        "4/10",
        "There are 8c motors in each order. Multiply how many kits Mr. Circuit ordered each time, 8, by how many motors are in each kit, c."
      ],
      [
        "5/10",
        "So, 5(8c) is one way to find how many motors Mr. Circuit ordered in December."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many kits Mr. Circuit ordered in December by how many motors are in each kit."
      ],
      [
        "7/10",
        "Mr. Circuit ordered 40 kits in December. Multiply the number of kits in each order, 8, by how many times they ordered servo motors in December, 5."
      ],
      [
        "8/10",
        "There are c motors in each kit."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many motors Mr. Circuit ordered in December."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n5(8c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_38"
  },
  {
    "question_text": "Dr. Peterson is organizing a science fair awards ceremony. There will be p people attending altogether. Dr. Peterson estimates they'll need one box of juice box and one muffin of muffin per person. A box of juice box costs $4.00, and a muffin of muffin costs $1.00.\n\nPick all the expressions that represent how much money Dr. Peterson will spend on juice boxes and muffins.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "4.00(p+1)+1.00(p+1)",
      "4.00p+1.00p",
      "5.00p",
      "p(4.00+1.00)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Dr. Peterson will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Dr. Peterson will spend on juice boxes to the amount they will spend on muffins."
      ],
      [
        "3/13",
        "Dr. Peterson will spend 4.00p dollars on juice boxes.\nMultiply the cost of each box of juice box, $4.00, by the number of people, p."
      ],
      [
        "4/13",
        "Dr. Peterson will spend 1.00p dollars on muffins.\nMultiply the cost of each muffin of muffin, $1.00, by the number of people, p."
      ],
      [
        "5/13",
        "So, 4.00p+1.00p is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a box of juice box and a muffin of muffin by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a box of juice box and a muffin of muffin is $5.00.\nAdd the cost of a box of juice box, $4.00, to the cost of a muffin of muffin, $1.00."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a box of juice box to the cost of a muffin of muffin. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A box of juice box costs $4.00.\nA muffin of muffin costs $1.00.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(4.00+1.00) is one way to find how much money Dr. Peterson will spend on juice boxes and muffins."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n4.00p+1.00p\n5.00p\np(4.00+1.00)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_39"
  },
  {
    "question_text": "Ms. Green manages the school greenhouse. In June, they had to order 14 collections of seed packets three times to accommodate all students. Each collection contains c packets.\n\nPick all the expressions that represent how many packets Ms. Green ordered in June.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+14c",
      "3(14c)",
      "42c",
      "c(3+14)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many packets Ms. Green ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Green ordered seed packets by how many packets are in each order."
      ],
      [
        "3/10",
        "Ms. Green ordered seed packets three times, or 3 times."
      ],
      [
        "4/10",
        "There are 14c packets in each order. Multiply how many collections Ms. Green ordered each time, 14, by how many packets are in each collection, c."
      ],
      [
        "5/10",
        "So, 3(14c) is one way to find how many packets Ms. Green ordered in June."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many collections Ms. Green ordered in June by how many packets are in each collection."
      ],
      [
        "7/10",
        "Ms. Green ordered 42 collections in June. Multiply the number of collections in each order, 14, by how many times they ordered seed packets in June, 3."
      ],
      [
        "8/10",
        "There are c packets in each collection."
      ],
      [
        "9/10",
        "So, 42c is one way to find how many packets Ms. Green ordered in June."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(14c)\n42c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_40"
  },
  {
    "question_text": "Yuki is organizing a anime convention meetup. There will be p people attending altogether. Yuki estimates they'll need one cup of boba tea and one rice ball of rice ball per person. A cup of boba tea costs $1.75, and a rice ball of rice ball costs $3.25.\n\nPick all the expressions that represent how much money Yuki will spend on boba teas and rice balls.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "1.75(p+1)+3.25(p+1)",
      "1.75p+3.25p",
      "5.00p",
      "p(1.75+3.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Yuki will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Yuki will spend on boba teas to the amount they will spend on rice balls."
      ],
      [
        "3/13",
        "Yuki will spend 1.75p dollars on boba teas.\nMultiply the cost of each cup of boba tea, $1.75, by the number of people, p."
      ],
      [
        "4/13",
        "Yuki will spend 3.25p dollars on rice balls.\nMultiply the cost of each rice ball of rice ball, $3.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 1.75p+3.25p is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of boba tea and a rice ball of rice ball by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of boba tea and a rice ball of rice ball is $5.00.\nAdd the cost of a cup of boba tea, $1.75, to the cost of a rice ball of rice ball, $3.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of boba tea to the cost of a rice ball of rice ball. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of boba tea costs $1.75.\nA rice ball of rice ball costs $3.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(1.75+3.25) is one way to find how much money Yuki will spend on boba teas and rice balls."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n1.75p+3.25p\n5.00p\np(1.75+3.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_41"
  },
  {
    "question_text": "Coach Pixel manages the gaming arena. In August, they had to order 22 boxes of gaming mice twice due to overwhelming interest. Each box contains c mice.\n\nPick all the expressions that represent how many mice Coach Pixel ordered in August.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+22c",
      "2(22c)",
      "44c",
      "c(2+22)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many mice Coach Pixel ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Coach Pixel ordered gaming mice by how many mice are in each order."
      ],
      [
        "3/10",
        "Coach Pixel ordered gaming mice twice, or 2 times."
      ],
      [
        "4/10",
        "There are 22c mice in each order. Multiply how many boxes Coach Pixel ordered each time, 22, by how many mice are in each box, c."
      ],
      [
        "5/10",
        "So, 2(22c) is one way to find how many mice Coach Pixel ordered in August."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many boxes Coach Pixel ordered in August by how many mice are in each box."
      ],
      [
        "7/10",
        "Coach Pixel ordered 44 boxes in August. Multiply the number of boxes in each order, 22, by how many times they ordered gaming mice in August, 2."
      ],
      [
        "8/10",
        "There are c mice in each box."
      ],
      [
        "9/10",
        "So, 44c is one way to find how many mice Coach Pixel ordered in August."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(22c)\n44c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_42"
  },
  {
    "question_text": "Alex is organizing a gaming tournament this weekend. There will be p people attending altogether. Alex estimates they'll need one can of energy drink and one bag of bag of chips per person. A can of energy drink costs $3.00, and a bag of bag of chips costs $2.00.\n\nPick all the expressions that represent how much money Alex will spend on energy drinks and bag of chipss.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.00(p+1)+2.00(p+1)",
      "3.00p+2.00p",
      "5.00p",
      "p(3.00+2.00)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Alex will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Alex will spend on energy drinks to the amount they will spend on bag of chipss."
      ],
      [
        "3/13",
        "Alex will spend 3.00p dollars on energy drinks.\nMultiply the cost of each can of energy drink, $3.00, by the number of people, p."
      ],
      [
        "4/13",
        "Alex will spend 2.00p dollars on bag of chipss.\nMultiply the cost of each bag of bag of chips, $2.00, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.00p+2.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a can of energy drink and a bag of bag of chips by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a can of energy drink and a bag of bag of chips is $5.00.\nAdd the cost of a can of energy drink, $3.00, to the cost of a bag of bag of chips, $2.00."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a can of energy drink to the cost of a bag of bag of chips. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A can of energy drink costs $3.00.\nA bag of bag of chips costs $2.00.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.00+2.00) is one way to find how much money Alex will spend on energy drinks and bag of chipss."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.00p+2.00p\n5.00p\np(3.00+2.00)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_43"
  },
  {
    "question_text": "Ms. Garcia manages the school library. In September, they had to order 12 sets of manga series three times because the students love them so much. Each set contains c volumes.\n\nPick all the expressions that represent how many volumes Ms. Garcia ordered in September.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+12c",
      "3(12c)",
      "36c",
      "c(3+12)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many volumes Ms. Garcia ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Ms. Garcia ordered manga series by how many volumes are in each order."
      ],
      [
        "3/10",
        "Ms. Garcia ordered manga series three times, or 3 times."
      ],
      [
        "4/10",
        "There are 12c volumes in each order. Multiply how many sets Ms. Garcia ordered each time, 12, by how many volumes are in each set, c."
      ],
      [
        "5/10",
        "So, 3(12c) is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many sets Ms. Garcia ordered in September by how many volumes are in each set."
      ],
      [
        "7/10",
        "Ms. Garcia ordered 36 sets in September. Multiply the number of sets in each order, 12, by how many times they ordered manga series in September, 3."
      ],
      [
        "8/10",
        "There are c volumes in each set."
      ],
      [
        "9/10",
        "So, 36c is one way to find how many volumes Ms. Garcia ordered in September."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(12c)\n36c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_44"
  },
  {
    "question_text": "Sofia is organizing a birthday party on Saturday. There will be p people attending altogether. Sofia estimates they'll need one slice of slice of pizza and one cupcake of cupcake per person. A slice of slice of pizza costs $2.75, and a cupcake of cupcake costs $1.75.\n\nPick all the expressions that represent how much money Sofia will spend on slice of pizzas and cupcakes.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.75(p+1)+1.75(p+1)",
      "2.75p+1.75p",
      "4.50p",
      "p(2.75+1.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Sofia will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Sofia will spend on slice of pizzas to the amount they will spend on cupcakes."
      ],
      [
        "3/13",
        "Sofia will spend 2.75p dollars on slice of pizzas.\nMultiply the cost of each slice of slice of pizza, $2.75, by the number of people, p."
      ],
      [
        "4/13",
        "Sofia will spend 1.75p dollars on cupcakes.\nMultiply the cost of each cupcake of cupcake, $1.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.75p+1.75p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a slice of slice of pizza and a cupcake of cupcake by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a slice of slice of pizza and a cupcake of cupcake is $4.50.\nAdd the cost of a slice of slice of pizza, $2.75, to the cost of a cupcake of cupcake, $1.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 4.50p is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a slice of slice of pizza to the cost of a cupcake of cupcake. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A slice of slice of pizza costs $2.75.\nA cupcake of cupcake costs $1.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.75+1.75) is one way to find how much money Sofia will spend on slice of pizzas and cupcakes."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.75p+1.75p\n4.50p\np(2.75+1.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_45"
  },
  {
    "question_text": "Mr. Tech manages the computer lab. In January, they had to order 20 packs of USB drives twice due to high demand. Each pack contains c drives.\n\nPick all the expressions that represent how many drives Mr. Tech ordered in January.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+20c",
      "2(20c)",
      "40c",
      "c(2+20)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many drives Mr. Tech ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Mr. Tech ordered USB drives by how many drives are in each order."
      ],
      [
        "3/10",
        "Mr. Tech ordered USB drives twice, or 2 times."
      ],
      [
        "4/10",
        "There are 20c drives in each order. Multiply how many packs Mr. Tech ordered each time, 20, by how many drives are in each pack, c."
      ],
      [
        "5/10",
        "So, 2(20c) is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many packs Mr. Tech ordered in January by how many drives are in each pack."
      ],
      [
        "7/10",
        "Mr. Tech ordered 40 packs in January. Multiply the number of packs in each order, 20, by how many times they ordered USB drives in January, 2."
      ],
      [
        "8/10",
        "There are c drives in each pack."
      ],
      [
        "9/10",
        "So, 40c is one way to find how many drives Mr. Tech ordered in January."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(20c)\n40c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_46"
  },
  {
    "question_text": "Marcus is organizing a study group session tomorrow. There will be p people attending altogether. Marcus estimates they'll need one bottle of bottle of water and one bar of granola bar per person. A bottle of bottle of water costs $3.50, and a bar of granola bar costs $1.50.\n\nPick all the expressions that represent how much money Marcus will spend on bottle of waters and granola bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.50(p+1)+1.50(p+1)",
      "3.50p+1.50p",
      "5.00p",
      "p(3.50+1.50)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Marcus will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Marcus will spend on bottle of waters to the amount they will spend on granola bars."
      ],
      [
        "3/13",
        "Marcus will spend 3.50p dollars on bottle of waters.\nMultiply the cost of each bottle of bottle of water, $3.50, by the number of people, p."
      ],
      [
        "4/13",
        "Marcus will spend 1.50p dollars on granola bars.\nMultiply the cost of each bar of granola bar, $1.50, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.50p+1.50p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of bottle of water and a bar of granola bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of bottle of water and a bar of granola bar is $5.00.\nAdd the cost of a bottle of bottle of water, $3.50, to the cost of a bar of granola bar, $1.50."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of bottle of water to the cost of a bar of granola bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of bottle of water costs $3.50.\nA bar of granola bar costs $1.50.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.50+1.50) is one way to find how much money Marcus will spend on bottle of waters and granola bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.50p+1.50p\n5.00p\np(3.50+1.50)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_47"
  },
  {
    "question_text": "Professor Lee manages the art studio. In March, they had to order 18 bundles of paint brushes three times because they kept running out. Each bundle contains c brushes.\n\nPick all the expressions that represent how many brushes Professor Lee ordered in March.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3c+18c",
      "3(18c)",
      "54c",
      "c(3+18)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many brushes Professor Lee ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Professor Lee ordered paint brushes by how many brushes are in each order."
      ],
      [
        "3/10",
        "Professor Lee ordered paint brushes three times, or 3 times."
      ],
      [
        "4/10",
        "There are 18c brushes in each order. Multiply how many bundles Professor Lee ordered each time, 18, by how many brushes are in each bundle, c."
      ],
      [
        "5/10",
        "So, 3(18c) is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many bundles Professor Lee ordered in March by how many brushes are in each bundle."
      ],
      [
        "7/10",
        "Professor Lee ordered 54 bundles in March. Multiply the number of bundles in each order, 18, by how many times they ordered paint brushes in March, 3."
      ],
      [
        "8/10",
        "There are c brushes in each bundle."
      ],
      [
        "9/10",
        "So, 54c is one way to find how many brushes Professor Lee ordered in March."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n3(18c)\n54c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_48"
  },
  {
    "question_text": "Coach Chen is organizing a team victory celebration. There will be p people attending altogether. Coach Chen estimates they'll need one bottle of sports drink and one bar of protein bar per person. A bottle of sports drink costs $2.25, and a bar of protein bar costs $2.75.\n\nPick all the expressions that represent how much money Coach Chen will spend on sports drinks and protein bars.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2.25(p+1)+2.75(p+1)",
      "2.25p+2.75p",
      "5.00p",
      "p(2.25+2.75)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Coach Chen will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Coach Chen will spend on sports drinks to the amount they will spend on protein bars."
      ],
      [
        "3/13",
        "Coach Chen will spend 2.25p dollars on sports drinks.\nMultiply the cost of each bottle of sports drink, $2.25, by the number of people, p."
      ],
      [
        "4/13",
        "Coach Chen will spend 2.75p dollars on protein bars.\nMultiply the cost of each bar of protein bar, $2.75, by the number of people, p."
      ],
      [
        "5/13",
        "So, 2.25p+2.75p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a bottle of sports drink and a bar of protein bar by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a bottle of sports drink and a bar of protein bar is $5.00.\nAdd the cost of a bottle of sports drink, $2.25, to the cost of a bar of protein bar, $2.75."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.00p is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a bottle of sports drink to the cost of a bar of protein bar. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A bottle of sports drink costs $2.25.\nA bar of protein bar costs $2.75.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(2.25+2.75) is one way to find how much money Coach Chen will spend on sports drinks and protein bars."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n2.25p+2.75p\n5.00p\np(2.25+2.75)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_49"
  },
  {
    "question_text": "Coach Williams manages the school gym. In February, they had to order 25 crates of basketballs twice to meet student requests. Each crate contains c balls.\n\nPick all the expressions that represent how many balls Coach Williams ordered in February.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "2c+25c",
      "2(25c)",
      "50c",
      "c(2+25)"
    ],
    "correct_answers": [
      "B",
      "C"
    ],
    "solution": [
      [
        "1/10",
        "You can find how many balls Coach Williams ordered in more than one way."
      ],
      [
        "2/10",
        "One way:\nMultiply how many times Coach Williams ordered basketballs by how many balls are in each order."
      ],
      [
        "3/10",
        "Coach Williams ordered basketballs twice, or 2 times."
      ],
      [
        "4/10",
        "There are 25c balls in each order. Multiply how many crates Coach Williams ordered each time, 25, by how many balls are in each crate, c."
      ],
      [
        "5/10",
        "So, 2(25c) is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "6/10",
        "Another way:\nMultiply how many crates Coach Williams ordered in February by how many balls are in each crate."
      ],
      [
        "7/10",
        "Coach Williams ordered 50 crates in February. Multiply the number of crates in each order, 25, by how many times they ordered basketballs in February, 2."
      ],
      [
        "8/10",
        "There are c balls in each crate."
      ],
      [
        "9/10",
        "So, 50c is one way to find how many balls Coach Williams ordered in February."
      ],
      [
        "10/10",
        "Notice that the correct answers are equivalent expressions:\n2(25c)\n50c\nThe other answer choices are not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_50"
  },
  {
    "question_text": "Emma is organizing a art club exhibition opening. There will be p people attending altogether. Emma estimates they'll need one cup of cup of coffee and one cookie of cookie per person. A cup of cup of coffee costs $3.25, and a cookie of cookie costs $2.25.\n\nPick all the expressions that represent how much money Emma will spend on cup of coffees and cookies.",
    "skills": "identify-equivalent-linear-expressions-word-problems",
    "question_type": "Multiple Choice with Multiple Answers",
    "tag": "Gr8_30_E3",
    "choices": [
      "3.25(p+1)+2.25(p+1)",
      "3.25p+2.25p",
      "5.50p",
      "p(3.25+2.25)"
    ],
    "correct_answers": [
      "B",
      "C",
      "D"
    ],
    "solution": [
      [
        "1/13",
        "You can find how much money Emma will spend in more than one way."
      ],
      [
        "2/13",
        "One way:\nAdd the amount Emma will spend on cup of coffees to the amount they will spend on cookies."
      ],
      [
        "3/13",
        "Emma will spend 3.25p dollars on cup of coffees.\nMultiply the cost of each cup of cup of coffee, $3.25, by the number of people, p."
      ],
      [
        "4/13",
        "Emma will spend 2.25p dollars on cookies.\nMultiply the cost of each cookie of cookie, $2.25, by the number of people, p."
      ],
      [
        "5/13",
        "So, 3.25p+2.25p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "6/13",
        "A second way:\nMultiply the combined cost of a cup of cup of coffee and a cookie of cookie by the number of people."
      ],
      [
        "7/13",
        "The combined cost of a cup of cup of coffee and a cookie of cookie is $5.50.\nAdd the cost of a cup of cup of coffee, $3.25, to the cost of a cookie of cookie, $2.25."
      ],
      [
        "8/13",
        "There will be p people attending."
      ],
      [
        "9/13",
        "So, 5.50p is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "10/13",
        "A third way:\nAdd the cost of a cup of cup of coffee to the cost of a cookie of cookie. Then, multiply that by the number of people."
      ],
      [
        "11/13",
        "A cup of cup of coffee costs $3.25.\nA cookie of cookie costs $2.25.\nThere will be p people attending."
      ],
      [
        "12/13",
        "So, p(3.25+2.25) is one way to find how much money Emma will spend on cup of coffees and cookies."
      ],
      [
        "13/13",
        "Notice that the correct answers are equivalent expressions:\n3.25p+2.25p\n5.50p\np(3.25+2.25)\nThe other answer choice is not equivalent to these."
      ]
    ],
    "solution_image_tag": [],
    "question_number": "3_51"
  }
]