[
  { "question_text": "Pick the correct base plan for this structure.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_2",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Star Wars holocron layers. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of blue and red to represent depth and sides. The top view of the prism is shown, with the blue and red cubes arranged in a 2 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_2",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_2_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Star Wars holocron layers. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of blue and red to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 3 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_2_step_2",
        "The top view of the 3D object is shown as a 2 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_2_step_3",
        "This image displays a flat grid of 6 blue and red squares arranged in 3 rows and 2 columns, representing the 2 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which choice represents the accurate base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_3",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pac-Man power pellet arrangements. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of yellow and white to represent depth and sides. The top view of the prism is shown, with the yellow and white cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_3",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_3_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pac-Man power pellet arrangements. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of yellow and white to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_3_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_3_step_3",
        "This image displays a flat grid of 10 yellow and white squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Determine which base plan fits this 3D model.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_4",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view of the prism is shown, with the green pixelated cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_4",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_4_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_4_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_4_step_3",
        "This image displays a flat grid of 9 green pixelated squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which diagram shows this object's base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_5",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Avatar element towers. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of four elemental colors to represent depth and sides. The top view of the prism is shown, with the four elemental colors cubes arranged in a 3 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_5",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_5_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Avatar element towers. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of four elemental colors to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 2 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_5_step_2",
        "The top view of the 3D object is shown as a 3 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_5_step_3",
        "This image displays a flat grid of 6 four elemental colors squares arranged in 2 rows and 3 columns, representing the 3 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What would the base plan of this figure look like?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_6",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of gold and bronze to represent depth and sides. The top view of the prism is shown, with the gold and bronze cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_6",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_6_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of gold and bronze to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_6_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_6_step_3",
        "This image displays a flat grid of 9 gold and bronze squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Find the appropriate base plan for this object.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_7",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_7",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_7_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_7_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_7_step_3",
        "This image displays a flat grid of 9 red and blue squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which base plan properly represents this figure?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_8",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of gold and bronze to represent depth and sides. The top view of the prism is shown, with the gold and bronze cubes arranged in a 3 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_8",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_8_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of gold and bronze to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 4 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_8_step_2",
        "The top view of the 3D object is shown as a 3 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_8_step_3",
        "This image displays a flat grid of 12 gold and bronze squares arranged in 4 rows and 3 columns, representing the 3 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What is the base plan view of this structure?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_9",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Final Fantasy crystal formations. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of blue and white to represent depth and sides. The top view of the prism is shown, with the blue and white cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_9",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_9_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Final Fantasy crystal formations. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of blue and white to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_9_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_9_step_3",
        "This image displays a flat grid of 4 blue and white squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Choose the base plan that matches this construction.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_10",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of wood and stone to represent depth and sides. The top view of the prism is shown, with the wood and stone cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_10",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_10_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of wood and stone to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_10_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_10_step_3",
        "This image displays a flat grid of 10 wood and stone squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What base plan matches this three-dimensional object?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_11",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view of the prism is shown, with the green pixelated cubes arranged in a 4 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_11",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_11_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 3 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_11_step_2",
        "The top view of the 3D object is shown as a 4 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_11_step_3",
        "This image displays a flat grid of 12 green pixelated squares arranged in 3 rows and 4 columns, representing the 4 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Determine the correct base plan representation.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_12",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of gold and bronze to represent depth and sides. The top view of the prism is shown, with the gold and bronze cubes arranged in a 2 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_12",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_12_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of gold and bronze to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 4 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_12_step_2",
        "The top view of the 3D object is shown as a 2 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_12_step_3",
        "This image displays a flat grid of 8 gold and bronze squares arranged in 4 rows and 2 columns, representing the 2 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What is the correct base plan for this shape?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_13",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of wood and stone to represent depth and sides. The top view of the prism is shown, with the wood and stone cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_13",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_13_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of wood and stone to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_13_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_13_step_3",
        "This image displays a flat grid of 10 wood and stone squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Find the matching base plan for this figure.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_14",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Dragon Ball power level meters. The prism is arranged as a 4 by 4 by 2 cube, with varying shades of orange and yellow to represent depth and sides. The top view of the prism is shown, with the orange and yellow cubes arranged in a 4 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_14",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_14_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Dragon Ball power level meters. The prism is arranged as a 4 by 4 by 2 cube, with varying shades of orange and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 4 arrangement of 16 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_14_step_2",
        "The top view of the 3D object is shown as a 4 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_14_step_3",
        "This image displays a flat grid of 16 orange and yellow squares arranged in 4 rows and 4 columns, representing the 4 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the base plan that matches this 3D structure.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_15",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Tetris stacked blocks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of cyan and purple to represent depth and sides. The top view of the prism is shown, with the cyan and purple cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_15",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_15_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Tetris stacked blocks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of cyan and purple to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_15_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_15_step_3",
        "This image displays a flat grid of 4 cyan and purple squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which base plan correctly shows this figure?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_16",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Portal companion cube sections. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of pink and gray to represent depth and sides. The top view of the prism is shown, with the pink and gray cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_16",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_16_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Portal companion cube sections. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of pink and gray to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_16_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_16_step_3",
        "This image displays a flat grid of 4 pink and gray squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify the base plan view for this model.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_17",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 2 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_17",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_17_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 4 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_17_step_2",
        "The top view of the 3D object is shown as a 2 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_17_step_3",
        "This image displays a flat grid of 8 red and blue squares arranged in 4 rows and 2 columns, representing the 2 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Pick the base plan that represents this 3D form.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_18",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Sonic speed blocks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of blue and gold to represent depth and sides. The top view of the prism is shown, with the blue and gold cubes arranged in a 3 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_18",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_18_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Sonic speed blocks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of blue and gold to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 4 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_18_step_2",
        "The top view of the 3D object is shown as a 3 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_18_step_3",
        "This image displays a flat grid of 12 blue and gold squares arranged in 4 rows and 3 columns, representing the 3 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify the matching base plan view.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_19",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pac-Man power pellet arrangements. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of yellow and white to represent depth and sides. The top view of the prism is shown, with the yellow and white cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_19",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_19_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pac-Man power pellet arrangements. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of yellow and white to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_19_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_19_step_3",
        "This image displays a flat grid of 10 yellow and white squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Find the correct base plan diagram below.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_20",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pokemon gym badges. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of silver and gold to represent depth and sides. The top view of the prism is shown, with the silver and gold cubes arranged in a 2 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_20",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_20_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pokemon gym badges. The prism is arranged as a 2 by 4 by 3 cube, with varying shades of silver and gold to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 4 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_20_step_2",
        "The top view of the 3D object is shown as a 2 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_20_step_3",
        "This image displays a flat grid of 8 silver and gold squares arranged in 4 rows and 2 columns, representing the 2 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What does this object's base plan look like?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_21",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of white and yellow to represent depth and sides. The top view of the prism is shown, with the white and yellow cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_21",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_21_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of white and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_21_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_21_step_3",
        "This image displays a flat grid of 4 white and yellow squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Pick the base plan that fits this shape.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_22",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_22",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_22_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_22_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_22_step_3",
        "This image displays a flat grid of 9 red and blue squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which image correctly shows the base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_23",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of wood and stone to represent depth and sides. The top view of the prism is shown, with the wood and stone cubes arranged in a 2 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_23",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_23_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of wood and stone to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 3 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_23_step_2",
        "The top view of the 3D object is shown as a 2 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_23_step_3",
        "This image displays a flat grid of 6 wood and stone squares arranged in 3 rows and 2 columns, representing the 2 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the base plan for this three-dimensional form.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_24",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of white and yellow to represent depth and sides. The top view of the prism is shown, with the white and yellow cubes arranged in a 4 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_24",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_24_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of white and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 3 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_24_step_2",
        "The top view of the 3D object is shown as a 4 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_24_step_3",
        "This image displays a flat grid of 12 white and yellow squares arranged in 3 rows and 4 columns, representing the 4 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Choose the base plan diagram that matches.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_25",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view of the prism is shown, with the blue glowing cubes arranged in a 4 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_25",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_25_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 4 by 3 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 3 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_25_step_2",
        "The top view of the 3D object is shown as a 4 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_25_step_3",
        "This image displays a flat grid of 12 blue glowing squares arranged in 3 rows and 4 columns, representing the 4 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What base plan represents this 3D structure?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_26",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Tetris stacked blocks. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of cyan and purple to represent depth and sides. The top view of the prism is shown, with the cyan and purple cubes arranged in a 5 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_26",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_26_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Tetris stacked blocks. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of cyan and purple to represent depth and sides. The top view is highlighted with a black border, showing the 5 by 2 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_26_step_2",
        "The top view of the 3D object is shown as a 5 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_26_step_3",
        "This image displays a flat grid of 10 cyan and purple squares arranged in 2 rows and 5 columns, representing the 5 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which option shows the right base plan view?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_27",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of white and yellow to represent depth and sides. The top view of the prism is shown, with the white and yellow cubes arranged in a 3 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_27",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_27_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 3 by 4 by 2 cube, with varying shades of white and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 4 arrangement of 12 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_27_step_2",
        "The top view of the 3D object is shown as a 3 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_27_step_3",
        "This image displays a flat grid of 12 white and yellow squares arranged in 4 rows and 3 columns, representing the 3 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What base plan corresponds to this arrangement?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_28",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of wood and stone to represent depth and sides. The top view of the prism is shown, with the wood and stone cubes arranged in a 5 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_28",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_28_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of wood and stone to represent depth and sides. The top view is highlighted with a black border, showing the 5 by 2 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_28_step_2",
        "The top view of the 3D object is shown as a 5 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_28_step_3",
        "This image displays a flat grid of 10 wood and stone squares arranged in 2 rows and 5 columns, representing the 5 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the appropriate base plan diagram.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_29",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of white and yellow to represent depth and sides. The top view of the prism is shown, with the white and yellow cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_29",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_29_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Overwatch health pack stacks. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of white and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_29_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_29_step_3",
        "This image displays a flat grid of 9 white and yellow squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Find the base plan that corresponds to this object.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_30",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Portal companion cube sections. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of pink and gray to represent depth and sides. The top view of the prism is shown, with the pink and gray cubes arranged in a 2 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_30",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_30_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Portal companion cube sections. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of pink and gray to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 3 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_30_step_2",
        "The top view of the 3D object is shown as a 2 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_30_step_3",
        "This image displays a flat grid of 6 pink and gray squares arranged in 3 rows and 2 columns, representing the 2 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Determine which option shows the correct base plan.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_31",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of gold and bronze to represent depth and sides. The top view of the prism is shown, with the gold and bronze cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_31",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_31_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Mario coin stacks. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of gold and bronze to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_31_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_31_step_3",
        "This image displays a flat grid of 4 gold and bronze squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the base plan view of this construction.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_32",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Harry Potter potion vials. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of green and purple to represent depth and sides. The top view of the prism is shown, with the green and purple cubes arranged in a 4 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_32",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_32_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Harry Potter potion vials. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of green and purple to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 2 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_32_step_2",
        "The top view of the 3D object is shown as a 4 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_32_step_3",
        "This image displays a flat grid of 8 green and purple squares arranged in 2 rows and 4 columns, representing the 4 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which image displays this structure's base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_33",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of blue glowing to represent depth and sides. The top view of the prism is shown, with the blue glowing cubes arranged in a 2 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_33",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_33_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 2 by 3 by 4 cube, with varying shades of blue glowing to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 3 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_33_step_2",
        "The top view of the 3D object is shown as a 2 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_33_step_3",
        "This image displays a flat grid of 6 blue glowing squares arranged in 3 rows and 2 columns, representing the 2 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify which base plan fits this 3D shape.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_34",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of blue glowing to represent depth and sides. The top view of the prism is shown, with the blue glowing cubes arranged in a 4 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_34",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_34_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of blue glowing to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 2 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_34_step_2",
        "The top view of the 3D object is shown as a 4 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_34_step_3",
        "This image displays a flat grid of 8 blue glowing squares arranged in 2 rows and 4 columns, representing the 4 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which diagram correctly displays the base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_35",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view of the prism is shown, with the purple and orange cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_35",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_35_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_35_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_35_step_3",
        "This image displays a flat grid of 4 purple and orange squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the correct base plan representation.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_36",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Star Wars holocron layers. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of blue and red to represent depth and sides. The top view of the prism is shown, with the blue and red cubes arranged in a 3 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_36",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_36_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Star Wars holocron layers. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of blue and red to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 2 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_36_step_2",
        "The top view of the 3D object is shown as a 3 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_36_step_3",
        "This image displays a flat grid of 6 blue and red squares arranged in 2 rows and 3 columns, representing the 3 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify the correct base plan representation below.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_37",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view of the prism is shown, with the blue glowing cubes arranged in a 5 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_37",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_37_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view is highlighted with a black border, showing the 5 by 2 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_37_step_2",
        "The top view of the 3D object is shown as a 5 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_37_step_3",
        "This image displays a flat grid of 10 blue glowing squares arranged in 2 rows and 5 columns, representing the 5 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What is this three-dimensional object's base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_38",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view of the prism is shown, with the blue glowing cubes arranged in a 5 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_38",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_38_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Zelda shrine pieces. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of blue glowing to represent depth and sides. The top view is highlighted with a black border, showing the 5 by 2 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_38_step_2",
        "The top view of the 3D object is shown as a 5 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_38_step_3",
        "This image displays a flat grid of 10 blue glowing squares arranged in 2 rows and 5 columns, representing the 5 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which option shows the correct base plan for this object?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_39",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of wood and stone to represent depth and sides. The top view of the prism is shown, with the wood and stone cubes arranged in a 3 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_39",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_39_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Fortnite material stacks. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of wood and stone to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 2 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_39_step_2",
        "The top view of the 3D object is shown as a 3 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_39_step_3",
        "This image displays a flat grid of 6 wood and stone squares arranged in 2 rows and 3 columns, representing the 3 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the base plan as viewed from above.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_40",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pokemon gym badges. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of silver and gold to represent depth and sides. The top view of the prism is shown, with the silver and gold cubes arranged in a 5 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_40",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_40_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Pokemon gym badges. The prism is arranged as a 5 by 2 by 3 cube, with varying shades of silver and gold to represent depth and sides. The top view is highlighted with a black border, showing the 5 by 2 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_40_step_2",
        "The top view of the 3D object is shown as a 5 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_40_step_3",
        "This image displays a flat grid of 10 silver and gold squares arranged in 2 rows and 5 columns, representing the 5 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Choose the accurate base plan representation.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_41",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Dragon Ball power level meters. The prism is arranged as a 4 by 4 by 2 cube, with varying shades of orange and yellow to represent depth and sides. The top view of the prism is shown, with the orange and yellow cubes arranged in a 4 by 4 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_41",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_41_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Dragon Ball power level meters. The prism is arranged as a 4 by 4 by 2 cube, with varying shades of orange and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 4 arrangement of 16 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_41_step_2",
        "The top view of the 3D object is shown as a 4 by 4 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_41_step_3",
        "This image displays a flat grid of 16 orange and yellow squares arranged in 4 rows and 4 columns, representing the 4 by 4 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Determine the base plan for the structure shown.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_42",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 3 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_42",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_42_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 3 by 2 by 6 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 2 arrangement of 6 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_42_step_2",
        "The top view of the 3D object is shown as a 3 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_42_step_3",
        "This image displays a flat grid of 6 red and blue squares arranged in 2 rows and 3 columns, representing the 3 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "What is the proper base plan for this object?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_43",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view of the prism is shown, with the purple and orange cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_43",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_43_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_43_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_43_step_3",
        "This image displays a flat grid of 9 purple and orange squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which base plan corresponds to this 3D object?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_44",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view of the prism is shown, with the purple and orange cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_44",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_44_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 3 by 3 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_44_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_44_step_3",
        "This image displays a flat grid of 9 purple and orange squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Choose the accurate base plan for this shape.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_45",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_45",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_45_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_45_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_45_step_3",
        "This image displays a flat grid of 10 red and blue squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Which option displays the proper base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_46",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as LEGO tower pieces. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of red and yellow to represent depth and sides. The top view of the prism is shown, with the red and yellow cubes arranged in a 4 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_46",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_46_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as LEGO tower pieces. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of red and yellow to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 2 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_46_step_2",
        "The top view of the 3D object is shown as a 4 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_46_step_3",
        "This image displays a flat grid of 8 red and yellow squares arranged in 2 rows and 4 columns, representing the 4 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify the base plan for the given structure.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_47",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view of the prism is shown, with the purple and orange cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_47",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_47_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of purple and orange to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_47_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_47_step_3",
        "This image displays a flat grid of 4 purple and orange squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Choose the base plan view shown from above.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_48",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of purple and orange to represent depth and sides. The top view of the prism is shown, with the purple and orange cubes arranged in a 2 by 5 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_48",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_48_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Marvel power cores. The prism is arranged as a 2 by 5 by 2 cube, with varying shades of purple and orange to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 5 arrangement of 10 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_48_step_2",
        "The top view of the 3D object is shown as a 2 by 5 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_48_step_3",
        "This image displays a flat grid of 10 purple and orange squares arranged in 5 rows and 2 columns, representing the 2 by 5 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Can you identify this object's base plan?",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_49",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view of the prism is shown, with the green pixelated cubes arranged in a 3 by 3 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_49",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_49_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Space Invaders defense barriers. The prism is arranged as a 3 by 3 by 3 cube, with varying shades of green pixelated to represent depth and sides. The top view is highlighted with a black border, showing the 3 by 3 arrangement of 9 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_49_step_2",
        "The top view of the 3D object is shown as a 3 by 3 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_49_step_3",
        "This image displays a flat grid of 9 green pixelated squares arranged in 3 rows and 3 columns, representing the 3 by 3 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Identify the correct base plan below.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_50",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Minecraft building blocks. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of green and brown to represent depth and sides. The top view of the prism is shown, with the green and brown cubes arranged in a 4 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_50",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "A"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_50_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Minecraft building blocks. The prism is arranged as a 4 by 2 by 4 cube, with varying shades of green and brown to represent depth and sides. The top view is highlighted with a black border, showing the 4 by 2 arrangement of 8 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_50_step_2",
        "The top view of the 3D object is shown as a 4 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_50_step_3",
        "This image displays a flat grid of 8 green and brown squares arranged in 2 rows and 4 columns, representing the 4 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  },
  { "question_text": "Select the matching base plan from the options.",
    "skills": "base-plans",
    "image_tag": "Gr8_39_2_51",
    "backend_description": "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of red and blue to represent depth and sides. The top view of the prism is shown, with the red and blue cubes arranged in a 2 by 2 grid.",
    "question_type": "Multiple Choice Question with Single Answer",
    "question_number": "2_51",
    "tag": "Gr8_39_E2",
    "correct_answers": [
      "B"
    ],
    "solution": [
      [
        "1/3",
        "Imagine you are looking at this object from the top. You will see the squares highlighted below:"
      ],
      [
        "2/3",
        "Label the height of each part, like this:"
      ],
      [
        "3/3",
        "This is the base plan"
      ]
    ],
    "solution_image_tag": [
      [
        "1/3",
        "Gr8_39_2_51_step_1",
        "The image shows a 3D rectangular prism made up of smaller unit cubes styled as Among Us task modules. The prism is arranged as a 2 by 2 by 5 cube, with varying shades of red and blue to represent depth and sides. The top view is highlighted with a black border, showing the 2 by 2 arrangement of 4 visible unit squares."
      ],
      [
        "2/3",
        "Gr8_39_2_51_step_2",
        "The top view of the 3D object is shown as a 2 by 2 grid of squares."
      ],
      [
        "3/3",
        "Gr8_39_2_51_step_3",
        "This image displays a flat grid of 4 red and blue squares arranged in 2 rows and 2 columns, representing the 2 by 2 base plan of the prism that is visible from the top."
      ]
    ]
  }
]